Tonyu.klass.define({
  fullName: 'user.Lines',
  shortName: 'Lines',
  namespace: 'user',
  superclass: Tonyu.classes.kernel.Actor,
  includes: [],
  methods: function (__superClass) {
    return {
      main :function _trc_Lines_main() {
        "use strict";
        var _this=this;
        
        //$LASTPOS=1000000;//user.Lines:0
        Tonyu.globals.$lines={"宗谷本線": {},"石北本線": {},"釧網本線": {},"函館本線": {},"富良野線": {},"根室本線": {},"室蘭本線": {},"留萌本線": {},"札沼線": {},"石勝線": {},"日高本線": {},"千歳線": {},"大湊線": {},"津軽線": {},"五能線": {},"奥羽本線": {},"八戸線": {},"東北本線": {},"花輪線": {},"田沢湖線": {},"北上線": {},"山田線": {},"男鹿線": {},"釜石線": {},"大船渡線": {},"羽越本線": {},"陸羽西線": {},"陸羽東線": {},"石巻線": {},"仙石線": {},"仙石東北ライン": {},"仙山線": {},"左沢線": {},"米坂線": {},"磐越西線": {},"磐越東線": {},"白新線": {},"只見線": {},"水郡線": {},"上越線": {},"越後線": {},"弥彦線": {},"烏山線": {},"日光線": {},"飯山線": {},"信越本線": {},"吾妻線": {},"両毛線": {},"水戸線": {},"総武本線": {},"外房線": {},"内房線": {},"久留里線": {},"東金線": {},"成田線": {},"鹿島線": {},"常磐線": {},"京葉線": {},"武蔵野線": {},"高崎線": {},"八高線": {},"川越線": {},"青梅線": {},"五日市線": {},"中央本線": {},"埼京線": {},"山手線": {},"南武線": {},"横浜線": {},"根岸線": {},"鶴見線": {},"横須賀線": {},"相模線": {},"東海道本線": {},"大糸線": {},"篠ノ井線": {},"小海線": {},"御殿場線": {},"身延線": {},"伊東線": {},"飯田線": {},"太多線": {},"七尾線": {},"氷見線": {},"城端線": {},"越美北線": {},"高山本線": {},"北陸本線": {},"武豊線": {},"関西本線": {},"小浜線": {},"舞鶴線": {},"湖西線": {},"紀勢本線": {},"参宮線": {},"名松線": {},"草津線": {},"奈良線": {},"桜井線": {},"和歌山線": {},"阪和線": {},"片町線": {},"JR東西線": {},"おおさか東線": {},"関西空港線": {},"大阪環状線": {},"桜島線": {},"山陰本線": {},"福知山線": {},"播但線": {},"加古川線": {},"姫新線": {},"因美線": {},"津山線": {},"赤穂線": {},"山陽本線": {},"宇野線": {},"伯備線": {},"吉備線": {},"境線": {},"芸備線": {},"福塩線": {},"呉線": {},"可部線": {},"木次線": {},"岩徳線": {},"山口線": {},"美祢線": {},"小野田線": {},"宇部線": {},"本四備讃線": {},"高徳線": {},"予讃線": {},"内子線": {},"土讃線": {},"徳島線": {},"鳴門線": {},"牟岐線": {},"予土線": {},"鹿児島本線": {},"日豊本線": {},"博多南線": {},"筑豊本線": {},"香椎線": {},"日田彦山線": {},"後藤寺線": {},"篠栗線": {},"筑肥線": {},"唐津線": {},"佐世保線": {},"大村線": {},"長崎本線": {},"久大本線": {},"豊肥本線": {},"三角線": {},"肥薩線": {},"吉都線": {},"宮崎空港線": {},"日南線": {},"指宿枕崎線": {}};
        //$LASTPOS=1003343;//user.Lines:3343
        Tonyu.globals.$stations={"稚内": {lines: ["宗谷本線"],nexts: ["南稚内"]},"南稚内": {lines: ["宗谷本線"],nexts: ["抜海","稚内"]},"抜海": {lines: ["宗谷本線"],nexts: ["勇知","南稚内"]},"勇知": {lines: ["宗谷本線"],nexts: ["兜沼","抜海"]},"兜沼": {lines: ["宗谷本線"],nexts: ["徳満","勇知"]},"徳満": {lines: ["宗谷本線"],nexts: ["豊富","兜沼"]},"豊富": {lines: ["宗谷本線"],nexts: ["下沼","徳満"]},"下沼": {lines: ["宗谷本線"],nexts: ["幌延","豊富"]},"幌延": {lines: ["宗谷本線"],nexts: ["上幌延","下沼"]},"上幌延": {lines: ["宗谷本線"],nexts: ["南幌延","幌延"]},"南幌延": {lines: ["宗谷本線"],nexts: ["安牛","上幌延"]},"安牛": {lines: ["宗谷本線"],nexts: ["雄信内","南幌延"]},"雄信内": {lines: ["宗谷本線"],nexts: ["糠南","安牛"]},"糠南": {lines: ["宗谷本線"],nexts: ["問寒別","雄信内"]},"問寒別": {lines: ["宗谷本線"],nexts: ["歌内","糠南"]},"歌内": {lines: ["宗谷本線"],nexts: ["天塩中川","問寒別"]},"天塩中川": {lines: ["宗谷本線"],nexts: ["佐久","歌内"]},"佐久": {lines: ["宗谷本線"],nexts: ["筬島","天塩中川"]},"筬島": {lines: ["宗谷本線"],nexts: ["音威子府","佐久"]},"音威子府": {lines: ["宗谷本線"],nexts: ["咲来","筬島"]},"咲来": {lines: ["宗谷本線"],nexts: ["天塩川温泉","音威子府"]},"天塩川温泉": {lines: ["宗谷本線"],nexts: ["豊清水","咲来"]},"豊清水": {lines: ["宗谷本線"],nexts: ["恩根内","天塩川温泉"]},"恩根内": {lines: ["宗谷本線"],nexts: ["紋穂内","豊清水"]},"紋穂内": {lines: ["宗谷本線"],nexts: ["初野","恩根内"]},"初野": {lines: ["宗谷本線"],nexts: ["美深","紋穂内"]},"美深": {lines: ["宗谷本線"],nexts: ["南美深","初野"]},"南美深": {lines: ["宗谷本線"],nexts: ["智北","美深"]},"智北": {lines: ["宗谷本線"],nexts: ["智恵文","南美深"]},"智恵文": {lines: ["宗谷本線"],nexts: ["北星","智北"]},"北星": {lines: ["宗谷本線"],nexts: ["日進","智恵文"]},"日進(北)": {lines: ["宗谷本線"],nexts: ["名寄","北星"]},"名寄": {lines: ["宗谷本線"],nexts: ["東風連","日進"]},"東風連": {lines: ["宗谷本線"],nexts: ["風連","名寄"]},"風連": {lines: ["宗谷本線"],nexts: ["瑞穂","東風連"]},"瑞穂": {lines: ["宗谷本線"],nexts: ["多寄","風連"]},"多寄": {lines: ["宗谷本線"],nexts: ["下士別","瑞穂"]},"下士別": {lines: ["宗谷本線"],nexts: ["士別","多寄"]},"士別": {lines: ["宗谷本線"],nexts: ["北剣淵","下士別"]},"北剣淵": {lines: ["宗谷本線"],nexts: ["剣淵","士別"]},"剣淵": {lines: ["宗谷本線"],nexts: ["東六線","北剣淵"]},"東六線": {lines: ["宗谷本線"],nexts: ["和寒","剣淵"]},"和寒": {lines: ["宗谷本線"],nexts: ["塩狩","東六線"]},"塩狩": {lines: ["宗谷本線"],nexts: ["蘭留","和寒"]},"蘭留": {lines: ["宗谷本線"],nexts: ["北比布","塩狩"]},"北比布": {lines: ["宗谷本線"],nexts: ["比布","蘭留"]},"比布": {lines: ["宗谷本線"],nexts: ["南比布","北比布"]},"南比布": {lines: ["宗谷本線"],nexts: ["北永山","比布"]},"北永山": {lines: ["宗谷本線"],nexts: ["永山","南比布"]},"永山": {lines: ["宗谷本線"],nexts: ["新旭川","北永山"]},"新旭川": {lines: ["宗谷本線","石北本線"],nexts: ["旭川四条","永山","南永山"]},"旭川四条": {lines: ["宗谷本線"],nexts: ["旭川","新旭川"]},"旭川": {lines: ["函館本線","宗谷本線","富良野線"],nexts: ["近文","旭川四条","神楽岡"]},"近文": {lines: ["函館本線"],nexts: ["伊納","旭川"]},"伊納": {lines: ["函館本線"],nexts: ["納内","近文"]},"納内": {lines: ["函館本線"],nexts: ["深川","伊納"]},"深川": {lines: ["函館本線","留萌本線"],nexts: ["妹背牛","納内","北一已"]},"妹背牛": {lines: ["函館本線"],nexts: ["江部乙","深川"]},"江部乙": {lines: ["函館本線"],nexts: ["滝川","妹背牛"]},"滝川": {lines: ["函館本線","根室本線"],nexts: ["砂川","江部乙","東滝川"]},"砂川": {lines: ["函館本線"],nexts: ["豊沼","滝川"]},"豊沼": {lines: ["函館本線"],nexts: ["奈井江","砂川"]},"奈井江": {lines: ["函館本線"],nexts: ["茶志内","豊沼"]},"茶志内": {lines: ["函館本線"],nexts: ["美唄","奈井江"]},"美唄": {lines: ["函館本線"],nexts: ["光珠内","茶志内"]},"光珠内": {lines: ["函館本線"],nexts: ["峰延","美唄"]},"峰延": {lines: ["函館本線"],nexts: ["岩見沢","光珠内"]},"岩見沢": {lines: ["函館本線","室蘭本線"],nexts: ["上幌向","峰延","志文"]},"上幌向": {lines: ["函館本線"],nexts: ["幌向","岩見沢"]},"幌向": {lines: ["函館本線"],nexts: ["豊幌","上幌向"]},"豊幌": {lines: ["函館本線"],nexts: ["江別","幌向"]},"江別": {lines: ["函館本線"],nexts: ["高砂","豊幌"]},"高砂": {lines: ["函館本線"],nexts: ["野幌","江別"]},"野幌": {lines: ["函館本線"],nexts: ["大麻","高砂"]},"大麻": {lines: ["函館本線"],nexts: ["森林公園","野幌"]},"森林公園": {lines: ["函館本線"],nexts: ["厚別","大麻"]},"厚別": {lines: ["函館本線"],nexts: ["白石","森林公園"]},"白石(北)": {lines: ["函館本線","千歳線"],nexts: ["苗穂","厚別","平和"]},"苗穂": {lines: ["函館本線"],nexts: ["札幌","白石"]},"札幌": {lines: ["函館本線"],nexts: ["桑園","苗穂"]},"桑園": {lines: ["函館本線","札沼線"],nexts: ["琴似","札幌","八軒"]},"琴似": {lines: ["函館本線"],nexts: ["発寒中央","桑園"]},"発寒中央": {lines: ["函館本線"],nexts: ["発寒","琴似"]},"発寒": {lines: ["函館本線"],nexts: ["稲積公園","発寒中央"]},"稲積公園": {lines: ["函館本線"],nexts: ["手稲","発寒"]},"手稲": {lines: ["函館本線"],nexts: ["稲穂","稲積公園"]},"稲穂": {lines: ["函館本線"],nexts: ["星置","手稲"]},"星置": {lines: ["函館本線"],nexts: ["ほしみ","稲穂"]},"ほしみ": {lines: ["函館本線"],nexts: ["銭函","星置"]},"銭函": {lines: ["函館本線"],nexts: ["朝里","ほしみ"]},"朝里": {lines: ["函館本線"],nexts: ["小樽築港","銭函"]},"小樽築港": {lines: ["函館本線"],nexts: ["南小樽","朝里"]},"南小樽": {lines: ["函館本線"],nexts: ["小樽","小樽築港"]},"小樽": {lines: ["函館本線"],nexts: ["塩谷","南小樽"]},"塩谷": {lines: ["函館本線"],nexts: ["蘭島","小樽"]},"蘭島": {lines: ["函館本線"],nexts: ["余市","塩谷"]},"余市": {lines: ["函館本線"],nexts: ["仁木","蘭島"]},"仁木": {lines: ["函館本線"],nexts: ["然別","余市"]},"然別": {lines: ["函館本線"],nexts: ["銀山","仁木"]},"銀山": {lines: ["函館本線"],nexts: ["小沢","然別"]},"小沢": {lines: ["函館本線"],nexts: ["倶知安","銀山"]},"倶知安": {lines: ["函館本線"],nexts: ["比羅夫","小沢"]},"比羅夫": {lines: ["函館本線"],nexts: ["ニセコ","倶知安"]},"ニセコ": {lines: ["函館本線"],nexts: ["昆布","比羅夫"]},"昆布": {lines: ["函館本線"],nexts: ["蘭越","ニセコ"]},"蘭越": {lines: ["函館本線"],nexts: ["目名","昆布"]},"目名": {lines: ["函館本線"],nexts: ["熱郛","蘭越"]},"熱郛": {lines: ["函館本線"],nexts: ["黒松内","目名"]},"黒松内": {lines: ["函館本線"],nexts: ["二股","熱郛"]},"二股": {lines: ["函館本線"],nexts: ["長万部","黒松内"]},"長万部": {lines: ["函館本線","室蘭本線"],nexts: ["中ノ沢","二股","静狩"]},"中ノ沢": {lines: ["函館本線"],nexts: ["国縫","長万部"]},"国縫": {lines: ["函館本線"],nexts: ["黒岩","中ノ沢"]},"黒岩": {lines: ["函館本線"],nexts: ["山崎","国縫"]},"山崎(北)": {lines: ["函館本線"],nexts: ["八雲","黒岩"]},"八雲": {lines: ["函館本線"],nexts: ["山越","山崎"]},"山越": {lines: ["函館本線"],nexts: ["野田生","八雲"]},"野田生": {lines: ["函館本線"],nexts: ["落部","山越"]},"落部": {lines: ["函館本線"],nexts: ["石倉","野田生"]},"石倉": {lines: ["函館本線"],nexts: ["本石倉","落部"]},"本石倉": {lines: ["函館本線"],nexts: ["石谷","石倉"]},"石谷": {lines: ["函館本線"],nexts: ["森","本石倉"]},"森": {lines: ["函館本線"],nexts: ["駒ヶ岳","石谷"]},"駒ヶ岳": {lines: ["函館本線"],nexts: ["赤井川","森"]},"赤井川": {lines: ["函館本線"],nexts: ["大沼公園","駒ヶ岳"]},"大沼公園": {lines: ["函館本線"],nexts: ["大沼","赤井川"]},"大沼": {lines: ["函館本線"],nexts: ["仁山","大沼公園","七飯","池田園"]},"仁山": {lines: ["函館本線"],nexts: ["新函館北斗","大沼"]},"新函館北斗": {lines: ["函館本線"],nexts: ["七飯","仁山"]},"七飯": {lines: ["函館本線"],nexts: ["大中山","新函館北斗","大沼"]},"大中山": {lines: ["函館本線"],nexts: ["桔梗","七飯"]},"桔梗": {lines: ["函館本線"],nexts: ["五稜郭","大中山"]},"五稜郭": {lines: ["函館本線"],nexts: ["函館","桔梗"]},"函館": {lines: ["函館本線"],nexts: ["五稜郭"]},"東森": {lines: ["函館本線"],nexts: ["尾白内","森"]},"尾白内": {lines: ["函館本線"],nexts: ["掛澗","東森"]},"掛澗": {lines: ["函館本線"],nexts: ["渡島砂原","尾白内"]},"渡島砂原": {lines: ["函館本線"],nexts: ["渡島沼尻","掛澗"]},"渡島沼尻": {lines: ["函館本線"],nexts: ["鹿部","渡島砂原"]},"鹿部": {lines: ["函館本線"],nexts: ["銚子口","渡島沼尻"]},"銚子口": {lines: ["函館本線"],nexts: ["流山温泉","鹿部"]},"流山温泉": {lines: ["函館本線"],nexts: ["池田園","銚子口"]},"池田園": {lines: ["函館本線"],nexts: ["大沼","流山温泉"]},"志文": {lines: ["室蘭本線"],nexts: ["栗沢","岩見沢"]},"栗沢": {lines: ["室蘭本線"],nexts: ["栗丘","志文"]},"栗丘": {lines: ["室蘭本線"],nexts: ["栗山","栗沢"]},"栗山": {lines: ["室蘭本線"],nexts: ["由仁","栗丘"]},"由仁": {lines: ["室蘭本線"],nexts: ["古山","栗山"]},"古山": {lines: ["室蘭本線"],nexts: ["三川","由仁"]},"三川(北)": {lines: ["室蘭本線"],nexts: ["追分","古山"]},"追分(北)": {lines: ["室蘭本線","石勝線"],nexts: ["安平","三川","南千歳","川端"]},"安平": {lines: ["室蘭本線"],nexts: ["早来","追分"]},"早来": {lines: ["室蘭本線"],nexts: ["遠浅","安平"]},"遠浅": {lines: ["室蘭本線"],nexts: ["沼ノ端","早来"]},"沼ノ端": {lines: ["室蘭本線","千歳線"],nexts: ["苫小牧","遠浅","植苗"]},"苫小牧": {lines: ["室蘭本線","日高本線"],nexts: ["青葉","沼ノ端","勇払"]},"青葉": {lines: ["室蘭本線"],nexts: ["糸井","苫小牧"]},"糸井": {lines: ["室蘭本線"],nexts: ["錦岡","青葉"]},"錦岡": {lines: ["室蘭本線"],nexts: ["社台","糸井"]},"社台": {lines: ["室蘭本線"],nexts: ["白老","錦岡"]},"白老": {lines: ["室蘭本線"],nexts: ["荻野","社台"]},"荻野": {lines: ["室蘭本線"],nexts: ["北吉原","白老"]},"北吉原": {lines: ["室蘭本線"],nexts: ["竹浦","荻野"]},"竹浦": {lines: ["室蘭本線"],nexts: ["虎杖浜","北吉原"]},"虎杖浜": {lines: ["室蘭本線"],nexts: ["登別","竹浦"]},"登別": {lines: ["室蘭本線"],nexts: ["富浦","虎杖浜"]},"富浦(北)": {lines: ["室蘭本線"],nexts: ["幌別","登別"]},"幌別": {lines: ["室蘭本線"],nexts: ["鷲別","富浦"]},"鷲別": {lines: ["室蘭本線"],nexts: ["東室蘭","幌別"]},"東室蘭": {lines: ["室蘭本線"],nexts: ["本輪西","鷲別"]},"本輪西": {lines: ["室蘭本線"],nexts: ["崎守","東室蘭"]},"崎守": {lines: ["室蘭本線"],nexts: ["黄金","本輪西"]},"黄金": {lines: ["室蘭本線"],nexts: ["稀府","崎守"]},"稀府": {lines: ["室蘭本線"],nexts: ["北舟岡","黄金"]},"北舟岡": {lines: ["室蘭本線"],nexts: ["伊達紋別","稀府"]},"伊達紋別": {lines: ["室蘭本線"],nexts: ["長和","北舟岡"]},"長和": {lines: ["室蘭本線"],nexts: ["有珠","伊達紋別"]},"有珠": {lines: ["室蘭本線"],nexts: ["洞爺","長和"]},"洞爺": {lines: ["室蘭本線"],nexts: ["豊浦","有珠"]},"豊浦": {lines: ["室蘭本線"],nexts: ["大岸","洞爺"]},"大岸": {lines: ["室蘭本線"],nexts: ["礼文","豊浦"]},"礼文": {lines: ["室蘭本線"],nexts: ["小幌","大岸"]},"小幌": {lines: ["室蘭本線"],nexts: ["静狩","礼文"]},"静狩": {lines: ["室蘭本線"],nexts: ["長万部","小幌"]},"輪西": {lines: ["室蘭本線"],nexts: ["御崎","東室蘭"]},"御崎": {lines: ["室蘭本線"],nexts: ["母恋","輪西"]},"母恋": {lines: ["室蘭本線"],nexts: ["室蘭","御崎"]},"室蘭": {lines: ["室蘭本線"],nexts: ["母恋"]},"根室": {lines: ["根室本線"],nexts: ["東根室"]},"東根室": {lines: ["根室本線"],nexts: ["西和田","根室"]},"西和田": {lines: ["根室本線"],nexts: ["昆布盛","東根室"]},"昆布盛": {lines: ["根室本線"],nexts: ["落石","西和田"]},"落石": {lines: ["根室本線"],nexts: ["別当賀","昆布盛"]},"別当賀": {lines: ["根室本線"],nexts: ["初田牛","落石"]},"初田牛": {lines: ["根室本線"],nexts: ["厚床","別当賀"]},"厚床": {lines: ["根室本線"],nexts: ["姉別","初田牛"]},"姉別": {lines: ["根室本線"],nexts: ["浜中","厚床"]},"浜中": {lines: ["根室本線"],nexts: ["茶内","姉別"]},"茶内": {lines: ["根室本線"],nexts: ["糸魚沢","浜中"]},"糸魚沢": {lines: ["根室本線"],nexts: ["厚岸","茶内"]},"厚岸": {lines: ["根室本線"],nexts: ["門静","糸魚沢"]},"門静": {lines: ["根室本線"],nexts: ["尾幌","厚岸"]},"尾幌": {lines: ["根室本線"],nexts: ["上尾幌","門静"]},"上尾幌": {lines: ["根室本線"],nexts: ["別保","尾幌"]},"別保": {lines: ["根室本線"],nexts: ["武佐","上尾幌"]},"武佐": {lines: ["根室本線"],nexts: ["東釧路","別保"]},"東釧路": {lines: ["根室本線","釧網本線"],nexts: ["釧路","武佐","遠矢"]},"釧路": {lines: ["根室本線"],nexts: ["新富士","東釧路"]},"新富士": {lines: ["根室本線"],nexts: ["新大楽毛","釧路"]},"新大楽毛": {lines: ["根室本線"],nexts: ["大楽毛","新富士"]},"大楽毛": {lines: ["根室本線"],nexts: ["庶路","新大楽毛"]},"庶路": {lines: ["根室本線"],nexts: ["西庶路","大楽毛"]},"西庶路": {lines: ["根室本線"],nexts: ["白糠","庶路"]},"白糠": {lines: ["根室本線"],nexts: ["音別","西庶路"]},"音別": {lines: ["根室本線"],nexts: ["厚内","白糠"]},"厚内": {lines: ["根室本線"],nexts: ["浦幌","音別"]},"浦幌": {lines: ["根室本線"],nexts: ["新吉野","厚内"]},"新吉野": {lines: ["根室本線"],nexts: ["豊頃","浦幌"]},"豊頃": {lines: ["根室本線"],nexts: ["十弗","新吉野"]},"十弗": {lines: ["根室本線"],nexts: ["池田","豊頃"]},"池田": {lines: ["根室本線"],nexts: ["利別","十弗"]},"利別": {lines: ["根室本線"],nexts: ["幕別","池田"]},"幕別": {lines: ["根室本線"],nexts: ["札内","利別"]},"札内": {lines: ["根室本線"],nexts: ["帯広","幕別"]},"帯広": {lines: ["根室本線"],nexts: ["柏林台","札内"]},"柏林台": {lines: ["根室本線"],nexts: ["西帯広","帯広"]},"西帯広": {lines: ["根室本線"],nexts: ["大成","柏林台"]},"大成": {lines: ["根室本線"],nexts: ["芽室","西帯広"]},"芽室": {lines: ["根室本線"],nexts: ["御影","大成"]},"御影": {lines: ["根室本線"],nexts: ["十勝清水","芽室"]},"十勝清水": {lines: ["根室本線"],nexts: ["新得","御影"]},"新得": {lines: ["根室本線","石勝線"],nexts: ["落合","十勝清水","トマム"]},"落合": {lines: ["根室本線"],nexts: ["幾寅","新得"]},"幾寅": {lines: ["根室本線"],nexts: ["東鹿越","落合"]},"東鹿越": {lines: ["根室本線"],nexts: ["金山","幾寅"]},"金山(北)": {lines: ["根室本線"],nexts: ["下金山","東鹿越"]},"下金山": {lines: ["根室本線"],nexts: ["山部","金山"]},"山部": {lines: ["根室本線"],nexts: ["布部","下金山"]},"布部": {lines: ["根室本線"],nexts: ["富良野","山部"]},"富良野": {lines: ["根室本線","富良野線"],nexts: ["野花南","布部","学田"]},"野花南": {lines: ["根室本線"],nexts: ["上芦別","富良野"]},"上芦別": {lines: ["根室本線"],nexts: ["芦別","野花南"]},"芦別": {lines: ["根室本線"],nexts: ["平岸","上芦別"]},"平岸": {lines: ["根室本線"],nexts: ["茂尻","芦別"]},"茂尻": {lines: ["根室本線"],nexts: ["赤平","平岸"]},"赤平": {lines: ["根室本線"],nexts: ["東滝川","茂尻"]},"東滝川": {lines: ["根室本線"],nexts: ["滝川","赤平"]},"植苗": {lines: ["千歳線"],nexts: ["南千歳","沼ノ端"]},"南千歳": {lines: ["千歳線","石勝線"],nexts: ["千歳","植苗","新千歳空港","追分"]},"千歳(北)": {lines: ["千歳線"],nexts: ["長都","南千歳"]},"長都": {lines: ["千歳線"],nexts: ["サッポロビール庭園","千歳"]},"サッポロビール庭園": {lines: ["千歳線"],nexts: ["恵庭","長都"]},"恵庭": {lines: ["千歳線"],nexts: ["恵み野","サッポロビール庭園"]},"恵み野": {lines: ["千歳線"],nexts: ["島松","恵庭"]},"島松": {lines: ["千歳線"],nexts: ["北広島","恵み野"]},"北広島": {lines: ["千歳線"],nexts: ["上野幌","島松"]},"上野幌": {lines: ["千歳線"],nexts: ["新札幌","北広島"]},"新札幌": {lines: ["千歳線"],nexts: ["平和","上野幌"]},"平和": {lines: ["千歳線"],nexts: ["白石","新札幌"]},"トマム": {lines: ["石勝線"],nexts: ["占冠","新得"]},"占冠": {lines: ["石勝線"],nexts: ["新夕張","トマム"]},"新夕張": {lines: ["石勝線"],nexts: ["滝ノ上","占冠"]},"滝ノ上": {lines: ["石勝線"],nexts: ["川端","新夕張"]},"川端": {lines: ["石勝線"],nexts: ["追分","滝ノ上"]},"新千歳空港": {lines: ["石勝線"],nexts: ["南千歳"]},"学田": {lines: ["富良野線"],nexts: ["鹿討","富良野"]},"鹿討": {lines: ["富良野線"],nexts: ["中富良野","学田"]},"中富良野": {lines: ["富良野線"],nexts: ["ラベンダー畑","鹿討"]},"ラベンダー畑": {lines: ["富良野線"],nexts: ["西中","中富良野"]},"西中": {lines: ["富良野線"],nexts: ["上富良野","ラベンダー畑"]},"上富良野": {lines: ["富良野線"],nexts: ["美馬牛","西中"]},"美馬牛": {lines: ["富良野線"],nexts: ["美瑛","上富良野"]},"美瑛": {lines: ["富良野線"],nexts: ["北美瑛","美馬牛"]},"北美瑛": {lines: ["富良野線"],nexts: ["千代ヶ丘","美瑛"]},"千代ヶ丘": {lines: ["富良野線"],nexts: ["西聖和","北美瑛"]},"西聖和": {lines: ["富良野線"],nexts: ["西神楽","千代ヶ丘"]},"西神楽": {lines: ["富良野線"],nexts: ["西瑞穂","西聖和"]},"西瑞穂": {lines: ["富良野線"],nexts: ["西御料","西神楽"]},"西御料": {lines: ["富良野線"],nexts: ["緑が丘","西瑞穂"]},"緑が丘": {lines: ["富良野線"],nexts: ["神楽岡","西御料"]},"神楽岡": {lines: ["富良野線"],nexts: ["旭川","緑が丘"]},"遠矢": {lines: ["釧網本線"],nexts: ["釧路湿原","東釧路"]},"釧路湿原": {lines: ["釧網本線"],nexts: ["細岡","遠矢"]},"細岡": {lines: ["釧網本線"],nexts: ["塘路","釧路湿原"]},"塘路": {lines: ["釧網本線"],nexts: ["茅沼","細岡"]},"茅沼": {lines: ["釧網本線"],nexts: ["標茶","塘路"]},"標茶": {lines: ["釧網本線"],nexts: ["磯分内","茅沼"]},"磯分内": {lines: ["釧網本線"],nexts: ["摩周","標茶"]},"摩周": {lines: ["釧網本線"],nexts: ["美留和","磯分内"]},"美留和": {lines: ["釧網本線"],nexts: ["川湯温泉","摩周"]},"川湯温泉": {lines: ["釧網本線"],nexts: ["緑","美留和"]},"緑": {lines: ["釧網本線"],nexts: ["札弦","川湯温泉"]},"札弦": {lines: ["釧網本線"],nexts: ["清里町","緑"]},"清里町": {lines: ["釧網本線"],nexts: ["南斜里","札弦"]},"南斜里": {lines: ["釧網本線"],nexts: ["中斜里","清里町"]},"中斜里": {lines: ["釧網本線"],nexts: ["知床斜里","南斜里"]},"知床斜里": {lines: ["釧網本線"],nexts: ["止別","中斜里"]},"止別": {lines: ["釧網本線"],nexts: ["浜小清水","知床斜里"]},"浜小清水": {lines: ["釧網本線"],nexts: ["原生花園","止別"]},"原生花園": {lines: ["釧網本線"],nexts: ["北浜","浜小清水"]},"北浜": {lines: ["釧網本線"],nexts: ["藻琴","原生花園"]},"藻琴": {lines: ["釧網本線"],nexts: ["鱒浦","北浜"]},"鱒浦": {lines: ["釧網本線"],nexts: ["桂台","藻琴"]},"桂台": {lines: ["釧網本線"],nexts: ["網走","鱒浦"]},"網走": {lines: ["釧網本線","石北本線"],nexts: ["呼人","桂台"]},"呼人": {lines: ["石北本線"],nexts: ["女満別","網走"]},"女満別": {lines: ["石北本線"],nexts: ["西女満別","呼人"]},"西女満別": {lines: ["石北本線"],nexts: ["美幌","女満別"]},"美幌": {lines: ["石北本線"],nexts: ["緋牛内","西女満別"]},"緋牛内": {lines: ["石北本線"],nexts: ["端野","美幌"]},"端野": {lines: ["石北本線"],nexts: ["愛し野","緋牛内"]},"愛し野": {lines: ["石北本線"],nexts: ["柏陽","端野"]},"柏陽": {lines: ["石北本線"],nexts: ["北見","愛し野"]},"北見": {lines: ["石北本線"],nexts: ["西北見","柏陽"]},"西北見": {lines: ["石北本線"],nexts: ["東相内","北見"]},"東相内": {lines: ["石北本線"],nexts: ["相内","西北見"]},"相内": {lines: ["石北本線"],nexts: ["留辺蘂","東相内"]},"留辺蘂": {lines: ["石北本線"],nexts: ["西留辺蘂","相内"]},"西留辺蘂": {lines: ["石北本線"],nexts: ["生田原","留辺蘂"]},"生田原": {lines: ["石北本線"],nexts: ["生野","西留辺蘂"]},"生野(北)": {lines: ["石北本線"],nexts: ["安国","生田原"]},"安国": {lines: ["石北本線"],nexts: ["遠軽","生野"]},"遠軽": {lines: ["石北本線"],nexts: ["瀬戸瀬","安国"]},"瀬戸瀬": {lines: ["石北本線"],nexts: ["丸瀬布","遠軽"]},"丸瀬布": {lines: ["石北本線"],nexts: ["白滝","瀬戸瀬"]},"白滝": {lines: ["石北本線"],nexts: ["上川","丸瀬布"]},"上川": {lines: ["石北本線"],nexts: ["東雲","白滝"]},"東雲": {lines: ["石北本線"],nexts: ["安足間","上川"]},"安足間": {lines: ["石北本線"],nexts: ["愛山","東雲"]},"愛山": {lines: ["石北本線"],nexts: ["中愛別","安足間"]},"中愛別": {lines: ["石北本線"],nexts: ["愛別","愛山"]},"愛別": {lines: ["石北本線"],nexts: ["伊香牛","中愛別"]},"伊香牛": {lines: ["石北本線"],nexts: ["将軍山","愛別"]},"将軍山": {lines: ["石北本線"],nexts: ["当麻","伊香牛"]},"当麻": {lines: ["石北本線"],nexts: ["桜岡","将軍山"]},"桜岡": {lines: ["石北本線"],nexts: ["北日ノ出","当麻"]},"北日ノ出": {lines: ["石北本線"],nexts: ["東旭川","桜岡"]},"東旭川": {lines: ["石北本線"],nexts: ["南永山","北日ノ出"]},"南永山": {lines: ["石北本線"],nexts: ["新旭川","東旭川"]},"留萌": {lines: ["留萌本線"],nexts: ["大和田"]},"大和田": {lines: ["留萌本線"],nexts: ["藤山","留萌"]},"藤山": {lines: ["留萌本線"],nexts: ["幌糠","大和田"]},"幌糠": {lines: ["留萌本線"],nexts: ["峠下","藤山"]},"峠下": {lines: ["留萌本線"],nexts: ["恵比島","幌糠"]},"恵比島": {lines: ["留萌本線"],nexts: ["真布","峠下"]},"真布": {lines: ["留萌本線"],nexts: ["石狩沼田","恵比島"]},"石狩沼田": {lines: ["留萌本線"],nexts: ["北秩父別","真布"]},"北秩父別": {lines: ["留萌本線"],nexts: ["秩父別","石狩沼田"]},"秩父別": {lines: ["留萌本線"],nexts: ["北一已","北秩父別"]},"北一已": {lines: ["留萌本線"],nexts: ["深川","秩父別"]},"北海道医療大学": {lines: ["札沼線"],nexts: ["石狩当別"]},"石狩当別": {lines: ["札沼線"],nexts: ["石狩太美","北海道医療大学"]},"石狩太美": {lines: ["札沼線"],nexts: ["あいの里公園","石狩当別"]},"あいの里公園": {lines: ["札沼線"],nexts: ["あいの里教育大","石狩太美"]},"あいの里教育大": {lines: ["札沼線"],nexts: ["拓北","あいの里公園"]},"拓北": {lines: ["札沼線"],nexts: ["篠路","あいの里教育大"]},"篠路": {lines: ["札沼線"],nexts: ["百合が原","拓北"]},"百合が原": {lines: ["札沼線"],nexts: ["太平","篠路"]},"太平": {lines: ["札沼線"],nexts: ["新琴似","百合が原"]},"新琴似": {lines: ["札沼線"],nexts: ["新川","太平"]},"新川": {lines: ["札沼線"],nexts: ["八軒","新琴似"]},"八軒": {lines: ["札沼線"],nexts: ["桑園","新川"]},"様似": {lines: ["日高本線"],nexts: ["西様似"]},"西様似": {lines: ["日高本線"],nexts: ["鵜苫","様似"]},"鵜苫": {lines: ["日高本線"],nexts: ["日高幌別","西様似"]},"日高幌別": {lines: ["日高本線"],nexts: ["東町","鵜苫"]},"東町": {lines: ["日高本線"],nexts: ["浦河","日高幌別"]},"浦河": {lines: ["日高本線"],nexts: ["絵笛","東町"]},"絵笛": {lines: ["日高本線"],nexts: ["荻伏","浦河"]},"荻伏": {lines: ["日高本線"],nexts: ["本桐","絵笛"]},"本桐": {lines: ["日高本線"],nexts: ["蓬栄","荻伏"]},"蓬栄": {lines: ["日高本線"],nexts: ["日高三石","本桐"]},"日高三石": {lines: ["日高本線"],nexts: ["日高東別","蓬栄"]},"日高東別": {lines: ["日高本線"],nexts: ["春立","日高三石"]},"春立": {lines: ["日高本線"],nexts: ["東静内","日高東別"]},"東静内": {lines: ["日高本線"],nexts: ["静内","春立"]},"静内": {lines: ["日高本線"],nexts: ["新冠","東静内"]},"新冠": {lines: ["日高本線"],nexts: ["節婦","静内"]},"節婦": {lines: ["日高本線"],nexts: ["大狩部","新冠"]},"大狩部": {lines: ["日高本線"],nexts: ["厚賀","節婦"]},"厚賀": {lines: ["日高本線"],nexts: ["清畠","大狩部"]},"清畠": {lines: ["日高本線"],nexts: ["豊郷","厚賀"]},"豊郷": {lines: ["日高本線"],nexts: ["日高門別","清畠"]},"日高門別": {lines: ["日高本線"],nexts: ["富川","豊郷"]},"富川": {lines: ["日高本線"],nexts: ["汐見","日高門別"]},"汐見": {lines: ["日高本線"],nexts: ["鵡川","富川"]},"鵡川": {lines: ["日高本線"],nexts: ["浜田浦","汐見"]},"浜田浦": {lines: ["日高本線"],nexts: ["浜厚真","鵡川"]},"浜厚真": {lines: ["日高本線"],nexts: ["勇払","浜田浦"]},"勇払": {lines: ["日高本線"],nexts: ["苫小牧","浜厚真"]},"青森": {lines: ["奥羽本線","津軽線"],nexts: ["新青森","油川"]},"新青森": {lines: ["奥羽本線"],nexts: ["津軽新城","青森"]},"津軽新城": {lines: ["奥羽本線"],nexts: ["鶴ヶ坂","新青森"]},"鶴ヶ坂": {lines: ["奥羽本線"],nexts: ["大釈迦","津軽新城"]},"大釈迦": {lines: ["奥羽本線"],nexts: ["浪岡","鶴ヶ坂"]},"浪岡": {lines: ["奥羽本線"],nexts: ["北常盤","大釈迦"]},"北常盤": {lines: ["奥羽本線"],nexts: ["川部","浪岡"]},"川部": {lines: ["奥羽本線","五能線"],nexts: ["撫牛子","北常盤","藤崎"]},"撫牛子": {lines: ["奥羽本線"],nexts: ["弘前","川部"]},"弘前": {lines: ["奥羽本線"],nexts: ["石川","撫牛子"]},"石川": {lines: ["奥羽本線"],nexts: ["大鰐温泉","弘前"]},"大鰐温泉": {lines: ["奥羽本線"],nexts: ["長峰","石川"]},"長峰": {lines: ["奥羽本線"],nexts: ["碇ヶ関","大鰐温泉"]},"碇ヶ関": {lines: ["奥羽本線"],nexts: ["津軽湯の沢","長峰"]},"津軽湯の沢": {lines: ["奥羽本線"],nexts: ["陣馬","碇ヶ関"]},"陣馬": {lines: ["奥羽本線"],nexts: ["白沢","津軽湯の沢"]},"白沢": {lines: ["奥羽本線"],nexts: ["大館","陣馬"]},"大館": {lines: ["奥羽本線","花輪線"],nexts: ["下川沿","白沢"]},"下川沿": {lines: ["奥羽本線"],nexts: ["早口","大館"]},"早口": {lines: ["奥羽本線"],nexts: ["糠沢","下川沿"]},"糠沢": {lines: ["奥羽本線"],nexts: ["鷹ノ巣","早口"]},"鷹ノ巣": {lines: ["奥羽本線"],nexts: ["前山","糠沢"]},"前山": {lines: ["奥羽本線"],nexts: ["二ツ井","鷹ノ巣"]},"二ツ井": {lines: ["奥羽本線"],nexts: ["富根","前山"]},"富根": {lines: ["奥羽本線"],nexts: ["鶴形","二ツ井"]},"鶴形": {lines: ["奥羽本線"],nexts: ["東能代","富根"]},"東能代": {lines: ["奥羽本線","五能線"],nexts: ["北金岡","鶴形","能代"]},"北金岡": {lines: ["奥羽本線"],nexts: ["森岳","東能代"]},"森岳": {lines: ["奥羽本線"],nexts: ["鹿渡","北金岡"]},"鹿渡": {lines: ["奥羽本線"],nexts: ["鯉川","森岳"]},"鯉川": {lines: ["奥羽本線"],nexts: ["八郎潟","鹿渡"]},"八郎潟": {lines: ["奥羽本線"],nexts: ["井川さくら","鯉川"]},"井川さくら": {lines: ["奥羽本線"],nexts: ["羽後飯塚","八郎潟"]},"羽後飯塚": {lines: ["奥羽本線"],nexts: ["大久保","井川さくら"]},"大久保": {lines: ["奥羽本線"],nexts: ["追分","羽後飯塚"]},"追分": {lines: ["奥羽本線","男鹿線"],nexts: ["上飯島","大久保"]},"上飯島": {lines: ["奥羽本線"],nexts: ["土崎","追分"]},"土崎": {lines: ["奥羽本線"],nexts: ["秋田","上飯島"]},"四ツ小屋": {lines: ["奥羽本線"],nexts: ["和田","秋田"]},"和田": {lines: ["奥羽本線"],nexts: ["大張野","四ツ小屋"]},"大張野": {lines: ["奥羽本線"],nexts: ["羽後境","和田"]},"羽後境": {lines: ["奥羽本線"],nexts: ["峰吉川","大張野"]},"峰吉川": {lines: ["奥羽本線"],nexts: ["刈和野","羽後境"]},"刈和野": {lines: ["奥羽本線"],nexts: ["神宮寺","峰吉川"]},"神宮寺": {lines: ["奥羽本線"],nexts: ["大曲","刈和野"]},"大曲": {lines: ["奥羽本線","田沢湖線"],nexts: ["飯詰","神宮寺"]},"飯詰": {lines: ["奥羽本線"],nexts: ["後三年","大曲"]},"後三年": {lines: ["奥羽本線"],nexts: ["横手","飯詰"]},"横手": {lines: ["奥羽本線","北上線"],nexts: ["柳田","後三年"]},"柳田": {lines: ["奥羽本線"],nexts: ["醍醐","横手"]},"醍醐": {lines: ["奥羽本線"],nexts: ["十文字","柳田"]},"十文字": {lines: ["奥羽本線"],nexts: ["下湯沢","醍醐"]},"下湯沢": {lines: ["奥羽本線"],nexts: ["湯沢","十文字"]},"湯沢": {lines: ["奥羽本線"],nexts: ["上湯沢","下湯沢"]},"上湯沢": {lines: ["奥羽本線"],nexts: ["三関","湯沢"]},"三関": {lines: ["奥羽本線"],nexts: ["横堀","上湯沢"]},"横堀": {lines: ["奥羽本線"],nexts: ["院内","三関"]},"院内": {lines: ["奥羽本線"],nexts: ["及位","横堀"]},"及位": {lines: ["奥羽本線"],nexts: ["大滝","院内"]},"大滝": {lines: ["奥羽本線"],nexts: ["釜淵","及位"]},"釜淵": {lines: ["奥羽本線"],nexts: ["真室川","大滝"]},"真室川": {lines: ["奥羽本線"],nexts: ["羽前豊里","釜淵"]},"羽前豊里": {lines: ["奥羽本線"],nexts: ["泉田","真室川"]},"泉田": {lines: ["奥羽本線"],nexts: ["新庄","羽前豊里"]},"新庄": {lines: ["奥羽本線","陸羽西線","陸羽東線"],nexts: ["舟形","泉田"]},"舟形": {lines: ["奥羽本線"],nexts: ["芦沢","新庄"]},"芦沢": {lines: ["奥羽本線"],nexts: ["北大石田","舟形"]},"北大石田": {lines: ["奥羽本線"],nexts: ["大石田","芦沢"]},"大石田": {lines: ["奥羽本線"],nexts: ["袖崎","北大石田"]},"袖崎": {lines: ["奥羽本線"],nexts: ["村山","大石田"]},"村山": {lines: ["奥羽本線"],nexts: ["東根","袖崎"]},"東根": {lines: ["奥羽本線"],nexts: ["さくらんぼ東根","村山"]},"さくらんぼ東根": {lines: ["奥羽本線"],nexts: ["神町","東根"]},"神町": {lines: ["奥羽本線"],nexts: ["乱川","さくらんぼ東根"]},"乱川": {lines: ["奥羽本線"],nexts: ["天童","神町"]},"天童": {lines: ["奥羽本線"],nexts: ["天童南","乱川"]},"天童南": {lines: ["奥羽本線"],nexts: ["高擶","天童"]},"高擶": {lines: ["奥羽本線"],nexts: ["漆山","天童南"]},"漆山": {lines: ["奥羽本線"],nexts: ["南出羽","高擶"]},"南出羽": {lines: ["奥羽本線"],nexts: ["羽前千歳","漆山"]},"羽前千歳": {lines: ["奥羽本線","仙山線"],nexts: ["北山形","南出羽"]},"北山形": {lines: ["奥羽本線","左沢線"],nexts: ["山形","羽前千歳"]},"山形": {lines: ["奥羽本線"],nexts: ["蔵王","北山形"]},"蔵王": {lines: ["奥羽本線"],nexts: ["茂吉記念館前","山形"]},"茂吉記念館前": {lines: ["奥羽本線"],nexts: ["かみのやま温泉","蔵王"]},"かみのやま温泉": {lines: ["奥羽本線"],nexts: ["羽前中山","茂吉記念館前"]},"羽前中山": {lines: ["奥羽本線"],nexts: ["中川","かみのやま温泉"]},"中川": {lines: ["奥羽本線"],nexts: ["赤湯","羽前中山"]},"赤湯": {lines: ["奥羽本線"],nexts: ["高畠","中川"]},"高畠": {lines: ["奥羽本線"],nexts: ["置賜","赤湯"]},"置賜": {lines: ["奥羽本線"],nexts: ["米沢","高畠"]},"米沢": {lines: ["奥羽本線","米坂線"],nexts: ["関根","置賜"]},"関根": {lines: ["奥羽本線"],nexts: ["大沢","米沢"]},"大沢": {lines: ["奥羽本線"],nexts: ["峠","関根"]},"峠": {lines: ["奥羽本線"],nexts: ["板谷","大沢"]},"板谷": {lines: ["奥羽本線"],nexts: ["赤岩","峠"]},"赤岩": {lines: ["奥羽本線"],nexts: ["庭坂","板谷"]},"庭坂": {lines: ["奥羽本線"],nexts: ["笹木野","赤岩"]},"笹木野": {lines: ["奥羽本線","東北本線"],nexts: ["福島","庭坂"]},"盛岡": {lines: ["東北本線","田沢湖線","山田線"],nexts: ["仙北町"]},"仙北町": {lines: ["東北本線"],nexts: ["岩手飯岡","盛岡"]},"岩手飯岡": {lines: ["東北本線"],nexts: ["矢幅","仙北町"]},"矢幅": {lines: ["東北本線"],nexts: ["古舘","岩手飯岡"]},"古舘": {lines: ["東北本線"],nexts: ["紫波中央","矢幅"]},"紫波中央": {lines: ["東北本線"],nexts: ["日詰","古舘"]},"日詰": {lines: ["東北本線"],nexts: ["石鳥谷","紫波中央"]},"石鳥谷": {lines: ["東北本線"],nexts: ["花巻空港","日詰"]},"花巻空港": {lines: ["東北本線"],nexts: ["花巻","石鳥谷"]},"花巻": {lines: ["東北本線","釜石線"],nexts: ["村崎野","花巻空港"]},"村崎野": {lines: ["東北本線"],nexts: ["北上","花巻"]},"北上": {lines: ["東北本線","北上線"],nexts: ["六原","村崎野"]},"六原": {lines: ["東北本線"],nexts: ["金ヶ崎","北上"]},"金ヶ崎": {lines: ["東北本線"],nexts: ["水沢","六原"]},"水沢": {lines: ["東北本線"],nexts: ["陸中折居","金ヶ崎"]},"陸中折居": {lines: ["東北本線"],nexts: ["前沢","水沢"]},"前沢": {lines: ["東北本線"],nexts: ["平泉","陸中折居"]},"平泉": {lines: ["東北本線"],nexts: ["山ノ目","前沢"]},"山ノ目": {lines: ["東北本線"],nexts: ["一ノ関","平泉"]},"一ノ関": {lines: ["東北本線","大船渡線"],nexts: ["有壁","山ノ目"]},"有壁": {lines: ["東北本線"],nexts: ["清水原","一ノ関"]},"清水原": {lines: ["東北本線"],nexts: ["花泉","有壁"]},"花泉": {lines: ["東北本線"],nexts: ["油島","清水原"]},"油島": {lines: ["東北本線"],nexts: ["石越","花泉"]},"石越": {lines: ["東北本線"],nexts: ["新田","油島"]},"新田": {lines: ["東北本線"],nexts: ["梅ヶ沢","石越"]},"梅ヶ沢": {lines: ["東北本線"],nexts: ["瀬峰","新田"]},"瀬峰": {lines: ["東北本線"],nexts: ["田尻","梅ヶ沢"]},"田尻": {lines: ["東北本線"],nexts: ["小牛田","瀬峰"]},"小牛田": {lines: ["東北本線","陸羽東線","石巻線"],nexts: ["松山町","田尻"]},"松山町": {lines: ["東北本線"],nexts: ["鹿島台","小牛田"]},"鹿島台": {lines: ["東北本線"],nexts: ["品井沼","松山町"]},"品井沼": {lines: ["東北本線"],nexts: ["愛宕","鹿島台"]},"愛宕": {lines: ["東北本線"],nexts: ["松島","品井沼"]},"松島": {lines: ["東北本線"],nexts: ["塩釜","愛宕"]},"塩釜": {lines: ["東北本線","仙石東北ライン"],nexts: ["国府多賀城","松島"]},"国府多賀城": {lines: ["東北本線"],nexts: ["陸前山王","塩釜"]},"陸前山王": {lines: ["東北本線"],nexts: ["岩切","国府多賀城"]},"新利府": {lines: ["東北本線"],nexts: ["岩切","利府"]},"利府": {lines: ["東北本線"],nexts: ["新利府"]},"岩切": {lines: ["東北本線"],nexts: ["東仙台","陸前山王"]},"東仙台": {lines: ["東北本線"],nexts: ["仙台","岩切"]},"仙台": {lines: ["東北本線","仙石線","仙山線"],nexts: ["長町","東仙台"]},"長町": {lines: ["東北本線"],nexts: ["太子堂","仙台"]},"太子堂": {lines: ["東北本線"],nexts: ["南仙台","長町"]},"南仙台": {lines: ["東北本線"],nexts: ["名取","太子堂"]},"名取": {lines: ["東北本線"],nexts: ["館腰","南仙台"]},"館腰": {lines: ["東北本線"],nexts: ["岩沼","名取"]},"岩沼": {lines: ["東北本線","常磐線"],nexts: ["槻木","館腰","逢隈"]},"槻木": {lines: ["東北本線"],nexts: ["船岡","岩沼"]},"船岡": {lines: ["東北本線"],nexts: ["大河原","槻木"]},"大河原": {lines: ["東北本線"],nexts: ["北白川","船岡"]},"北白川": {lines: ["東北本線"],nexts: ["東白石","大河原"]},"東白石": {lines: ["東北本線"],nexts: ["白石","北白川"]},"白石": {lines: ["東北本線"],nexts: ["越河","東白石"]},"越河": {lines: ["東北本線"],nexts: ["貝田","白石"]},"貝田": {lines: ["東北本線"],nexts: ["藤田","越河"]},"藤田": {lines: ["東北本線"],nexts: ["桑折","貝田"]},"桑折": {lines: ["東北本線"],nexts: ["伊達","藤田"]},"伊達": {lines: ["東北本線"],nexts: ["東福島","桑折"]},"東福島": {lines: ["東北本線"],nexts: ["福島","伊達"]},"福島": {lines: ["東北本線","奥羽本線"],nexts: ["南福島","東福島","笹木野"]},"南福島": {lines: ["東北本線"],nexts: ["金谷川","福島"]},"金谷川": {lines: ["東北本線"],nexts: ["松川","南福島"]},"松川": {lines: ["東北本線"],nexts: ["安達","金谷川"]},"安達": {lines: ["東北本線"],nexts: ["二本松","松川"]},"二本松": {lines: ["東北本線"],nexts: ["杉田","安達"]},"杉田": {lines: ["東北本線"],nexts: ["本宮","二本松"]},"本宮": {lines: ["東北本線"],nexts: ["五百川","杉田"]},"五百川": {lines: ["東北本線"],nexts: ["日和田","本宮"]},"日和田": {lines: ["東北本線"],nexts: ["郡山","五百川"]},"郡山": {lines: ["東北本線","磐越西線","磐越東線"],nexts: ["安積永盛","日和田"]},"安積永盛": {lines: ["東北本線","水郡線"],nexts: ["須賀川","郡山"]},"須賀川": {lines: ["東北本線"],nexts: ["鏡石","安積永盛"]},"鏡石": {lines: ["東北本線"],nexts: ["矢吹","須賀川"]},"矢吹": {lines: ["東北本線"],nexts: ["泉崎","鏡石"]},"泉崎": {lines: ["東北本線"],nexts: ["久田野","矢吹"]},"久田野": {lines: ["東北本線"],nexts: ["白河","泉崎"]},"白河": {lines: ["東北本線"],nexts: ["新白河","久田野"]},"新白河": {lines: ["東北本線"],nexts: ["白坂","白河"]},"白坂": {lines: ["東北本線"],nexts: ["豊原","新白河"]},"豊原": {lines: ["東北本線"],nexts: ["黒田原","白坂"]},"黒田原": {lines: ["東北本線"],nexts: ["高久","豊原"]},"高久": {lines: ["東北本線"],nexts: ["黒磯","黒田原"]},"黒磯": {lines: ["東北本線"],nexts: ["那須塩原","高久"]},"那須塩原": {lines: ["東北本線"],nexts: ["西那須野","黒磯"]},"西那須野": {lines: ["東北本線"],nexts: ["野崎","那須塩原"]},"野崎": {lines: ["東北本線"],nexts: ["矢板","西那須野"]},"矢板": {lines: ["東北本線"],nexts: ["片岡","野崎"]},"片岡": {lines: ["東北本線"],nexts: ["蒲須坂","矢板"]},"蒲須坂": {lines: ["東北本線"],nexts: ["氏家","片岡"]},"氏家": {lines: ["東北本線"],nexts: ["宝積寺","蒲須坂"]},"宝積寺": {lines: ["東北本線","烏山線"],nexts: ["岡本","氏家"]},"岡本": {lines: ["東北本線"],nexts: ["宇都宮","宝積寺"]},"宇都宮": {lines: ["東北本線","日光線"],nexts: ["雀宮","岡本"]},"雀宮": {lines: ["東北本線"],nexts: ["石橋","宇都宮"]},"石橋": {lines: ["東北本線"],nexts: ["自治医大","雀宮"]},"自治医大": {lines: ["東北本線"],nexts: ["小金井","石橋"]},"小金井": {lines: ["東北本線"],nexts: ["小山","自治医大"]},"小山": {lines: ["東北本線","両毛線","水戸線"],nexts: ["間々田","小金井"]},"間々田": {lines: ["東北本線"],nexts: ["野木","小山"]},"野木": {lines: ["東北本線"],nexts: ["古河","間々田"]},"古河": {lines: ["東北本線"],nexts: ["栗橋","野木"]},"栗橋": {lines: ["東北本線"],nexts: ["東鷲宮","古河"]},"東鷲宮": {lines: ["東北本線"],nexts: ["久喜","栗橋"]},"久喜": {lines: ["東北本線"],nexts: ["新白岡","東鷲宮"]},"新白岡": {lines: ["東北本線"],nexts: ["白岡","久喜"]},"白岡": {lines: ["東北本線"],nexts: ["蓮田","新白岡"]},"蓮田": {lines: ["東北本線"],nexts: ["東大宮","白岡"]},"東大宮": {lines: ["東北本線"],nexts: ["土呂","蓮田"]},"土呂": {lines: ["東北本線"],nexts: ["大宮","東大宮"]},"大宮": {lines: ["東北本線","高崎線","埼京線","川越線"],nexts: ["さいたま新都心","土呂"]},"さいたま新都心": {lines: ["東北本線"],nexts: ["与野","大宮"]},"与野": {lines: ["東北本線"],nexts: ["北浦和","さいたま新都心"]},"北浦和": {lines: ["東北本線"],nexts: ["浦和","与野"]},"浦和": {lines: ["東北本線"],nexts: ["南浦和","北浦和"]},"南浦和": {lines: ["東北本線","武蔵野線"],nexts: ["蕨","浦和"]},"蕨": {lines: ["東北本線"],nexts: ["西川口","南浦和"]},"西川口": {lines: ["東北本線"],nexts: ["川口","蕨"]},"川口": {lines: ["東北本線"],nexts: ["赤羽","西川口"]},"赤羽": {lines: ["東北本線","埼京線"],nexts: ["東十条","川口","赤羽"]},"東十条": {lines: ["東北本線"],nexts: ["王子","赤羽"]},"王子": {lines: ["東北本線"],nexts: ["上中里","東十条"]},"上中里": {lines: ["東北本線"],nexts: ["田端","王子"]},"田端": {lines: ["東北本線","山手線"],nexts: ["西日暮里","上中里"]},"西日暮里": {lines: ["東北本線","山手線"],nexts: ["日暮里","田端"]},"日暮里": {lines: ["東北本線","常磐線"],nexts: ["鶯谷","西日暮里","三河島"]},"鶯谷": {lines: ["東北本線","山手線"],nexts: ["上野","日暮里"]},"上野": {lines: ["東北本線","山手線"],nexts: ["御徒町","鶯谷","尾久"]},"御徒町": {lines: ["東北本線","山手線"],nexts: ["秋葉原","上野"]},"秋葉原": {lines: ["総武本線"],nexts: ["御茶ノ水","浅草橋"]},"神田": {lines: ["東北本線","中央本線","山手線"],nexts: ["東京","秋葉原","御茶ノ水"]},"尾久": {lines: ["東北本線"],nexts: ["上野","赤羽"]},"秋田": {lines: ["羽越本線","奥羽本線"],nexts: ["羽後牛島","四ツ小屋","土崎"]},"羽後牛島": {lines: ["羽越本線"],nexts: ["新屋","秋田"]},"新屋": {lines: ["羽越本線"],nexts: ["桂根","羽後牛島"]},"桂根": {lines: ["羽越本線"],nexts: ["下浜","新屋"]},"下浜": {lines: ["羽越本線"],nexts: ["道川","桂根"]},"道川": {lines: ["羽越本線"],nexts: ["岩城みなと","下浜"]},"岩城みなと": {lines: ["羽越本線"],nexts: ["羽後亀田","道川"]},"羽後亀田": {lines: ["羽越本線"],nexts: ["折渡","岩城みなと"]},"折渡": {lines: ["羽越本線"],nexts: ["羽後岩谷","羽後亀田"]},"羽後岩谷": {lines: ["羽越本線"],nexts: ["羽後本荘","折渡"]},"羽後本荘": {lines: ["羽越本線"],nexts: ["西目","羽後岩谷"]},"西目": {lines: ["羽越本線"],nexts: ["仁賀保","羽後本荘"]},"仁賀保": {lines: ["羽越本線"],nexts: ["金浦","西目"]},"金浦": {lines: ["羽越本線"],nexts: ["象潟","仁賀保"]},"象潟": {lines: ["羽越本線"],nexts: ["上浜","金浦"]},"上浜": {lines: ["羽越本線"],nexts: ["小砂川","象潟"]},"小砂川": {lines: ["羽越本線"],nexts: ["女鹿","上浜"]},"女鹿": {lines: ["羽越本線"],nexts: ["吹浦","小砂川"]},"吹浦": {lines: ["羽越本線"],nexts: ["遊佐","女鹿"]},"遊佐": {lines: ["羽越本線"],nexts: ["南鳥海","吹浦"]},"南鳥海": {lines: ["羽越本線"],nexts: ["本楯","遊佐"]},"本楯": {lines: ["羽越本線"],nexts: ["酒田","南鳥海"]},"酒田": {lines: ["羽越本線"],nexts: ["東酒田","本楯"]},"東酒田": {lines: ["羽越本線"],nexts: ["砂越","酒田"]},"砂越": {lines: ["羽越本線"],nexts: ["北余目","東酒田"]},"北余目": {lines: ["羽越本線"],nexts: ["余目","砂越"]},"余目": {lines: ["羽越本線","陸羽西線"],nexts: ["西袋","北余目"]},"西袋": {lines: ["羽越本線"],nexts: ["藤島","余目"]},"藤島": {lines: ["羽越本線"],nexts: ["鶴岡","西袋"]},"鶴岡": {lines: ["羽越本線"],nexts: ["羽前大山","藤島"]},"羽前大山": {lines: ["羽越本線"],nexts: ["羽前水沢","鶴岡"]},"羽前水沢": {lines: ["羽越本線"],nexts: ["三瀬","羽前大山"]},"三瀬": {lines: ["羽越本線"],nexts: ["小波渡","羽前水沢"]},"小波渡": {lines: ["羽越本線"],nexts: ["五十川","三瀬"]},"五十川": {lines: ["羽越本線"],nexts: ["あつみ温泉","小波渡"]},"あつみ温泉": {lines: ["羽越本線"],nexts: ["小岩川","五十川"]},"小岩川": {lines: ["羽越本線"],nexts: ["鼠ヶ関","あつみ温泉"]},"鼠ヶ関": {lines: ["羽越本線"],nexts: ["府屋","小岩川"]},"府屋": {lines: ["羽越本線"],nexts: ["勝木","鼠ヶ関"]},"勝木": {lines: ["羽越本線"],nexts: ["越後寒川","府屋"]},"越後寒川": {lines: ["羽越本線"],nexts: ["今川","勝木"]},"今川": {lines: ["羽越本線"],nexts: ["桑川","越後寒川"]},"桑川": {lines: ["羽越本線"],nexts: ["越後早川","今川"]},"越後早川": {lines: ["羽越本線"],nexts: ["間島","桑川"]},"間島": {lines: ["羽越本線"],nexts: ["村上","越後早川"]},"村上": {lines: ["羽越本線"],nexts: ["岩船町","間島"]},"岩船町": {lines: ["羽越本線"],nexts: ["平林","村上"]},"平林": {lines: ["羽越本線"],nexts: ["坂町","岩船町"]},"坂町": {lines: ["羽越本線","米坂線"],nexts: ["平木田","平林"]},"平木田": {lines: ["羽越本線"],nexts: ["中条","坂町"]},"中条": {lines: ["羽越本線"],nexts: ["金塚","平木田"]},"金塚": {lines: ["羽越本線"],nexts: ["加治","中条"]},"加治": {lines: ["羽越本線"],nexts: ["新発田","金塚"]},"新発田": {lines: ["羽越本線","白新線"],nexts: ["中浦","加治"]},"中浦": {lines: ["羽越本線"],nexts: ["月岡","新発田"]},"月岡": {lines: ["羽越本線"],nexts: ["神山","中浦"]},"神山": {lines: ["羽越本線"],nexts: ["水原","月岡"]},"水原": {lines: ["羽越本線"],nexts: ["京ヶ瀬","神山"]},"京ヶ瀬": {lines: ["羽越本線"],nexts: ["新津","水原"]},"新津": {lines: ["羽越本線","信越本線","磐越西線"],nexts: ["京ヶ瀬"]},"三厩": {lines: ["津軽線"],nexts: ["津軽浜名"]},"津軽浜名": {lines: ["津軽線"],nexts: ["今別","三厩"]},"今別": {lines: ["津軽線"],nexts: ["大川平","津軽浜名"]},"大川平": {lines: ["津軽線"],nexts: ["津軽二股","今別"]},"津軽二股": {lines: ["津軽線"],nexts: ["大平","大川平"]},"大平": {lines: ["津軽線"],nexts: ["中小国","津軽二股"]},"中小国": {lines: ["津軽線"],nexts: ["蟹田","大平"]},"蟹田": {lines: ["津軽線"],nexts: ["瀬辺地","中小国"]},"瀬辺地": {lines: ["津軽線"],nexts: ["郷沢","蟹田"]},"郷沢": {lines: ["津軽線"],nexts: ["蓬田","瀬辺地"]},"蓬田": {lines: ["津軽線"],nexts: ["中沢","郷沢"]},"中沢": {lines: ["津軽線"],nexts: ["後潟","蓬田"]},"後潟": {lines: ["津軽線"],nexts: ["左堰","中沢"]},"左堰": {lines: ["津軽線"],nexts: ["奥内","後潟"]},"奥内": {lines: ["津軽線"],nexts: ["津軽宮田","左堰"]},"津軽宮田": {lines: ["津軽線"],nexts: ["油川","奥内"]},"油川": {lines: ["津軽線"],nexts: ["青森","津軽宮田"]},"大湊": {lines: ["大湊線"],nexts: ["下北"]},"下北": {lines: ["大湊線"],nexts: ["赤川","大湊"]},"赤川": {lines: ["大湊線"],nexts: ["金谷沢","下北"]},"金谷沢": {lines: ["大湊線"],nexts: ["近川","赤川"]},"近川": {lines: ["大湊線"],nexts: ["有畑","金谷沢"]},"有畑": {lines: ["大湊線"],nexts: ["陸奥横浜","近川"]},"陸奥横浜": {lines: ["大湊線"],nexts: ["吹越","有畑"]},"吹越": {lines: ["大湊線"],nexts: ["有戸","陸奥横浜"]},"有戸": {lines: ["大湊線"],nexts: ["北野辺地","吹越"]},"北野辺地": {lines: ["大湊線"],nexts: ["野辺地","有戸"]},"野辺地": {lines: ["大湊線"],nexts: ["北野辺地"]},"藤崎": {lines: ["五能線"],nexts: ["林崎","川部"]},"林崎": {lines: ["五能線"],nexts: ["板柳","藤崎"]},"板柳": {lines: ["五能線"],nexts: ["鶴泊","林崎"]},"鶴泊": {lines: ["五能線"],nexts: ["陸奥鶴田","板柳"]},"陸奥鶴田": {lines: ["五能線"],nexts: ["五所川原","鶴泊"]},"五所川原": {lines: ["五能線"],nexts: ["木造","陸奥鶴田"]},"木造": {lines: ["五能線"],nexts: ["中田","五所川原"]},"中田": {lines: ["五能線"],nexts: ["陸奥森田","木造"]},"陸奥森田": {lines: ["五能線"],nexts: ["越水","中田"]},"越水": {lines: ["五能線"],nexts: ["鳴沢","陸奥森田"]},"鳴沢": {lines: ["五能線"],nexts: ["鰺ヶ沢","越水"]},"鰺ヶ沢": {lines: ["五能線"],nexts: ["陸奥赤石","鳴沢"]},"陸奥赤石": {lines: ["五能線"],nexts: ["陸奥柳田","鰺ヶ沢"]},"陸奥柳田": {lines: ["五能線"],nexts: ["北金ヶ沢","陸奥赤石"]},"北金ヶ沢": {lines: ["五能線"],nexts: ["千畳敷","陸奥柳田"]},"千畳敷": {lines: ["五能線"],nexts: ["大戸瀬","北金ヶ沢"]},"大戸瀬": {lines: ["五能線"],nexts: ["風合瀬","千畳敷"]},"風合瀬": {lines: ["五能線"],nexts: ["驫木","大戸瀬"]},"驫木": {lines: ["五能線"],nexts: ["追良瀬","風合瀬"]},"追良瀬": {lines: ["五能線"],nexts: ["広戸","驫木"]},"広戸": {lines: ["五能線"],nexts: ["深浦","追良瀬"]},"深浦": {lines: ["五能線"],nexts: ["横磯","広戸"]},"横磯": {lines: ["五能線"],nexts: ["艫作","深浦"]},"艫作": {lines: ["五能線"],nexts: ["ウェスパ椿山","横磯"]},"ウェスパ椿山": {lines: ["五能線"],nexts: ["陸奥沢辺","艫作"]},"陸奥沢辺": {lines: ["五能線"],nexts: ["陸奥岩崎","ウェスパ椿山"]},"陸奥岩崎": {lines: ["五能線"],nexts: ["十二湖","陸奥沢辺"]},"十二湖": {lines: ["五能線"],nexts: ["松神","陸奥岩崎"]},"松神": {lines: ["五能線"],nexts: ["白神岳登山口","十二湖"]},"白神岳登山口": {lines: ["五能線"],nexts: ["大間越","松神"]},"大間越": {lines: ["五能線"],nexts: ["岩舘","白神岳登山口"]},"岩舘": {lines: ["五能線"],nexts: ["あきた白神","大間越"]},"あきた白神": {lines: ["五能線"],nexts: ["滝ノ間","岩舘"]},"滝ノ間": {lines: ["五能線"],nexts: ["八森","あきた白神"]},"八森": {lines: ["五能線"],nexts: ["東八森","滝ノ間"]},"東八森": {lines: ["五能線"],nexts: ["沢目","八森"]},"沢目": {lines: ["五能線"],nexts: ["鳥形","東八森"]},"鳥形": {lines: ["五能線"],nexts: ["北能代","沢目"]},"北能代": {lines: ["五能線"],nexts: ["向能代","鳥形"]},"向能代": {lines: ["五能線"],nexts: ["能代","北能代"]},"能代": {lines: ["五能線"],nexts: ["東能代","向能代"]},"八戸": {lines: ["八戸線"],nexts: ["長苗代"]},"長苗代": {lines: ["八戸線"],nexts: ["本八戸","八戸"]},"本八戸": {lines: ["八戸線"],nexts: ["小中野","長苗代"]},"小中野": {lines: ["八戸線"],nexts: ["陸奥湊","本八戸"]},"陸奥湊": {lines: ["八戸線"],nexts: ["白銀","小中野"]},"白銀": {lines: ["八戸線"],nexts: ["鮫","陸奥湊"]},"鮫": {lines: ["八戸線"],nexts: ["陸奥白浜","白銀"]},"陸奥白浜": {lines: ["八戸線"],nexts: ["種差海岸","鮫"]},"種差海岸": {lines: ["八戸線"],nexts: ["大久喜","陸奥白浜"]},"大久喜": {lines: ["八戸線"],nexts: ["金浜","種差海岸"]},"金浜": {lines: ["八戸線"],nexts: ["大蛇","大久喜"]},"大蛇": {lines: ["八戸線"],nexts: ["階上","金浜"]},"階上": {lines: ["八戸線"],nexts: ["角の浜","大蛇"]},"角の浜": {lines: ["八戸線"],nexts: ["平内","階上"]},"平内": {lines: ["八戸線"],nexts: ["種市","角の浜"]},"種市": {lines: ["八戸線"],nexts: ["玉川","平内"]},"玉川": {lines: ["八戸線"],nexts: ["宿戸","種市"]},"宿戸": {lines: ["八戸線"],nexts: ["陸中八木","玉川"]},"陸中八木": {lines: ["八戸線"],nexts: ["有家","宿戸"]},"有家": {lines: ["八戸線"],nexts: ["陸中中野","陸中八木"]},"陸中中野": {lines: ["八戸線"],nexts: ["侍浜","有家"]},"侍浜": {lines: ["八戸線"],nexts: ["陸中夏井","陸中中野"]},"陸中夏井": {lines: ["八戸線"],nexts: ["久慈","侍浜"]},"久慈": {lines: ["八戸線"],nexts: ["陸中夏井"]},"銚子": {lines: ["総武本線"],nexts: ["松岸"]},"松岸": {lines: ["総武本線","成田線"],nexts: ["猿田","椎柴","銚子"]},"猿田": {lines: ["総武本線"],nexts: ["倉橋","松岸"]},"倉橋": {lines: ["総武本線"],nexts: ["飯岡","猿田"]},"飯岡": {lines: ["総武本線"],nexts: ["旭","倉橋"]},"旭": {lines: ["総武本線"],nexts: ["干潟","飯岡"]},"干潟": {lines: ["総武本線"],nexts: ["八日市場","旭"]},"八日市場": {lines: ["総武本線"],nexts: ["飯倉","干潟"]},"飯倉": {lines: ["総武本線"],nexts: ["横芝","八日市場"]},"横芝": {lines: ["総武本線"],nexts: ["松尾","飯倉"]},"松尾": {lines: ["総武本線"],nexts: ["成東","横芝"]},"成東": {lines: ["総武本線","東金線"],nexts: ["日向","松尾","求名"]},"日向": {lines: ["総武本線"],nexts: ["八街","成東"]},"八街": {lines: ["総武本線"],nexts: ["榎戸","日向"]},"榎戸": {lines: ["総武本線"],nexts: ["南酒々井","八街"]},"南酒々井": {lines: ["総武本線"],nexts: ["佐倉","榎戸"]},"佐倉": {lines: ["総武本線","成田線"],nexts: ["物井","南酒々井","酒々井"]},"物井": {lines: ["総武本線"],nexts: ["四街道","佐倉"]},"四街道": {lines: ["総武本線"],nexts: ["都賀","物井"]},"都賀": {lines: ["総武本線"],nexts: ["東千葉","四街道"]},"東千葉": {lines: ["総武本線"],nexts: ["千葉","都賀"]},"千葉": {lines: ["総武本線","外房線"],nexts: ["西千葉","東千葉","本千葉"]},"西千葉": {lines: ["総武本線"],nexts: ["稲毛","千葉"]},"稲毛": {lines: ["総武本線"],nexts: ["新検見川","西千葉"]},"新検見川": {lines: ["総武本線"],nexts: ["幕張","稲毛"]},"幕張": {lines: ["総武本線"],nexts: ["幕張本郷","新検見川"]},"幕張本郷": {lines: ["総武本線"],nexts: ["津田沼","幕張"]},"津田沼": {lines: ["総武本線"],nexts: ["東船橋","幕張本郷"]},"東船橋": {lines: ["総武本線"],nexts: ["船橋","津田沼"]},"船橋": {lines: ["総武本線"],nexts: ["西船橋","東船橋"]},"西船橋": {lines: ["総武本線","武蔵野線","京葉線"],nexts: ["下総中山","船橋","船橋法典","市川塩浜","南船橋"]},"下総中山": {lines: ["総武本線"],nexts: ["本八幡","西船橋"]},"本八幡": {lines: ["総武本線"],nexts: ["市川","下総中山"]},"市川": {lines: ["総武本線"],nexts: ["小岩","本八幡"]},"小岩": {lines: ["総武本線"],nexts: ["新小岩","市川"]},"新小岩": {lines: ["総武本線"],nexts: ["平井","小岩"]},"平井": {lines: ["総武本線"],nexts: ["亀戸","新小岩"]},"亀戸": {lines: ["総武本線"],nexts: ["錦糸町","平井"]},"錦糸町": {lines: ["総武本線"],nexts: ["馬喰町","亀戸","両国"]},"馬喰町": {lines: ["総武本線"],nexts: ["新日本橋","錦糸町"]},"新日本橋": {lines: ["総武本線"],nexts: ["東京","馬喰町"]},"両国": {lines: ["総武本線"],nexts: ["浅草橋","錦糸町"]},"浅草橋": {lines: ["総武本線"],nexts: ["秋葉原","両国"]},"御茶ノ水": {lines: ["総武本線"],nexts: ["秋葉原"]},"椎柴": {lines: ["成田線"],nexts: ["下総豊里","松岸"]},"下総豊里": {lines: ["成田線"],nexts: ["下総橘","椎柴"]},"下総橘": {lines: ["成田線"],nexts: ["笹川","下総豊里"]},"笹川": {lines: ["成田線"],nexts: ["小見川","下総橘"]},"小見川": {lines: ["成田線"],nexts: ["水郷","笹川"]},"水郷": {lines: ["成田線"],nexts: ["香取","小見川"]},"香取": {lines: ["成田線","鹿島線"],nexts: ["佐原","水郷","十二橋"]},"佐原": {lines: ["成田線"],nexts: ["大戸","香取"]},"大戸": {lines: ["成田線"],nexts: ["下総神崎","佐原"]},"下総神崎": {lines: ["成田線"],nexts: ["滑河","大戸"]},"滑河": {lines: ["成田線"],nexts: ["久住","下総神崎"]},"久住": {lines: ["成田線"],nexts: ["成田","滑河"]},"成田": {lines: ["成田線"],nexts: ["酒々井","久住","空港第２ビル","下総松崎"]},"酒々井": {lines: ["成田線"],nexts: ["佐倉","成田"]},"空港第２ビル": {lines: ["成田線"],nexts: ["成田空港","成田"]},"成田空港": {lines: ["成田線"],nexts: ["空港第２ビル"]},"下総松崎": {lines: ["成田線"],nexts: ["安食","成田"]},"安食": {lines: ["成田線"],nexts: ["小林","下総松崎"]},"小林": {lines: ["成田線"],nexts: ["木下","安食"]},"木下": {lines: ["成田線"],nexts: ["布佐","小林"]},"布佐": {lines: ["成田線"],nexts: ["新木","木下"]},"新木": {lines: ["成田線"],nexts: ["湖北","布佐"]},"湖北": {lines: ["成田線"],nexts: ["東我孫子","新木"]},"東我孫子": {lines: ["成田線"],nexts: ["我孫子","湖北"]},"安房鴨川": {lines: ["外房線","内房線"],nexts: ["安房天津","太海"]},"安房天津": {lines: ["外房線"],nexts: ["安房小湊","安房鴨川"]},"安房小湊": {lines: ["外房線"],nexts: ["行川アイランド","安房天津"]},"行川アイランド": {lines: ["外房線"],nexts: ["上総興津","安房小湊"]},"上総興津": {lines: ["外房線"],nexts: ["鵜原","行川アイランド"]},"鵜原": {lines: ["外房線"],nexts: ["勝浦","上総興津"]},"勝浦": {lines: ["外房線"],nexts: ["御宿","鵜原"]},"御宿": {lines: ["外房線"],nexts: ["浪花","勝浦"]},"浪花": {lines: ["外房線"],nexts: ["大原","御宿"]},"大原": {lines: ["外房線"],nexts: ["三門","浪花"]},"三門": {lines: ["外房線"],nexts: ["長者町","大原"]},"長者町": {lines: ["外房線"],nexts: ["太東","三門"]},"太東": {lines: ["外房線"],nexts: ["東浪見","長者町"]},"東浪見": {lines: ["外房線"],nexts: ["上総一ノ宮","太東"]},"上総一ノ宮": {lines: ["外房線"],nexts: ["八積","東浪見"]},"八積": {lines: ["外房線"],nexts: ["茂原","上総一ノ宮"]},"茂原": {lines: ["外房線"],nexts: ["新茂原","八積"]},"新茂原": {lines: ["外房線"],nexts: ["本納","茂原"]},"本納": {lines: ["外房線"],nexts: ["永田","新茂原"]},"永田": {lines: ["外房線"],nexts: ["大網","本納"]},"大網": {lines: ["外房線","東金線"],nexts: ["土気","永田","福俵"]},"土気": {lines: ["外房線"],nexts: ["誉田","大網"]},"誉田": {lines: ["外房線"],nexts: ["鎌取","土気"]},"鎌取": {lines: ["外房線"],nexts: ["蘇我","誉田"]},"蘇我": {lines: ["外房線","京葉線"],nexts: ["本千葉","鎌取","浜野","千葉みなと"]},"本千葉": {lines: ["外房線"],nexts: ["千葉","蘇我"]},"求名": {lines: ["東金線"],nexts: ["東金","成東"]},"東金": {lines: ["東金線"],nexts: ["福俵","求名"]},"福俵": {lines: ["東金線"],nexts: ["大網","東金"]},"太海": {lines: ["内房線"],nexts: ["江見","安房鴨川"]},"江見": {lines: ["内房線"],nexts: ["和田浦","太海"]},"和田浦": {lines: ["内房線"],nexts: ["南三原","江見"]},"南三原": {lines: ["内房線"],nexts: ["千歳","和田浦"]},"千歳": {lines: ["内房線"],nexts: ["千倉","南三原"]},"千倉": {lines: ["内房線"],nexts: ["九重","千歳"]},"九重": {lines: ["内房線"],nexts: ["館山","千倉"]},"館山": {lines: ["内房線"],nexts: ["那古船形","九重"]},"那古船形": {lines: ["内房線"],nexts: ["富浦","館山"]},"富浦": {lines: ["内房線"],nexts: ["岩井","那古船形"]},"岩井": {lines: ["内房線"],nexts: ["安房勝山","富浦"]},"安房勝山": {lines: ["内房線"],nexts: ["保田","岩井"]},"保田": {lines: ["内房線"],nexts: ["浜金谷","安房勝山"]},"浜金谷": {lines: ["内房線"],nexts: ["竹岡","保田"]},"竹岡": {lines: ["内房線"],nexts: ["上総湊","浜金谷"]},"上総湊": {lines: ["内房線"],nexts: ["佐貫町","竹岡"]},"佐貫町": {lines: ["内房線"],nexts: ["大貫","上総湊"]},"大貫": {lines: ["内房線"],nexts: ["青堀","佐貫町"]},"青堀": {lines: ["内房線"],nexts: ["君津","大貫"]},"君津": {lines: ["内房線"],nexts: ["木更津","青堀"]},"木更津": {lines: ["内房線","久留里線"],nexts: ["巌根","君津","祇園"]},"巌根": {lines: ["内房線"],nexts: ["袖ヶ浦","木更津"]},"袖ヶ浦": {lines: ["内房線"],nexts: ["長浦","巌根"]},"長浦": {lines: ["内房線"],nexts: ["姉ヶ崎","袖ヶ浦"]},"姉ヶ崎": {lines: ["内房線"],nexts: ["五井","長浦"]},"五井": {lines: ["内房線"],nexts: ["八幡宿","姉ヶ崎"]},"八幡宿": {lines: ["内房線"],nexts: ["浜野","五井"]},"浜野": {lines: ["内房線"],nexts: ["蘇我","八幡宿"]},"上総亀山": {lines: ["久留里線"],nexts: ["上総松丘"]},"上総松丘": {lines: ["久留里線"],nexts: ["平山","上総亀山"]},"平山": {lines: ["久留里線"],nexts: ["久留里","上総松丘"]},"久留里": {lines: ["久留里線"],nexts: ["俵田","平山"]},"俵田": {lines: ["久留里線"],nexts: ["小櫃","久留里"]},"小櫃": {lines: ["久留里線"],nexts: ["下郡","俵田"]},"下郡": {lines: ["久留里線"],nexts: ["馬来田","小櫃"]},"馬来田": {lines: ["久留里線"],nexts: ["東横田","下郡"]},"東横田": {lines: ["久留里線"],nexts: ["横田","馬来田"]},"横田": {lines: ["久留里線"],nexts: ["東清川","東横田"]},"東清川": {lines: ["久留里線"],nexts: ["上総清川","横田"]},"上総清川": {lines: ["久留里線"],nexts: ["祇園","東清川"]},"祇園": {lines: ["久留里線"],nexts: ["木更津","上総清川"]},"鹿島サッカースタジアム": {lines: ["鹿島線"],nexts: ["鹿島神宮"]},"鹿島神宮": {lines: ["鹿島線"],nexts: ["延方","鹿島サッカースタジアム"]},"延方": {lines: ["鹿島線"],nexts: ["潮来","鹿島神宮"]},"潮来": {lines: ["鹿島線"],nexts: ["十二橋","延方"]},"十二橋": {lines: ["鹿島線"],nexts: ["香取","潮来"]},"千葉みなと": {lines: ["京葉線"],nexts: ["稲毛海岸","蘇我"]},"稲毛海岸": {lines: ["京葉線"],nexts: ["検見川浜","千葉みなと"]},"検見川浜": {lines: ["京葉線"],nexts: ["海浜幕張","稲毛海岸"]},"海浜幕張": {lines: ["京葉線"],nexts: ["新習志野","検見川浜"]},"新習志野": {lines: ["京葉線"],nexts: ["南船橋","海浜幕張"]},"南船橋": {lines: ["京葉線"],nexts: ["二俣新町","新習志野","西船橋"]},"二俣新町": {lines: ["京葉線"],nexts: ["市川塩浜","南船橋"]},"市川塩浜": {lines: ["京葉線"],nexts: ["新浦安","二俣新町","西船橋"]},"新浦安": {lines: ["京葉線"],nexts: ["舞浜","市川塩浜"]},"舞浜": {lines: ["京葉線"],nexts: ["葛西臨海公園","新浦安"]},"葛西臨海公園": {lines: ["京葉線"],nexts: ["新木場","舞浜"]},"新木場": {lines: ["京葉線"],nexts: ["潮見","葛西臨海公園"]},"潮見": {lines: ["京葉線"],nexts: ["越中島","新木場"]},"越中島": {lines: ["京葉線"],nexts: ["八丁堀","潮見"]},"八丁堀": {lines: ["京葉線"],nexts: ["東京","越中島"]},"逢隈": {lines: ["常磐線"],nexts: ["亘理"]},"亘理": {lines: ["常磐線"],nexts: ["浜吉田","逢隈"]},"浜吉田": {lines: ["常磐線"],nexts: ["山下","亘理"]},"山下": {lines: ["常磐線"],nexts: ["坂元","浜吉田"]},"坂元": {lines: ["常磐線"],nexts: ["新地","山下"]},"新地": {lines: ["常磐線"],nexts: ["駒ヶ嶺","坂元"]},"駒ヶ嶺": {lines: ["常磐線"],nexts: ["相馬","新地"]},"相馬": {lines: ["常磐線"],nexts: ["日立木","駒ヶ嶺"]},"日立木": {lines: ["常磐線"],nexts: ["鹿島","相馬"]},"鹿島": {lines: ["常磐線"],nexts: ["原ノ町","日立木"]},"原ノ町": {lines: ["常磐線"],nexts: ["磐城太田","鹿島"]},"磐城太田": {lines: ["常磐線"],nexts: ["小高","原ノ町"]},"小高": {lines: ["常磐線"],nexts: ["桃内","磐城太田"]},"桃内": {lines: ["常磐線"],nexts: ["浪江","小高"]},"浪江": {lines: ["常磐線"],nexts: ["双葉","桃内"]},"双葉": {lines: ["常磐線"],nexts: ["大野","浪江"]},"大野": {lines: ["常磐線"],nexts: ["夜ノ森","双葉"]},"夜ノ森": {lines: ["常磐線"],nexts: ["富岡","大野"]},"富岡": {lines: ["常磐線"],nexts: ["竜田","夜ノ森"]},"竜田": {lines: ["常磐線"],nexts: ["木戸","富岡"]},"木戸": {lines: ["常磐線"],nexts: ["Jヴィレッジ","竜田"]},"Jヴィレッジ": {lines: ["常磐線"],nexts: ["広野","木戸"]},"広野": {lines: ["常磐線"],nexts: ["末続","Jヴィレッジ"]},"末続": {lines: ["常磐線"],nexts: ["久ノ浜","広野"]},"久ノ浜": {lines: ["常磐線"],nexts: ["四ツ倉","末続"]},"四ツ倉": {lines: ["常磐線"],nexts: ["草野","久ノ浜"]},"草野": {lines: ["常磐線"],nexts: ["いわき","四ツ倉"]},"いわき": {lines: ["常磐線"],nexts: ["内郷","草野"]},"内郷": {lines: ["常磐線"],nexts: ["湯本","いわき"]},"湯本": {lines: ["常磐線"],nexts: ["泉","内郷"]},"泉": {lines: ["常磐線"],nexts: ["植田","湯本"]},"植田": {lines: ["常磐線"],nexts: ["勿来","泉"]},"勿来": {lines: ["常磐線"],nexts: ["大津港","植田"]},"大津港": {lines: ["常磐線"],nexts: ["磯原","勿来"]},"磯原": {lines: ["常磐線"],nexts: ["南中郷","大津港"]},"南中郷": {lines: ["常磐線"],nexts: ["高萩","磯原"]},"高萩": {lines: ["常磐線"],nexts: ["十王","南中郷"]},"十王": {lines: ["常磐線"],nexts: ["小木津","高萩"]},"小木津": {lines: ["常磐線"],nexts: ["日立","十王"]},"日立": {lines: ["常磐線"],nexts: ["常陸多賀","小木津"]},"常陸多賀": {lines: ["常磐線"],nexts: ["大甕","日立"]},"大甕": {lines: ["常磐線"],nexts: ["東海","常陸多賀"]},"東海": {lines: ["常磐線"],nexts: ["佐和","大甕"]},"佐和": {lines: ["常磐線"],nexts: ["勝田","東海"]},"勝田": {lines: ["常磐線"],nexts: ["水戸","佐和"]},"水戸": {lines: ["常磐線"],nexts: ["偕楽園","勝田"]},"偕楽園": {lines: ["常磐線"],nexts: ["赤塚","水戸"]},"赤塚": {lines: ["常磐線"],nexts: ["内原","偕楽園"]},"内原": {lines: ["常磐線"],nexts: ["友部","赤塚"]},"友部": {lines: ["常磐線"],nexts: ["岩間","内原"],end: true},"岩間": {lines: ["常磐線"],nexts: ["羽鳥","友部"]},"羽鳥": {lines: ["常磐線"],nexts: ["石岡","岩間"]},"石岡": {lines: ["常磐線"],nexts: ["高浜","羽鳥"]},"高浜": {lines: ["常磐線"],nexts: ["神立","石岡"]},"神立": {lines: ["常磐線"],nexts: ["土浦","高浜"]},"土浦": {lines: ["常磐線"],nexts: ["荒川沖","神立"]},"荒川沖": {lines: ["常磐線"],nexts: ["ひたち野うしく","土浦"]},"ひたち野うしく": {lines: ["常磐線"],nexts: ["牛久","荒川沖"]},"牛久": {lines: ["常磐線"],nexts: ["龍ケ崎市","ひたち野うしく"]},"龍ケ崎市": {lines: ["常磐線"],nexts: ["藤代","牛久"]},"藤代": {lines: ["常磐線"],nexts: ["取手","龍ケ崎市"]},"取手": {lines: ["常磐線"],nexts: ["天王台","藤代"]},"天王台": {lines: ["常磐線"],nexts: ["我孫子","取手"]},"我孫子": {lines: ["常磐線","成田線"],nexts: ["北柏","天王台","東我孫子"]},"北柏": {lines: ["常磐線"],nexts: ["柏","我孫子"]},"柏": {lines: ["常磐線"],nexts: ["南柏","北柏"]},"南柏": {lines: ["常磐線"],nexts: ["北小金","柏"]},"北小金": {lines: ["常磐線"],nexts: ["新松戸","南柏"]},"新松戸": {lines: ["常磐線","武蔵野線"],nexts: ["馬橋","北小金","南流山","新八柱"]},"馬橋": {lines: ["常磐線"],nexts: ["北松戸","新松戸"]},"北松戸": {lines: ["常磐線"],nexts: ["松戸","馬橋"]},"松戸": {lines: ["常磐線"],nexts: ["金町","北松戸"]},"金町": {lines: ["常磐線"],nexts: ["亀有","松戸"]},"亀有": {lines: ["常磐線"],nexts: ["綾瀬","金町"]},"綾瀬": {lines: ["常磐線"],nexts: ["北千住","亀有"]},"北千住": {lines: ["常磐線"],nexts: ["南千住","綾瀬"]},"南千住": {lines: ["常磐線"],nexts: ["三河島","北千住"]},"三河島": {lines: ["常磐線"],nexts: ["南千住"]},"船橋法典": {lines: ["武蔵野線"],nexts: ["市川大野","西船橋"]},"市川大野": {lines: ["武蔵野線"],nexts: ["東松戸","船橋法典"]},"東松戸": {lines: ["武蔵野線"],nexts: ["新八柱","市川大野"]},"新八柱": {lines: ["武蔵野線"],nexts: ["新松戸","東松戸"]},"南流山": {lines: ["武蔵野線"],nexts: ["新松戸"]},"東京": {lines: ["東海道本線","東北本線","京葉線","山手線","総武本線"],nexts: ["有楽町","神田","新日本橋","八丁堀"]}};
      },
      fiber$main :function _trc_Lines_f_main(_thread) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        
        //$LASTPOS=1000000;//user.Lines:0
        Tonyu.globals.$lines={"宗谷本線": {},"石北本線": {},"釧網本線": {},"函館本線": {},"富良野線": {},"根室本線": {},"室蘭本線": {},"留萌本線": {},"札沼線": {},"石勝線": {},"日高本線": {},"千歳線": {},"大湊線": {},"津軽線": {},"五能線": {},"奥羽本線": {},"八戸線": {},"東北本線": {},"花輪線": {},"田沢湖線": {},"北上線": {},"山田線": {},"男鹿線": {},"釜石線": {},"大船渡線": {},"羽越本線": {},"陸羽西線": {},"陸羽東線": {},"石巻線": {},"仙石線": {},"仙石東北ライン": {},"仙山線": {},"左沢線": {},"米坂線": {},"磐越西線": {},"磐越東線": {},"白新線": {},"只見線": {},"水郡線": {},"上越線": {},"越後線": {},"弥彦線": {},"烏山線": {},"日光線": {},"飯山線": {},"信越本線": {},"吾妻線": {},"両毛線": {},"水戸線": {},"総武本線": {},"外房線": {},"内房線": {},"久留里線": {},"東金線": {},"成田線": {},"鹿島線": {},"常磐線": {},"京葉線": {},"武蔵野線": {},"高崎線": {},"八高線": {},"川越線": {},"青梅線": {},"五日市線": {},"中央本線": {},"埼京線": {},"山手線": {},"南武線": {},"横浜線": {},"根岸線": {},"鶴見線": {},"横須賀線": {},"相模線": {},"東海道本線": {},"大糸線": {},"篠ノ井線": {},"小海線": {},"御殿場線": {},"身延線": {},"伊東線": {},"飯田線": {},"太多線": {},"七尾線": {},"氷見線": {},"城端線": {},"越美北線": {},"高山本線": {},"北陸本線": {},"武豊線": {},"関西本線": {},"小浜線": {},"舞鶴線": {},"湖西線": {},"紀勢本線": {},"参宮線": {},"名松線": {},"草津線": {},"奈良線": {},"桜井線": {},"和歌山線": {},"阪和線": {},"片町線": {},"JR東西線": {},"おおさか東線": {},"関西空港線": {},"大阪環状線": {},"桜島線": {},"山陰本線": {},"福知山線": {},"播但線": {},"加古川線": {},"姫新線": {},"因美線": {},"津山線": {},"赤穂線": {},"山陽本線": {},"宇野線": {},"伯備線": {},"吉備線": {},"境線": {},"芸備線": {},"福塩線": {},"呉線": {},"可部線": {},"木次線": {},"岩徳線": {},"山口線": {},"美祢線": {},"小野田線": {},"宇部線": {},"本四備讃線": {},"高徳線": {},"予讃線": {},"内子線": {},"土讃線": {},"徳島線": {},"鳴門線": {},"牟岐線": {},"予土線": {},"鹿児島本線": {},"日豊本線": {},"博多南線": {},"筑豊本線": {},"香椎線": {},"日田彦山線": {},"後藤寺線": {},"篠栗線": {},"筑肥線": {},"唐津線": {},"佐世保線": {},"大村線": {},"長崎本線": {},"久大本線": {},"豊肥本線": {},"三角線": {},"肥薩線": {},"吉都線": {},"宮崎空港線": {},"日南線": {},"指宿枕崎線": {}};
        //$LASTPOS=1003343;//user.Lines:3343
        Tonyu.globals.$stations={"稚内": {lines: ["宗谷本線"],nexts: ["南稚内"]},"南稚内": {lines: ["宗谷本線"],nexts: ["抜海","稚内"]},"抜海": {lines: ["宗谷本線"],nexts: ["勇知","南稚内"]},"勇知": {lines: ["宗谷本線"],nexts: ["兜沼","抜海"]},"兜沼": {lines: ["宗谷本線"],nexts: ["徳満","勇知"]},"徳満": {lines: ["宗谷本線"],nexts: ["豊富","兜沼"]},"豊富": {lines: ["宗谷本線"],nexts: ["下沼","徳満"]},"下沼": {lines: ["宗谷本線"],nexts: ["幌延","豊富"]},"幌延": {lines: ["宗谷本線"],nexts: ["上幌延","下沼"]},"上幌延": {lines: ["宗谷本線"],nexts: ["南幌延","幌延"]},"南幌延": {lines: ["宗谷本線"],nexts: ["安牛","上幌延"]},"安牛": {lines: ["宗谷本線"],nexts: ["雄信内","南幌延"]},"雄信内": {lines: ["宗谷本線"],nexts: ["糠南","安牛"]},"糠南": {lines: ["宗谷本線"],nexts: ["問寒別","雄信内"]},"問寒別": {lines: ["宗谷本線"],nexts: ["歌内","糠南"]},"歌内": {lines: ["宗谷本線"],nexts: ["天塩中川","問寒別"]},"天塩中川": {lines: ["宗谷本線"],nexts: ["佐久","歌内"]},"佐久": {lines: ["宗谷本線"],nexts: ["筬島","天塩中川"]},"筬島": {lines: ["宗谷本線"],nexts: ["音威子府","佐久"]},"音威子府": {lines: ["宗谷本線"],nexts: ["咲来","筬島"]},"咲来": {lines: ["宗谷本線"],nexts: ["天塩川温泉","音威子府"]},"天塩川温泉": {lines: ["宗谷本線"],nexts: ["豊清水","咲来"]},"豊清水": {lines: ["宗谷本線"],nexts: ["恩根内","天塩川温泉"]},"恩根内": {lines: ["宗谷本線"],nexts: ["紋穂内","豊清水"]},"紋穂内": {lines: ["宗谷本線"],nexts: ["初野","恩根内"]},"初野": {lines: ["宗谷本線"],nexts: ["美深","紋穂内"]},"美深": {lines: ["宗谷本線"],nexts: ["南美深","初野"]},"南美深": {lines: ["宗谷本線"],nexts: ["智北","美深"]},"智北": {lines: ["宗谷本線"],nexts: ["智恵文","南美深"]},"智恵文": {lines: ["宗谷本線"],nexts: ["北星","智北"]},"北星": {lines: ["宗谷本線"],nexts: ["日進","智恵文"]},"日進(北)": {lines: ["宗谷本線"],nexts: ["名寄","北星"]},"名寄": {lines: ["宗谷本線"],nexts: ["東風連","日進"]},"東風連": {lines: ["宗谷本線"],nexts: ["風連","名寄"]},"風連": {lines: ["宗谷本線"],nexts: ["瑞穂","東風連"]},"瑞穂": {lines: ["宗谷本線"],nexts: ["多寄","風連"]},"多寄": {lines: ["宗谷本線"],nexts: ["下士別","瑞穂"]},"下士別": {lines: ["宗谷本線"],nexts: ["士別","多寄"]},"士別": {lines: ["宗谷本線"],nexts: ["北剣淵","下士別"]},"北剣淵": {lines: ["宗谷本線"],nexts: ["剣淵","士別"]},"剣淵": {lines: ["宗谷本線"],nexts: ["東六線","北剣淵"]},"東六線": {lines: ["宗谷本線"],nexts: ["和寒","剣淵"]},"和寒": {lines: ["宗谷本線"],nexts: ["塩狩","東六線"]},"塩狩": {lines: ["宗谷本線"],nexts: ["蘭留","和寒"]},"蘭留": {lines: ["宗谷本線"],nexts: ["北比布","塩狩"]},"北比布": {lines: ["宗谷本線"],nexts: ["比布","蘭留"]},"比布": {lines: ["宗谷本線"],nexts: ["南比布","北比布"]},"南比布": {lines: ["宗谷本線"],nexts: ["北永山","比布"]},"北永山": {lines: ["宗谷本線"],nexts: ["永山","南比布"]},"永山": {lines: ["宗谷本線"],nexts: ["新旭川","北永山"]},"新旭川": {lines: ["宗谷本線","石北本線"],nexts: ["旭川四条","永山","南永山"]},"旭川四条": {lines: ["宗谷本線"],nexts: ["旭川","新旭川"]},"旭川": {lines: ["函館本線","宗谷本線","富良野線"],nexts: ["近文","旭川四条","神楽岡"]},"近文": {lines: ["函館本線"],nexts: ["伊納","旭川"]},"伊納": {lines: ["函館本線"],nexts: ["納内","近文"]},"納内": {lines: ["函館本線"],nexts: ["深川","伊納"]},"深川": {lines: ["函館本線","留萌本線"],nexts: ["妹背牛","納内","北一已"]},"妹背牛": {lines: ["函館本線"],nexts: ["江部乙","深川"]},"江部乙": {lines: ["函館本線"],nexts: ["滝川","妹背牛"]},"滝川": {lines: ["函館本線","根室本線"],nexts: ["砂川","江部乙","東滝川"]},"砂川": {lines: ["函館本線"],nexts: ["豊沼","滝川"]},"豊沼": {lines: ["函館本線"],nexts: ["奈井江","砂川"]},"奈井江": {lines: ["函館本線"],nexts: ["茶志内","豊沼"]},"茶志内": {lines: ["函館本線"],nexts: ["美唄","奈井江"]},"美唄": {lines: ["函館本線"],nexts: ["光珠内","茶志内"]},"光珠内": {lines: ["函館本線"],nexts: ["峰延","美唄"]},"峰延": {lines: ["函館本線"],nexts: ["岩見沢","光珠内"]},"岩見沢": {lines: ["函館本線","室蘭本線"],nexts: ["上幌向","峰延","志文"]},"上幌向": {lines: ["函館本線"],nexts: ["幌向","岩見沢"]},"幌向": {lines: ["函館本線"],nexts: ["豊幌","上幌向"]},"豊幌": {lines: ["函館本線"],nexts: ["江別","幌向"]},"江別": {lines: ["函館本線"],nexts: ["高砂","豊幌"]},"高砂": {lines: ["函館本線"],nexts: ["野幌","江別"]},"野幌": {lines: ["函館本線"],nexts: ["大麻","高砂"]},"大麻": {lines: ["函館本線"],nexts: ["森林公園","野幌"]},"森林公園": {lines: ["函館本線"],nexts: ["厚別","大麻"]},"厚別": {lines: ["函館本線"],nexts: ["白石","森林公園"]},"白石(北)": {lines: ["函館本線","千歳線"],nexts: ["苗穂","厚別","平和"]},"苗穂": {lines: ["函館本線"],nexts: ["札幌","白石"]},"札幌": {lines: ["函館本線"],nexts: ["桑園","苗穂"]},"桑園": {lines: ["函館本線","札沼線"],nexts: ["琴似","札幌","八軒"]},"琴似": {lines: ["函館本線"],nexts: ["発寒中央","桑園"]},"発寒中央": {lines: ["函館本線"],nexts: ["発寒","琴似"]},"発寒": {lines: ["函館本線"],nexts: ["稲積公園","発寒中央"]},"稲積公園": {lines: ["函館本線"],nexts: ["手稲","発寒"]},"手稲": {lines: ["函館本線"],nexts: ["稲穂","稲積公園"]},"稲穂": {lines: ["函館本線"],nexts: ["星置","手稲"]},"星置": {lines: ["函館本線"],nexts: ["ほしみ","稲穂"]},"ほしみ": {lines: ["函館本線"],nexts: ["銭函","星置"]},"銭函": {lines: ["函館本線"],nexts: ["朝里","ほしみ"]},"朝里": {lines: ["函館本線"],nexts: ["小樽築港","銭函"]},"小樽築港": {lines: ["函館本線"],nexts: ["南小樽","朝里"]},"南小樽": {lines: ["函館本線"],nexts: ["小樽","小樽築港"]},"小樽": {lines: ["函館本線"],nexts: ["塩谷","南小樽"]},"塩谷": {lines: ["函館本線"],nexts: ["蘭島","小樽"]},"蘭島": {lines: ["函館本線"],nexts: ["余市","塩谷"]},"余市": {lines: ["函館本線"],nexts: ["仁木","蘭島"]},"仁木": {lines: ["函館本線"],nexts: ["然別","余市"]},"然別": {lines: ["函館本線"],nexts: ["銀山","仁木"]},"銀山": {lines: ["函館本線"],nexts: ["小沢","然別"]},"小沢": {lines: ["函館本線"],nexts: ["倶知安","銀山"]},"倶知安": {lines: ["函館本線"],nexts: ["比羅夫","小沢"]},"比羅夫": {lines: ["函館本線"],nexts: ["ニセコ","倶知安"]},"ニセコ": {lines: ["函館本線"],nexts: ["昆布","比羅夫"]},"昆布": {lines: ["函館本線"],nexts: ["蘭越","ニセコ"]},"蘭越": {lines: ["函館本線"],nexts: ["目名","昆布"]},"目名": {lines: ["函館本線"],nexts: ["熱郛","蘭越"]},"熱郛": {lines: ["函館本線"],nexts: ["黒松内","目名"]},"黒松内": {lines: ["函館本線"],nexts: ["二股","熱郛"]},"二股": {lines: ["函館本線"],nexts: ["長万部","黒松内"]},"長万部": {lines: ["函館本線","室蘭本線"],nexts: ["中ノ沢","二股","静狩"]},"中ノ沢": {lines: ["函館本線"],nexts: ["国縫","長万部"]},"国縫": {lines: ["函館本線"],nexts: ["黒岩","中ノ沢"]},"黒岩": {lines: ["函館本線"],nexts: ["山崎","国縫"]},"山崎(北)": {lines: ["函館本線"],nexts: ["八雲","黒岩"]},"八雲": {lines: ["函館本線"],nexts: ["山越","山崎"]},"山越": {lines: ["函館本線"],nexts: ["野田生","八雲"]},"野田生": {lines: ["函館本線"],nexts: ["落部","山越"]},"落部": {lines: ["函館本線"],nexts: ["石倉","野田生"]},"石倉": {lines: ["函館本線"],nexts: ["本石倉","落部"]},"本石倉": {lines: ["函館本線"],nexts: ["石谷","石倉"]},"石谷": {lines: ["函館本線"],nexts: ["森","本石倉"]},"森": {lines: ["函館本線"],nexts: ["駒ヶ岳","石谷"]},"駒ヶ岳": {lines: ["函館本線"],nexts: ["赤井川","森"]},"赤井川": {lines: ["函館本線"],nexts: ["大沼公園","駒ヶ岳"]},"大沼公園": {lines: ["函館本線"],nexts: ["大沼","赤井川"]},"大沼": {lines: ["函館本線"],nexts: ["仁山","大沼公園","七飯","池田園"]},"仁山": {lines: ["函館本線"],nexts: ["新函館北斗","大沼"]},"新函館北斗": {lines: ["函館本線"],nexts: ["七飯","仁山"]},"七飯": {lines: ["函館本線"],nexts: ["大中山","新函館北斗","大沼"]},"大中山": {lines: ["函館本線"],nexts: ["桔梗","七飯"]},"桔梗": {lines: ["函館本線"],nexts: ["五稜郭","大中山"]},"五稜郭": {lines: ["函館本線"],nexts: ["函館","桔梗"]},"函館": {lines: ["函館本線"],nexts: ["五稜郭"]},"東森": {lines: ["函館本線"],nexts: ["尾白内","森"]},"尾白内": {lines: ["函館本線"],nexts: ["掛澗","東森"]},"掛澗": {lines: ["函館本線"],nexts: ["渡島砂原","尾白内"]},"渡島砂原": {lines: ["函館本線"],nexts: ["渡島沼尻","掛澗"]},"渡島沼尻": {lines: ["函館本線"],nexts: ["鹿部","渡島砂原"]},"鹿部": {lines: ["函館本線"],nexts: ["銚子口","渡島沼尻"]},"銚子口": {lines: ["函館本線"],nexts: ["流山温泉","鹿部"]},"流山温泉": {lines: ["函館本線"],nexts: ["池田園","銚子口"]},"池田園": {lines: ["函館本線"],nexts: ["大沼","流山温泉"]},"志文": {lines: ["室蘭本線"],nexts: ["栗沢","岩見沢"]},"栗沢": {lines: ["室蘭本線"],nexts: ["栗丘","志文"]},"栗丘": {lines: ["室蘭本線"],nexts: ["栗山","栗沢"]},"栗山": {lines: ["室蘭本線"],nexts: ["由仁","栗丘"]},"由仁": {lines: ["室蘭本線"],nexts: ["古山","栗山"]},"古山": {lines: ["室蘭本線"],nexts: ["三川","由仁"]},"三川(北)": {lines: ["室蘭本線"],nexts: ["追分","古山"]},"追分(北)": {lines: ["室蘭本線","石勝線"],nexts: ["安平","三川","南千歳","川端"]},"安平": {lines: ["室蘭本線"],nexts: ["早来","追分"]},"早来": {lines: ["室蘭本線"],nexts: ["遠浅","安平"]},"遠浅": {lines: ["室蘭本線"],nexts: ["沼ノ端","早来"]},"沼ノ端": {lines: ["室蘭本線","千歳線"],nexts: ["苫小牧","遠浅","植苗"]},"苫小牧": {lines: ["室蘭本線","日高本線"],nexts: ["青葉","沼ノ端","勇払"]},"青葉": {lines: ["室蘭本線"],nexts: ["糸井","苫小牧"]},"糸井": {lines: ["室蘭本線"],nexts: ["錦岡","青葉"]},"錦岡": {lines: ["室蘭本線"],nexts: ["社台","糸井"]},"社台": {lines: ["室蘭本線"],nexts: ["白老","錦岡"]},"白老": {lines: ["室蘭本線"],nexts: ["荻野","社台"]},"荻野": {lines: ["室蘭本線"],nexts: ["北吉原","白老"]},"北吉原": {lines: ["室蘭本線"],nexts: ["竹浦","荻野"]},"竹浦": {lines: ["室蘭本線"],nexts: ["虎杖浜","北吉原"]},"虎杖浜": {lines: ["室蘭本線"],nexts: ["登別","竹浦"]},"登別": {lines: ["室蘭本線"],nexts: ["富浦","虎杖浜"]},"富浦(北)": {lines: ["室蘭本線"],nexts: ["幌別","登別"]},"幌別": {lines: ["室蘭本線"],nexts: ["鷲別","富浦"]},"鷲別": {lines: ["室蘭本線"],nexts: ["東室蘭","幌別"]},"東室蘭": {lines: ["室蘭本線"],nexts: ["本輪西","鷲別"]},"本輪西": {lines: ["室蘭本線"],nexts: ["崎守","東室蘭"]},"崎守": {lines: ["室蘭本線"],nexts: ["黄金","本輪西"]},"黄金": {lines: ["室蘭本線"],nexts: ["稀府","崎守"]},"稀府": {lines: ["室蘭本線"],nexts: ["北舟岡","黄金"]},"北舟岡": {lines: ["室蘭本線"],nexts: ["伊達紋別","稀府"]},"伊達紋別": {lines: ["室蘭本線"],nexts: ["長和","北舟岡"]},"長和": {lines: ["室蘭本線"],nexts: ["有珠","伊達紋別"]},"有珠": {lines: ["室蘭本線"],nexts: ["洞爺","長和"]},"洞爺": {lines: ["室蘭本線"],nexts: ["豊浦","有珠"]},"豊浦": {lines: ["室蘭本線"],nexts: ["大岸","洞爺"]},"大岸": {lines: ["室蘭本線"],nexts: ["礼文","豊浦"]},"礼文": {lines: ["室蘭本線"],nexts: ["小幌","大岸"]},"小幌": {lines: ["室蘭本線"],nexts: ["静狩","礼文"]},"静狩": {lines: ["室蘭本線"],nexts: ["長万部","小幌"]},"輪西": {lines: ["室蘭本線"],nexts: ["御崎","東室蘭"]},"御崎": {lines: ["室蘭本線"],nexts: ["母恋","輪西"]},"母恋": {lines: ["室蘭本線"],nexts: ["室蘭","御崎"]},"室蘭": {lines: ["室蘭本線"],nexts: ["母恋"]},"根室": {lines: ["根室本線"],nexts: ["東根室"]},"東根室": {lines: ["根室本線"],nexts: ["西和田","根室"]},"西和田": {lines: ["根室本線"],nexts: ["昆布盛","東根室"]},"昆布盛": {lines: ["根室本線"],nexts: ["落石","西和田"]},"落石": {lines: ["根室本線"],nexts: ["別当賀","昆布盛"]},"別当賀": {lines: ["根室本線"],nexts: ["初田牛","落石"]},"初田牛": {lines: ["根室本線"],nexts: ["厚床","別当賀"]},"厚床": {lines: ["根室本線"],nexts: ["姉別","初田牛"]},"姉別": {lines: ["根室本線"],nexts: ["浜中","厚床"]},"浜中": {lines: ["根室本線"],nexts: ["茶内","姉別"]},"茶内": {lines: ["根室本線"],nexts: ["糸魚沢","浜中"]},"糸魚沢": {lines: ["根室本線"],nexts: ["厚岸","茶内"]},"厚岸": {lines: ["根室本線"],nexts: ["門静","糸魚沢"]},"門静": {lines: ["根室本線"],nexts: ["尾幌","厚岸"]},"尾幌": {lines: ["根室本線"],nexts: ["上尾幌","門静"]},"上尾幌": {lines: ["根室本線"],nexts: ["別保","尾幌"]},"別保": {lines: ["根室本線"],nexts: ["武佐","上尾幌"]},"武佐": {lines: ["根室本線"],nexts: ["東釧路","別保"]},"東釧路": {lines: ["根室本線","釧網本線"],nexts: ["釧路","武佐","遠矢"]},"釧路": {lines: ["根室本線"],nexts: ["新富士","東釧路"]},"新富士": {lines: ["根室本線"],nexts: ["新大楽毛","釧路"]},"新大楽毛": {lines: ["根室本線"],nexts: ["大楽毛","新富士"]},"大楽毛": {lines: ["根室本線"],nexts: ["庶路","新大楽毛"]},"庶路": {lines: ["根室本線"],nexts: ["西庶路","大楽毛"]},"西庶路": {lines: ["根室本線"],nexts: ["白糠","庶路"]},"白糠": {lines: ["根室本線"],nexts: ["音別","西庶路"]},"音別": {lines: ["根室本線"],nexts: ["厚内","白糠"]},"厚内": {lines: ["根室本線"],nexts: ["浦幌","音別"]},"浦幌": {lines: ["根室本線"],nexts: ["新吉野","厚内"]},"新吉野": {lines: ["根室本線"],nexts: ["豊頃","浦幌"]},"豊頃": {lines: ["根室本線"],nexts: ["十弗","新吉野"]},"十弗": {lines: ["根室本線"],nexts: ["池田","豊頃"]},"池田": {lines: ["根室本線"],nexts: ["利別","十弗"]},"利別": {lines: ["根室本線"],nexts: ["幕別","池田"]},"幕別": {lines: ["根室本線"],nexts: ["札内","利別"]},"札内": {lines: ["根室本線"],nexts: ["帯広","幕別"]},"帯広": {lines: ["根室本線"],nexts: ["柏林台","札内"]},"柏林台": {lines: ["根室本線"],nexts: ["西帯広","帯広"]},"西帯広": {lines: ["根室本線"],nexts: ["大成","柏林台"]},"大成": {lines: ["根室本線"],nexts: ["芽室","西帯広"]},"芽室": {lines: ["根室本線"],nexts: ["御影","大成"]},"御影": {lines: ["根室本線"],nexts: ["十勝清水","芽室"]},"十勝清水": {lines: ["根室本線"],nexts: ["新得","御影"]},"新得": {lines: ["根室本線","石勝線"],nexts: ["落合","十勝清水","トマム"]},"落合": {lines: ["根室本線"],nexts: ["幾寅","新得"]},"幾寅": {lines: ["根室本線"],nexts: ["東鹿越","落合"]},"東鹿越": {lines: ["根室本線"],nexts: ["金山","幾寅"]},"金山(北)": {lines: ["根室本線"],nexts: ["下金山","東鹿越"]},"下金山": {lines: ["根室本線"],nexts: ["山部","金山"]},"山部": {lines: ["根室本線"],nexts: ["布部","下金山"]},"布部": {lines: ["根室本線"],nexts: ["富良野","山部"]},"富良野": {lines: ["根室本線","富良野線"],nexts: ["野花南","布部","学田"]},"野花南": {lines: ["根室本線"],nexts: ["上芦別","富良野"]},"上芦別": {lines: ["根室本線"],nexts: ["芦別","野花南"]},"芦別": {lines: ["根室本線"],nexts: ["平岸","上芦別"]},"平岸": {lines: ["根室本線"],nexts: ["茂尻","芦別"]},"茂尻": {lines: ["根室本線"],nexts: ["赤平","平岸"]},"赤平": {lines: ["根室本線"],nexts: ["東滝川","茂尻"]},"東滝川": {lines: ["根室本線"],nexts: ["滝川","赤平"]},"植苗": {lines: ["千歳線"],nexts: ["南千歳","沼ノ端"]},"南千歳": {lines: ["千歳線","石勝線"],nexts: ["千歳","植苗","新千歳空港","追分"]},"千歳(北)": {lines: ["千歳線"],nexts: ["長都","南千歳"]},"長都": {lines: ["千歳線"],nexts: ["サッポロビール庭園","千歳"]},"サッポロビール庭園": {lines: ["千歳線"],nexts: ["恵庭","長都"]},"恵庭": {lines: ["千歳線"],nexts: ["恵み野","サッポロビール庭園"]},"恵み野": {lines: ["千歳線"],nexts: ["島松","恵庭"]},"島松": {lines: ["千歳線"],nexts: ["北広島","恵み野"]},"北広島": {lines: ["千歳線"],nexts: ["上野幌","島松"]},"上野幌": {lines: ["千歳線"],nexts: ["新札幌","北広島"]},"新札幌": {lines: ["千歳線"],nexts: ["平和","上野幌"]},"平和": {lines: ["千歳線"],nexts: ["白石","新札幌"]},"トマム": {lines: ["石勝線"],nexts: ["占冠","新得"]},"占冠": {lines: ["石勝線"],nexts: ["新夕張","トマム"]},"新夕張": {lines: ["石勝線"],nexts: ["滝ノ上","占冠"]},"滝ノ上": {lines: ["石勝線"],nexts: ["川端","新夕張"]},"川端": {lines: ["石勝線"],nexts: ["追分","滝ノ上"]},"新千歳空港": {lines: ["石勝線"],nexts: ["南千歳"]},"学田": {lines: ["富良野線"],nexts: ["鹿討","富良野"]},"鹿討": {lines: ["富良野線"],nexts: ["中富良野","学田"]},"中富良野": {lines: ["富良野線"],nexts: ["ラベンダー畑","鹿討"]},"ラベンダー畑": {lines: ["富良野線"],nexts: ["西中","中富良野"]},"西中": {lines: ["富良野線"],nexts: ["上富良野","ラベンダー畑"]},"上富良野": {lines: ["富良野線"],nexts: ["美馬牛","西中"]},"美馬牛": {lines: ["富良野線"],nexts: ["美瑛","上富良野"]},"美瑛": {lines: ["富良野線"],nexts: ["北美瑛","美馬牛"]},"北美瑛": {lines: ["富良野線"],nexts: ["千代ヶ丘","美瑛"]},"千代ヶ丘": {lines: ["富良野線"],nexts: ["西聖和","北美瑛"]},"西聖和": {lines: ["富良野線"],nexts: ["西神楽","千代ヶ丘"]},"西神楽": {lines: ["富良野線"],nexts: ["西瑞穂","西聖和"]},"西瑞穂": {lines: ["富良野線"],nexts: ["西御料","西神楽"]},"西御料": {lines: ["富良野線"],nexts: ["緑が丘","西瑞穂"]},"緑が丘": {lines: ["富良野線"],nexts: ["神楽岡","西御料"]},"神楽岡": {lines: ["富良野線"],nexts: ["旭川","緑が丘"]},"遠矢": {lines: ["釧網本線"],nexts: ["釧路湿原","東釧路"]},"釧路湿原": {lines: ["釧網本線"],nexts: ["細岡","遠矢"]},"細岡": {lines: ["釧網本線"],nexts: ["塘路","釧路湿原"]},"塘路": {lines: ["釧網本線"],nexts: ["茅沼","細岡"]},"茅沼": {lines: ["釧網本線"],nexts: ["標茶","塘路"]},"標茶": {lines: ["釧網本線"],nexts: ["磯分内","茅沼"]},"磯分内": {lines: ["釧網本線"],nexts: ["摩周","標茶"]},"摩周": {lines: ["釧網本線"],nexts: ["美留和","磯分内"]},"美留和": {lines: ["釧網本線"],nexts: ["川湯温泉","摩周"]},"川湯温泉": {lines: ["釧網本線"],nexts: ["緑","美留和"]},"緑": {lines: ["釧網本線"],nexts: ["札弦","川湯温泉"]},"札弦": {lines: ["釧網本線"],nexts: ["清里町","緑"]},"清里町": {lines: ["釧網本線"],nexts: ["南斜里","札弦"]},"南斜里": {lines: ["釧網本線"],nexts: ["中斜里","清里町"]},"中斜里": {lines: ["釧網本線"],nexts: ["知床斜里","南斜里"]},"知床斜里": {lines: ["釧網本線"],nexts: ["止別","中斜里"]},"止別": {lines: ["釧網本線"],nexts: ["浜小清水","知床斜里"]},"浜小清水": {lines: ["釧網本線"],nexts: ["原生花園","止別"]},"原生花園": {lines: ["釧網本線"],nexts: ["北浜","浜小清水"]},"北浜": {lines: ["釧網本線"],nexts: ["藻琴","原生花園"]},"藻琴": {lines: ["釧網本線"],nexts: ["鱒浦","北浜"]},"鱒浦": {lines: ["釧網本線"],nexts: ["桂台","藻琴"]},"桂台": {lines: ["釧網本線"],nexts: ["網走","鱒浦"]},"網走": {lines: ["釧網本線","石北本線"],nexts: ["呼人","桂台"]},"呼人": {lines: ["石北本線"],nexts: ["女満別","網走"]},"女満別": {lines: ["石北本線"],nexts: ["西女満別","呼人"]},"西女満別": {lines: ["石北本線"],nexts: ["美幌","女満別"]},"美幌": {lines: ["石北本線"],nexts: ["緋牛内","西女満別"]},"緋牛内": {lines: ["石北本線"],nexts: ["端野","美幌"]},"端野": {lines: ["石北本線"],nexts: ["愛し野","緋牛内"]},"愛し野": {lines: ["石北本線"],nexts: ["柏陽","端野"]},"柏陽": {lines: ["石北本線"],nexts: ["北見","愛し野"]},"北見": {lines: ["石北本線"],nexts: ["西北見","柏陽"]},"西北見": {lines: ["石北本線"],nexts: ["東相内","北見"]},"東相内": {lines: ["石北本線"],nexts: ["相内","西北見"]},"相内": {lines: ["石北本線"],nexts: ["留辺蘂","東相内"]},"留辺蘂": {lines: ["石北本線"],nexts: ["西留辺蘂","相内"]},"西留辺蘂": {lines: ["石北本線"],nexts: ["生田原","留辺蘂"]},"生田原": {lines: ["石北本線"],nexts: ["生野","西留辺蘂"]},"生野(北)": {lines: ["石北本線"],nexts: ["安国","生田原"]},"安国": {lines: ["石北本線"],nexts: ["遠軽","生野"]},"遠軽": {lines: ["石北本線"],nexts: ["瀬戸瀬","安国"]},"瀬戸瀬": {lines: ["石北本線"],nexts: ["丸瀬布","遠軽"]},"丸瀬布": {lines: ["石北本線"],nexts: ["白滝","瀬戸瀬"]},"白滝": {lines: ["石北本線"],nexts: ["上川","丸瀬布"]},"上川": {lines: ["石北本線"],nexts: ["東雲","白滝"]},"東雲": {lines: ["石北本線"],nexts: ["安足間","上川"]},"安足間": {lines: ["石北本線"],nexts: ["愛山","東雲"]},"愛山": {lines: ["石北本線"],nexts: ["中愛別","安足間"]},"中愛別": {lines: ["石北本線"],nexts: ["愛別","愛山"]},"愛別": {lines: ["石北本線"],nexts: ["伊香牛","中愛別"]},"伊香牛": {lines: ["石北本線"],nexts: ["将軍山","愛別"]},"将軍山": {lines: ["石北本線"],nexts: ["当麻","伊香牛"]},"当麻": {lines: ["石北本線"],nexts: ["桜岡","将軍山"]},"桜岡": {lines: ["石北本線"],nexts: ["北日ノ出","当麻"]},"北日ノ出": {lines: ["石北本線"],nexts: ["東旭川","桜岡"]},"東旭川": {lines: ["石北本線"],nexts: ["南永山","北日ノ出"]},"南永山": {lines: ["石北本線"],nexts: ["新旭川","東旭川"]},"留萌": {lines: ["留萌本線"],nexts: ["大和田"]},"大和田": {lines: ["留萌本線"],nexts: ["藤山","留萌"]},"藤山": {lines: ["留萌本線"],nexts: ["幌糠","大和田"]},"幌糠": {lines: ["留萌本線"],nexts: ["峠下","藤山"]},"峠下": {lines: ["留萌本線"],nexts: ["恵比島","幌糠"]},"恵比島": {lines: ["留萌本線"],nexts: ["真布","峠下"]},"真布": {lines: ["留萌本線"],nexts: ["石狩沼田","恵比島"]},"石狩沼田": {lines: ["留萌本線"],nexts: ["北秩父別","真布"]},"北秩父別": {lines: ["留萌本線"],nexts: ["秩父別","石狩沼田"]},"秩父別": {lines: ["留萌本線"],nexts: ["北一已","北秩父別"]},"北一已": {lines: ["留萌本線"],nexts: ["深川","秩父別"]},"北海道医療大学": {lines: ["札沼線"],nexts: ["石狩当別"]},"石狩当別": {lines: ["札沼線"],nexts: ["石狩太美","北海道医療大学"]},"石狩太美": {lines: ["札沼線"],nexts: ["あいの里公園","石狩当別"]},"あいの里公園": {lines: ["札沼線"],nexts: ["あいの里教育大","石狩太美"]},"あいの里教育大": {lines: ["札沼線"],nexts: ["拓北","あいの里公園"]},"拓北": {lines: ["札沼線"],nexts: ["篠路","あいの里教育大"]},"篠路": {lines: ["札沼線"],nexts: ["百合が原","拓北"]},"百合が原": {lines: ["札沼線"],nexts: ["太平","篠路"]},"太平": {lines: ["札沼線"],nexts: ["新琴似","百合が原"]},"新琴似": {lines: ["札沼線"],nexts: ["新川","太平"]},"新川": {lines: ["札沼線"],nexts: ["八軒","新琴似"]},"八軒": {lines: ["札沼線"],nexts: ["桑園","新川"]},"様似": {lines: ["日高本線"],nexts: ["西様似"]},"西様似": {lines: ["日高本線"],nexts: ["鵜苫","様似"]},"鵜苫": {lines: ["日高本線"],nexts: ["日高幌別","西様似"]},"日高幌別": {lines: ["日高本線"],nexts: ["東町","鵜苫"]},"東町": {lines: ["日高本線"],nexts: ["浦河","日高幌別"]},"浦河": {lines: ["日高本線"],nexts: ["絵笛","東町"]},"絵笛": {lines: ["日高本線"],nexts: ["荻伏","浦河"]},"荻伏": {lines: ["日高本線"],nexts: ["本桐","絵笛"]},"本桐": {lines: ["日高本線"],nexts: ["蓬栄","荻伏"]},"蓬栄": {lines: ["日高本線"],nexts: ["日高三石","本桐"]},"日高三石": {lines: ["日高本線"],nexts: ["日高東別","蓬栄"]},"日高東別": {lines: ["日高本線"],nexts: ["春立","日高三石"]},"春立": {lines: ["日高本線"],nexts: ["東静内","日高東別"]},"東静内": {lines: ["日高本線"],nexts: ["静内","春立"]},"静内": {lines: ["日高本線"],nexts: ["新冠","東静内"]},"新冠": {lines: ["日高本線"],nexts: ["節婦","静内"]},"節婦": {lines: ["日高本線"],nexts: ["大狩部","新冠"]},"大狩部": {lines: ["日高本線"],nexts: ["厚賀","節婦"]},"厚賀": {lines: ["日高本線"],nexts: ["清畠","大狩部"]},"清畠": {lines: ["日高本線"],nexts: ["豊郷","厚賀"]},"豊郷": {lines: ["日高本線"],nexts: ["日高門別","清畠"]},"日高門別": {lines: ["日高本線"],nexts: ["富川","豊郷"]},"富川": {lines: ["日高本線"],nexts: ["汐見","日高門別"]},"汐見": {lines: ["日高本線"],nexts: ["鵡川","富川"]},"鵡川": {lines: ["日高本線"],nexts: ["浜田浦","汐見"]},"浜田浦": {lines: ["日高本線"],nexts: ["浜厚真","鵡川"]},"浜厚真": {lines: ["日高本線"],nexts: ["勇払","浜田浦"]},"勇払": {lines: ["日高本線"],nexts: ["苫小牧","浜厚真"]},"青森": {lines: ["奥羽本線","津軽線"],nexts: ["新青森","油川"]},"新青森": {lines: ["奥羽本線"],nexts: ["津軽新城","青森"]},"津軽新城": {lines: ["奥羽本線"],nexts: ["鶴ヶ坂","新青森"]},"鶴ヶ坂": {lines: ["奥羽本線"],nexts: ["大釈迦","津軽新城"]},"大釈迦": {lines: ["奥羽本線"],nexts: ["浪岡","鶴ヶ坂"]},"浪岡": {lines: ["奥羽本線"],nexts: ["北常盤","大釈迦"]},"北常盤": {lines: ["奥羽本線"],nexts: ["川部","浪岡"]},"川部": {lines: ["奥羽本線","五能線"],nexts: ["撫牛子","北常盤","藤崎"]},"撫牛子": {lines: ["奥羽本線"],nexts: ["弘前","川部"]},"弘前": {lines: ["奥羽本線"],nexts: ["石川","撫牛子"]},"石川": {lines: ["奥羽本線"],nexts: ["大鰐温泉","弘前"]},"大鰐温泉": {lines: ["奥羽本線"],nexts: ["長峰","石川"]},"長峰": {lines: ["奥羽本線"],nexts: ["碇ヶ関","大鰐温泉"]},"碇ヶ関": {lines: ["奥羽本線"],nexts: ["津軽湯の沢","長峰"]},"津軽湯の沢": {lines: ["奥羽本線"],nexts: ["陣馬","碇ヶ関"]},"陣馬": {lines: ["奥羽本線"],nexts: ["白沢","津軽湯の沢"]},"白沢": {lines: ["奥羽本線"],nexts: ["大館","陣馬"]},"大館": {lines: ["奥羽本線","花輪線"],nexts: ["下川沿","白沢"]},"下川沿": {lines: ["奥羽本線"],nexts: ["早口","大館"]},"早口": {lines: ["奥羽本線"],nexts: ["糠沢","下川沿"]},"糠沢": {lines: ["奥羽本線"],nexts: ["鷹ノ巣","早口"]},"鷹ノ巣": {lines: ["奥羽本線"],nexts: ["前山","糠沢"]},"前山": {lines: ["奥羽本線"],nexts: ["二ツ井","鷹ノ巣"]},"二ツ井": {lines: ["奥羽本線"],nexts: ["富根","前山"]},"富根": {lines: ["奥羽本線"],nexts: ["鶴形","二ツ井"]},"鶴形": {lines: ["奥羽本線"],nexts: ["東能代","富根"]},"東能代": {lines: ["奥羽本線","五能線"],nexts: ["北金岡","鶴形","能代"]},"北金岡": {lines: ["奥羽本線"],nexts: ["森岳","東能代"]},"森岳": {lines: ["奥羽本線"],nexts: ["鹿渡","北金岡"]},"鹿渡": {lines: ["奥羽本線"],nexts: ["鯉川","森岳"]},"鯉川": {lines: ["奥羽本線"],nexts: ["八郎潟","鹿渡"]},"八郎潟": {lines: ["奥羽本線"],nexts: ["井川さくら","鯉川"]},"井川さくら": {lines: ["奥羽本線"],nexts: ["羽後飯塚","八郎潟"]},"羽後飯塚": {lines: ["奥羽本線"],nexts: ["大久保","井川さくら"]},"大久保": {lines: ["奥羽本線"],nexts: ["追分","羽後飯塚"]},"追分": {lines: ["奥羽本線","男鹿線"],nexts: ["上飯島","大久保"]},"上飯島": {lines: ["奥羽本線"],nexts: ["土崎","追分"]},"土崎": {lines: ["奥羽本線"],nexts: ["秋田","上飯島"]},"四ツ小屋": {lines: ["奥羽本線"],nexts: ["和田","秋田"]},"和田": {lines: ["奥羽本線"],nexts: ["大張野","四ツ小屋"]},"大張野": {lines: ["奥羽本線"],nexts: ["羽後境","和田"]},"羽後境": {lines: ["奥羽本線"],nexts: ["峰吉川","大張野"]},"峰吉川": {lines: ["奥羽本線"],nexts: ["刈和野","羽後境"]},"刈和野": {lines: ["奥羽本線"],nexts: ["神宮寺","峰吉川"]},"神宮寺": {lines: ["奥羽本線"],nexts: ["大曲","刈和野"]},"大曲": {lines: ["奥羽本線","田沢湖線"],nexts: ["飯詰","神宮寺"]},"飯詰": {lines: ["奥羽本線"],nexts: ["後三年","大曲"]},"後三年": {lines: ["奥羽本線"],nexts: ["横手","飯詰"]},"横手": {lines: ["奥羽本線","北上線"],nexts: ["柳田","後三年"]},"柳田": {lines: ["奥羽本線"],nexts: ["醍醐","横手"]},"醍醐": {lines: ["奥羽本線"],nexts: ["十文字","柳田"]},"十文字": {lines: ["奥羽本線"],nexts: ["下湯沢","醍醐"]},"下湯沢": {lines: ["奥羽本線"],nexts: ["湯沢","十文字"]},"湯沢": {lines: ["奥羽本線"],nexts: ["上湯沢","下湯沢"]},"上湯沢": {lines: ["奥羽本線"],nexts: ["三関","湯沢"]},"三関": {lines: ["奥羽本線"],nexts: ["横堀","上湯沢"]},"横堀": {lines: ["奥羽本線"],nexts: ["院内","三関"]},"院内": {lines: ["奥羽本線"],nexts: ["及位","横堀"]},"及位": {lines: ["奥羽本線"],nexts: ["大滝","院内"]},"大滝": {lines: ["奥羽本線"],nexts: ["釜淵","及位"]},"釜淵": {lines: ["奥羽本線"],nexts: ["真室川","大滝"]},"真室川": {lines: ["奥羽本線"],nexts: ["羽前豊里","釜淵"]},"羽前豊里": {lines: ["奥羽本線"],nexts: ["泉田","真室川"]},"泉田": {lines: ["奥羽本線"],nexts: ["新庄","羽前豊里"]},"新庄": {lines: ["奥羽本線","陸羽西線","陸羽東線"],nexts: ["舟形","泉田"]},"舟形": {lines: ["奥羽本線"],nexts: ["芦沢","新庄"]},"芦沢": {lines: ["奥羽本線"],nexts: ["北大石田","舟形"]},"北大石田": {lines: ["奥羽本線"],nexts: ["大石田","芦沢"]},"大石田": {lines: ["奥羽本線"],nexts: ["袖崎","北大石田"]},"袖崎": {lines: ["奥羽本線"],nexts: ["村山","大石田"]},"村山": {lines: ["奥羽本線"],nexts: ["東根","袖崎"]},"東根": {lines: ["奥羽本線"],nexts: ["さくらんぼ東根","村山"]},"さくらんぼ東根": {lines: ["奥羽本線"],nexts: ["神町","東根"]},"神町": {lines: ["奥羽本線"],nexts: ["乱川","さくらんぼ東根"]},"乱川": {lines: ["奥羽本線"],nexts: ["天童","神町"]},"天童": {lines: ["奥羽本線"],nexts: ["天童南","乱川"]},"天童南": {lines: ["奥羽本線"],nexts: ["高擶","天童"]},"高擶": {lines: ["奥羽本線"],nexts: ["漆山","天童南"]},"漆山": {lines: ["奥羽本線"],nexts: ["南出羽","高擶"]},"南出羽": {lines: ["奥羽本線"],nexts: ["羽前千歳","漆山"]},"羽前千歳": {lines: ["奥羽本線","仙山線"],nexts: ["北山形","南出羽"]},"北山形": {lines: ["奥羽本線","左沢線"],nexts: ["山形","羽前千歳"]},"山形": {lines: ["奥羽本線"],nexts: ["蔵王","北山形"]},"蔵王": {lines: ["奥羽本線"],nexts: ["茂吉記念館前","山形"]},"茂吉記念館前": {lines: ["奥羽本線"],nexts: ["かみのやま温泉","蔵王"]},"かみのやま温泉": {lines: ["奥羽本線"],nexts: ["羽前中山","茂吉記念館前"]},"羽前中山": {lines: ["奥羽本線"],nexts: ["中川","かみのやま温泉"]},"中川": {lines: ["奥羽本線"],nexts: ["赤湯","羽前中山"]},"赤湯": {lines: ["奥羽本線"],nexts: ["高畠","中川"]},"高畠": {lines: ["奥羽本線"],nexts: ["置賜","赤湯"]},"置賜": {lines: ["奥羽本線"],nexts: ["米沢","高畠"]},"米沢": {lines: ["奥羽本線","米坂線"],nexts: ["関根","置賜"]},"関根": {lines: ["奥羽本線"],nexts: ["大沢","米沢"]},"大沢": {lines: ["奥羽本線"],nexts: ["峠","関根"]},"峠": {lines: ["奥羽本線"],nexts: ["板谷","大沢"]},"板谷": {lines: ["奥羽本線"],nexts: ["赤岩","峠"]},"赤岩": {lines: ["奥羽本線"],nexts: ["庭坂","板谷"]},"庭坂": {lines: ["奥羽本線"],nexts: ["笹木野","赤岩"]},"笹木野": {lines: ["奥羽本線","東北本線"],nexts: ["福島","庭坂"]},"盛岡": {lines: ["東北本線","田沢湖線","山田線"],nexts: ["仙北町"]},"仙北町": {lines: ["東北本線"],nexts: ["岩手飯岡","盛岡"]},"岩手飯岡": {lines: ["東北本線"],nexts: ["矢幅","仙北町"]},"矢幅": {lines: ["東北本線"],nexts: ["古舘","岩手飯岡"]},"古舘": {lines: ["東北本線"],nexts: ["紫波中央","矢幅"]},"紫波中央": {lines: ["東北本線"],nexts: ["日詰","古舘"]},"日詰": {lines: ["東北本線"],nexts: ["石鳥谷","紫波中央"]},"石鳥谷": {lines: ["東北本線"],nexts: ["花巻空港","日詰"]},"花巻空港": {lines: ["東北本線"],nexts: ["花巻","石鳥谷"]},"花巻": {lines: ["東北本線","釜石線"],nexts: ["村崎野","花巻空港"]},"村崎野": {lines: ["東北本線"],nexts: ["北上","花巻"]},"北上": {lines: ["東北本線","北上線"],nexts: ["六原","村崎野"]},"六原": {lines: ["東北本線"],nexts: ["金ヶ崎","北上"]},"金ヶ崎": {lines: ["東北本線"],nexts: ["水沢","六原"]},"水沢": {lines: ["東北本線"],nexts: ["陸中折居","金ヶ崎"]},"陸中折居": {lines: ["東北本線"],nexts: ["前沢","水沢"]},"前沢": {lines: ["東北本線"],nexts: ["平泉","陸中折居"]},"平泉": {lines: ["東北本線"],nexts: ["山ノ目","前沢"]},"山ノ目": {lines: ["東北本線"],nexts: ["一ノ関","平泉"]},"一ノ関": {lines: ["東北本線","大船渡線"],nexts: ["有壁","山ノ目"]},"有壁": {lines: ["東北本線"],nexts: ["清水原","一ノ関"]},"清水原": {lines: ["東北本線"],nexts: ["花泉","有壁"]},"花泉": {lines: ["東北本線"],nexts: ["油島","清水原"]},"油島": {lines: ["東北本線"],nexts: ["石越","花泉"]},"石越": {lines: ["東北本線"],nexts: ["新田","油島"]},"新田": {lines: ["東北本線"],nexts: ["梅ヶ沢","石越"]},"梅ヶ沢": {lines: ["東北本線"],nexts: ["瀬峰","新田"]},"瀬峰": {lines: ["東北本線"],nexts: ["田尻","梅ヶ沢"]},"田尻": {lines: ["東北本線"],nexts: ["小牛田","瀬峰"]},"小牛田": {lines: ["東北本線","陸羽東線","石巻線"],nexts: ["松山町","田尻"]},"松山町": {lines: ["東北本線"],nexts: ["鹿島台","小牛田"]},"鹿島台": {lines: ["東北本線"],nexts: ["品井沼","松山町"]},"品井沼": {lines: ["東北本線"],nexts: ["愛宕","鹿島台"]},"愛宕": {lines: ["東北本線"],nexts: ["松島","品井沼"]},"松島": {lines: ["東北本線"],nexts: ["塩釜","愛宕"]},"塩釜": {lines: ["東北本線","仙石東北ライン"],nexts: ["国府多賀城","松島"]},"国府多賀城": {lines: ["東北本線"],nexts: ["陸前山王","塩釜"]},"陸前山王": {lines: ["東北本線"],nexts: ["岩切","国府多賀城"]},"新利府": {lines: ["東北本線"],nexts: ["岩切","利府"]},"利府": {lines: ["東北本線"],nexts: ["新利府"]},"岩切": {lines: ["東北本線"],nexts: ["東仙台","陸前山王"]},"東仙台": {lines: ["東北本線"],nexts: ["仙台","岩切"]},"仙台": {lines: ["東北本線","仙石線","仙山線"],nexts: ["長町","東仙台"]},"長町": {lines: ["東北本線"],nexts: ["太子堂","仙台"]},"太子堂": {lines: ["東北本線"],nexts: ["南仙台","長町"]},"南仙台": {lines: ["東北本線"],nexts: ["名取","太子堂"]},"名取": {lines: ["東北本線"],nexts: ["館腰","南仙台"]},"館腰": {lines: ["東北本線"],nexts: ["岩沼","名取"]},"岩沼": {lines: ["東北本線","常磐線"],nexts: ["槻木","館腰","逢隈"]},"槻木": {lines: ["東北本線"],nexts: ["船岡","岩沼"]},"船岡": {lines: ["東北本線"],nexts: ["大河原","槻木"]},"大河原": {lines: ["東北本線"],nexts: ["北白川","船岡"]},"北白川": {lines: ["東北本線"],nexts: ["東白石","大河原"]},"東白石": {lines: ["東北本線"],nexts: ["白石","北白川"]},"白石": {lines: ["東北本線"],nexts: ["越河","東白石"]},"越河": {lines: ["東北本線"],nexts: ["貝田","白石"]},"貝田": {lines: ["東北本線"],nexts: ["藤田","越河"]},"藤田": {lines: ["東北本線"],nexts: ["桑折","貝田"]},"桑折": {lines: ["東北本線"],nexts: ["伊達","藤田"]},"伊達": {lines: ["東北本線"],nexts: ["東福島","桑折"]},"東福島": {lines: ["東北本線"],nexts: ["福島","伊達"]},"福島": {lines: ["東北本線","奥羽本線"],nexts: ["南福島","東福島","笹木野"]},"南福島": {lines: ["東北本線"],nexts: ["金谷川","福島"]},"金谷川": {lines: ["東北本線"],nexts: ["松川","南福島"]},"松川": {lines: ["東北本線"],nexts: ["安達","金谷川"]},"安達": {lines: ["東北本線"],nexts: ["二本松","松川"]},"二本松": {lines: ["東北本線"],nexts: ["杉田","安達"]},"杉田": {lines: ["東北本線"],nexts: ["本宮","二本松"]},"本宮": {lines: ["東北本線"],nexts: ["五百川","杉田"]},"五百川": {lines: ["東北本線"],nexts: ["日和田","本宮"]},"日和田": {lines: ["東北本線"],nexts: ["郡山","五百川"]},"郡山": {lines: ["東北本線","磐越西線","磐越東線"],nexts: ["安積永盛","日和田"]},"安積永盛": {lines: ["東北本線","水郡線"],nexts: ["須賀川","郡山"]},"須賀川": {lines: ["東北本線"],nexts: ["鏡石","安積永盛"]},"鏡石": {lines: ["東北本線"],nexts: ["矢吹","須賀川"]},"矢吹": {lines: ["東北本線"],nexts: ["泉崎","鏡石"]},"泉崎": {lines: ["東北本線"],nexts: ["久田野","矢吹"]},"久田野": {lines: ["東北本線"],nexts: ["白河","泉崎"]},"白河": {lines: ["東北本線"],nexts: ["新白河","久田野"]},"新白河": {lines: ["東北本線"],nexts: ["白坂","白河"]},"白坂": {lines: ["東北本線"],nexts: ["豊原","新白河"]},"豊原": {lines: ["東北本線"],nexts: ["黒田原","白坂"]},"黒田原": {lines: ["東北本線"],nexts: ["高久","豊原"]},"高久": {lines: ["東北本線"],nexts: ["黒磯","黒田原"]},"黒磯": {lines: ["東北本線"],nexts: ["那須塩原","高久"]},"那須塩原": {lines: ["東北本線"],nexts: ["西那須野","黒磯"]},"西那須野": {lines: ["東北本線"],nexts: ["野崎","那須塩原"]},"野崎": {lines: ["東北本線"],nexts: ["矢板","西那須野"]},"矢板": {lines: ["東北本線"],nexts: ["片岡","野崎"]},"片岡": {lines: ["東北本線"],nexts: ["蒲須坂","矢板"]},"蒲須坂": {lines: ["東北本線"],nexts: ["氏家","片岡"]},"氏家": {lines: ["東北本線"],nexts: ["宝積寺","蒲須坂"]},"宝積寺": {lines: ["東北本線","烏山線"],nexts: ["岡本","氏家"]},"岡本": {lines: ["東北本線"],nexts: ["宇都宮","宝積寺"]},"宇都宮": {lines: ["東北本線","日光線"],nexts: ["雀宮","岡本"]},"雀宮": {lines: ["東北本線"],nexts: ["石橋","宇都宮"]},"石橋": {lines: ["東北本線"],nexts: ["自治医大","雀宮"]},"自治医大": {lines: ["東北本線"],nexts: ["小金井","石橋"]},"小金井": {lines: ["東北本線"],nexts: ["小山","自治医大"]},"小山": {lines: ["東北本線","両毛線","水戸線"],nexts: ["間々田","小金井"]},"間々田": {lines: ["東北本線"],nexts: ["野木","小山"]},"野木": {lines: ["東北本線"],nexts: ["古河","間々田"]},"古河": {lines: ["東北本線"],nexts: ["栗橋","野木"]},"栗橋": {lines: ["東北本線"],nexts: ["東鷲宮","古河"]},"東鷲宮": {lines: ["東北本線"],nexts: ["久喜","栗橋"]},"久喜": {lines: ["東北本線"],nexts: ["新白岡","東鷲宮"]},"新白岡": {lines: ["東北本線"],nexts: ["白岡","久喜"]},"白岡": {lines: ["東北本線"],nexts: ["蓮田","新白岡"]},"蓮田": {lines: ["東北本線"],nexts: ["東大宮","白岡"]},"東大宮": {lines: ["東北本線"],nexts: ["土呂","蓮田"]},"土呂": {lines: ["東北本線"],nexts: ["大宮","東大宮"]},"大宮": {lines: ["東北本線","高崎線","埼京線","川越線"],nexts: ["さいたま新都心","土呂"]},"さいたま新都心": {lines: ["東北本線"],nexts: ["与野","大宮"]},"与野": {lines: ["東北本線"],nexts: ["北浦和","さいたま新都心"]},"北浦和": {lines: ["東北本線"],nexts: ["浦和","与野"]},"浦和": {lines: ["東北本線"],nexts: ["南浦和","北浦和"]},"南浦和": {lines: ["東北本線","武蔵野線"],nexts: ["蕨","浦和"]},"蕨": {lines: ["東北本線"],nexts: ["西川口","南浦和"]},"西川口": {lines: ["東北本線"],nexts: ["川口","蕨"]},"川口": {lines: ["東北本線"],nexts: ["赤羽","西川口"]},"赤羽": {lines: ["東北本線","埼京線"],nexts: ["東十条","川口","赤羽"]},"東十条": {lines: ["東北本線"],nexts: ["王子","赤羽"]},"王子": {lines: ["東北本線"],nexts: ["上中里","東十条"]},"上中里": {lines: ["東北本線"],nexts: ["田端","王子"]},"田端": {lines: ["東北本線","山手線"],nexts: ["西日暮里","上中里"]},"西日暮里": {lines: ["東北本線","山手線"],nexts: ["日暮里","田端"]},"日暮里": {lines: ["東北本線","常磐線"],nexts: ["鶯谷","西日暮里","三河島"]},"鶯谷": {lines: ["東北本線","山手線"],nexts: ["上野","日暮里"]},"上野": {lines: ["東北本線","山手線"],nexts: ["御徒町","鶯谷","尾久"]},"御徒町": {lines: ["東北本線","山手線"],nexts: ["秋葉原","上野"]},"秋葉原": {lines: ["総武本線"],nexts: ["御茶ノ水","浅草橋"]},"神田": {lines: ["東北本線","中央本線","山手線"],nexts: ["東京","秋葉原","御茶ノ水"]},"尾久": {lines: ["東北本線"],nexts: ["上野","赤羽"]},"秋田": {lines: ["羽越本線","奥羽本線"],nexts: ["羽後牛島","四ツ小屋","土崎"]},"羽後牛島": {lines: ["羽越本線"],nexts: ["新屋","秋田"]},"新屋": {lines: ["羽越本線"],nexts: ["桂根","羽後牛島"]},"桂根": {lines: ["羽越本線"],nexts: ["下浜","新屋"]},"下浜": {lines: ["羽越本線"],nexts: ["道川","桂根"]},"道川": {lines: ["羽越本線"],nexts: ["岩城みなと","下浜"]},"岩城みなと": {lines: ["羽越本線"],nexts: ["羽後亀田","道川"]},"羽後亀田": {lines: ["羽越本線"],nexts: ["折渡","岩城みなと"]},"折渡": {lines: ["羽越本線"],nexts: ["羽後岩谷","羽後亀田"]},"羽後岩谷": {lines: ["羽越本線"],nexts: ["羽後本荘","折渡"]},"羽後本荘": {lines: ["羽越本線"],nexts: ["西目","羽後岩谷"]},"西目": {lines: ["羽越本線"],nexts: ["仁賀保","羽後本荘"]},"仁賀保": {lines: ["羽越本線"],nexts: ["金浦","西目"]},"金浦": {lines: ["羽越本線"],nexts: ["象潟","仁賀保"]},"象潟": {lines: ["羽越本線"],nexts: ["上浜","金浦"]},"上浜": {lines: ["羽越本線"],nexts: ["小砂川","象潟"]},"小砂川": {lines: ["羽越本線"],nexts: ["女鹿","上浜"]},"女鹿": {lines: ["羽越本線"],nexts: ["吹浦","小砂川"]},"吹浦": {lines: ["羽越本線"],nexts: ["遊佐","女鹿"]},"遊佐": {lines: ["羽越本線"],nexts: ["南鳥海","吹浦"]},"南鳥海": {lines: ["羽越本線"],nexts: ["本楯","遊佐"]},"本楯": {lines: ["羽越本線"],nexts: ["酒田","南鳥海"]},"酒田": {lines: ["羽越本線"],nexts: ["東酒田","本楯"]},"東酒田": {lines: ["羽越本線"],nexts: ["砂越","酒田"]},"砂越": {lines: ["羽越本線"],nexts: ["北余目","東酒田"]},"北余目": {lines: ["羽越本線"],nexts: ["余目","砂越"]},"余目": {lines: ["羽越本線","陸羽西線"],nexts: ["西袋","北余目"]},"西袋": {lines: ["羽越本線"],nexts: ["藤島","余目"]},"藤島": {lines: ["羽越本線"],nexts: ["鶴岡","西袋"]},"鶴岡": {lines: ["羽越本線"],nexts: ["羽前大山","藤島"]},"羽前大山": {lines: ["羽越本線"],nexts: ["羽前水沢","鶴岡"]},"羽前水沢": {lines: ["羽越本線"],nexts: ["三瀬","羽前大山"]},"三瀬": {lines: ["羽越本線"],nexts: ["小波渡","羽前水沢"]},"小波渡": {lines: ["羽越本線"],nexts: ["五十川","三瀬"]},"五十川": {lines: ["羽越本線"],nexts: ["あつみ温泉","小波渡"]},"あつみ温泉": {lines: ["羽越本線"],nexts: ["小岩川","五十川"]},"小岩川": {lines: ["羽越本線"],nexts: ["鼠ヶ関","あつみ温泉"]},"鼠ヶ関": {lines: ["羽越本線"],nexts: ["府屋","小岩川"]},"府屋": {lines: ["羽越本線"],nexts: ["勝木","鼠ヶ関"]},"勝木": {lines: ["羽越本線"],nexts: ["越後寒川","府屋"]},"越後寒川": {lines: ["羽越本線"],nexts: ["今川","勝木"]},"今川": {lines: ["羽越本線"],nexts: ["桑川","越後寒川"]},"桑川": {lines: ["羽越本線"],nexts: ["越後早川","今川"]},"越後早川": {lines: ["羽越本線"],nexts: ["間島","桑川"]},"間島": {lines: ["羽越本線"],nexts: ["村上","越後早川"]},"村上": {lines: ["羽越本線"],nexts: ["岩船町","間島"]},"岩船町": {lines: ["羽越本線"],nexts: ["平林","村上"]},"平林": {lines: ["羽越本線"],nexts: ["坂町","岩船町"]},"坂町": {lines: ["羽越本線","米坂線"],nexts: ["平木田","平林"]},"平木田": {lines: ["羽越本線"],nexts: ["中条","坂町"]},"中条": {lines: ["羽越本線"],nexts: ["金塚","平木田"]},"金塚": {lines: ["羽越本線"],nexts: ["加治","中条"]},"加治": {lines: ["羽越本線"],nexts: ["新発田","金塚"]},"新発田": {lines: ["羽越本線","白新線"],nexts: ["中浦","加治"]},"中浦": {lines: ["羽越本線"],nexts: ["月岡","新発田"]},"月岡": {lines: ["羽越本線"],nexts: ["神山","中浦"]},"神山": {lines: ["羽越本線"],nexts: ["水原","月岡"]},"水原": {lines: ["羽越本線"],nexts: ["京ヶ瀬","神山"]},"京ヶ瀬": {lines: ["羽越本線"],nexts: ["新津","水原"]},"新津": {lines: ["羽越本線","信越本線","磐越西線"],nexts: ["京ヶ瀬"]},"三厩": {lines: ["津軽線"],nexts: ["津軽浜名"]},"津軽浜名": {lines: ["津軽線"],nexts: ["今別","三厩"]},"今別": {lines: ["津軽線"],nexts: ["大川平","津軽浜名"]},"大川平": {lines: ["津軽線"],nexts: ["津軽二股","今別"]},"津軽二股": {lines: ["津軽線"],nexts: ["大平","大川平"]},"大平": {lines: ["津軽線"],nexts: ["中小国","津軽二股"]},"中小国": {lines: ["津軽線"],nexts: ["蟹田","大平"]},"蟹田": {lines: ["津軽線"],nexts: ["瀬辺地","中小国"]},"瀬辺地": {lines: ["津軽線"],nexts: ["郷沢","蟹田"]},"郷沢": {lines: ["津軽線"],nexts: ["蓬田","瀬辺地"]},"蓬田": {lines: ["津軽線"],nexts: ["中沢","郷沢"]},"中沢": {lines: ["津軽線"],nexts: ["後潟","蓬田"]},"後潟": {lines: ["津軽線"],nexts: ["左堰","中沢"]},"左堰": {lines: ["津軽線"],nexts: ["奥内","後潟"]},"奥内": {lines: ["津軽線"],nexts: ["津軽宮田","左堰"]},"津軽宮田": {lines: ["津軽線"],nexts: ["油川","奥内"]},"油川": {lines: ["津軽線"],nexts: ["青森","津軽宮田"]},"大湊": {lines: ["大湊線"],nexts: ["下北"]},"下北": {lines: ["大湊線"],nexts: ["赤川","大湊"]},"赤川": {lines: ["大湊線"],nexts: ["金谷沢","下北"]},"金谷沢": {lines: ["大湊線"],nexts: ["近川","赤川"]},"近川": {lines: ["大湊線"],nexts: ["有畑","金谷沢"]},"有畑": {lines: ["大湊線"],nexts: ["陸奥横浜","近川"]},"陸奥横浜": {lines: ["大湊線"],nexts: ["吹越","有畑"]},"吹越": {lines: ["大湊線"],nexts: ["有戸","陸奥横浜"]},"有戸": {lines: ["大湊線"],nexts: ["北野辺地","吹越"]},"北野辺地": {lines: ["大湊線"],nexts: ["野辺地","有戸"]},"野辺地": {lines: ["大湊線"],nexts: ["北野辺地"]},"藤崎": {lines: ["五能線"],nexts: ["林崎","川部"]},"林崎": {lines: ["五能線"],nexts: ["板柳","藤崎"]},"板柳": {lines: ["五能線"],nexts: ["鶴泊","林崎"]},"鶴泊": {lines: ["五能線"],nexts: ["陸奥鶴田","板柳"]},"陸奥鶴田": {lines: ["五能線"],nexts: ["五所川原","鶴泊"]},"五所川原": {lines: ["五能線"],nexts: ["木造","陸奥鶴田"]},"木造": {lines: ["五能線"],nexts: ["中田","五所川原"]},"中田": {lines: ["五能線"],nexts: ["陸奥森田","木造"]},"陸奥森田": {lines: ["五能線"],nexts: ["越水","中田"]},"越水": {lines: ["五能線"],nexts: ["鳴沢","陸奥森田"]},"鳴沢": {lines: ["五能線"],nexts: ["鰺ヶ沢","越水"]},"鰺ヶ沢": {lines: ["五能線"],nexts: ["陸奥赤石","鳴沢"]},"陸奥赤石": {lines: ["五能線"],nexts: ["陸奥柳田","鰺ヶ沢"]},"陸奥柳田": {lines: ["五能線"],nexts: ["北金ヶ沢","陸奥赤石"]},"北金ヶ沢": {lines: ["五能線"],nexts: ["千畳敷","陸奥柳田"]},"千畳敷": {lines: ["五能線"],nexts: ["大戸瀬","北金ヶ沢"]},"大戸瀬": {lines: ["五能線"],nexts: ["風合瀬","千畳敷"]},"風合瀬": {lines: ["五能線"],nexts: ["驫木","大戸瀬"]},"驫木": {lines: ["五能線"],nexts: ["追良瀬","風合瀬"]},"追良瀬": {lines: ["五能線"],nexts: ["広戸","驫木"]},"広戸": {lines: ["五能線"],nexts: ["深浦","追良瀬"]},"深浦": {lines: ["五能線"],nexts: ["横磯","広戸"]},"横磯": {lines: ["五能線"],nexts: ["艫作","深浦"]},"艫作": {lines: ["五能線"],nexts: ["ウェスパ椿山","横磯"]},"ウェスパ椿山": {lines: ["五能線"],nexts: ["陸奥沢辺","艫作"]},"陸奥沢辺": {lines: ["五能線"],nexts: ["陸奥岩崎","ウェスパ椿山"]},"陸奥岩崎": {lines: ["五能線"],nexts: ["十二湖","陸奥沢辺"]},"十二湖": {lines: ["五能線"],nexts: ["松神","陸奥岩崎"]},"松神": {lines: ["五能線"],nexts: ["白神岳登山口","十二湖"]},"白神岳登山口": {lines: ["五能線"],nexts: ["大間越","松神"]},"大間越": {lines: ["五能線"],nexts: ["岩舘","白神岳登山口"]},"岩舘": {lines: ["五能線"],nexts: ["あきた白神","大間越"]},"あきた白神": {lines: ["五能線"],nexts: ["滝ノ間","岩舘"]},"滝ノ間": {lines: ["五能線"],nexts: ["八森","あきた白神"]},"八森": {lines: ["五能線"],nexts: ["東八森","滝ノ間"]},"東八森": {lines: ["五能線"],nexts: ["沢目","八森"]},"沢目": {lines: ["五能線"],nexts: ["鳥形","東八森"]},"鳥形": {lines: ["五能線"],nexts: ["北能代","沢目"]},"北能代": {lines: ["五能線"],nexts: ["向能代","鳥形"]},"向能代": {lines: ["五能線"],nexts: ["能代","北能代"]},"能代": {lines: ["五能線"],nexts: ["東能代","向能代"]},"八戸": {lines: ["八戸線"],nexts: ["長苗代"]},"長苗代": {lines: ["八戸線"],nexts: ["本八戸","八戸"]},"本八戸": {lines: ["八戸線"],nexts: ["小中野","長苗代"]},"小中野": {lines: ["八戸線"],nexts: ["陸奥湊","本八戸"]},"陸奥湊": {lines: ["八戸線"],nexts: ["白銀","小中野"]},"白銀": {lines: ["八戸線"],nexts: ["鮫","陸奥湊"]},"鮫": {lines: ["八戸線"],nexts: ["陸奥白浜","白銀"]},"陸奥白浜": {lines: ["八戸線"],nexts: ["種差海岸","鮫"]},"種差海岸": {lines: ["八戸線"],nexts: ["大久喜","陸奥白浜"]},"大久喜": {lines: ["八戸線"],nexts: ["金浜","種差海岸"]},"金浜": {lines: ["八戸線"],nexts: ["大蛇","大久喜"]},"大蛇": {lines: ["八戸線"],nexts: ["階上","金浜"]},"階上": {lines: ["八戸線"],nexts: ["角の浜","大蛇"]},"角の浜": {lines: ["八戸線"],nexts: ["平内","階上"]},"平内": {lines: ["八戸線"],nexts: ["種市","角の浜"]},"種市": {lines: ["八戸線"],nexts: ["玉川","平内"]},"玉川": {lines: ["八戸線"],nexts: ["宿戸","種市"]},"宿戸": {lines: ["八戸線"],nexts: ["陸中八木","玉川"]},"陸中八木": {lines: ["八戸線"],nexts: ["有家","宿戸"]},"有家": {lines: ["八戸線"],nexts: ["陸中中野","陸中八木"]},"陸中中野": {lines: ["八戸線"],nexts: ["侍浜","有家"]},"侍浜": {lines: ["八戸線"],nexts: ["陸中夏井","陸中中野"]},"陸中夏井": {lines: ["八戸線"],nexts: ["久慈","侍浜"]},"久慈": {lines: ["八戸線"],nexts: ["陸中夏井"]},"銚子": {lines: ["総武本線"],nexts: ["松岸"]},"松岸": {lines: ["総武本線","成田線"],nexts: ["猿田","椎柴","銚子"]},"猿田": {lines: ["総武本線"],nexts: ["倉橋","松岸"]},"倉橋": {lines: ["総武本線"],nexts: ["飯岡","猿田"]},"飯岡": {lines: ["総武本線"],nexts: ["旭","倉橋"]},"旭": {lines: ["総武本線"],nexts: ["干潟","飯岡"]},"干潟": {lines: ["総武本線"],nexts: ["八日市場","旭"]},"八日市場": {lines: ["総武本線"],nexts: ["飯倉","干潟"]},"飯倉": {lines: ["総武本線"],nexts: ["横芝","八日市場"]},"横芝": {lines: ["総武本線"],nexts: ["松尾","飯倉"]},"松尾": {lines: ["総武本線"],nexts: ["成東","横芝"]},"成東": {lines: ["総武本線","東金線"],nexts: ["日向","松尾","求名"]},"日向": {lines: ["総武本線"],nexts: ["八街","成東"]},"八街": {lines: ["総武本線"],nexts: ["榎戸","日向"]},"榎戸": {lines: ["総武本線"],nexts: ["南酒々井","八街"]},"南酒々井": {lines: ["総武本線"],nexts: ["佐倉","榎戸"]},"佐倉": {lines: ["総武本線","成田線"],nexts: ["物井","南酒々井","酒々井"]},"物井": {lines: ["総武本線"],nexts: ["四街道","佐倉"]},"四街道": {lines: ["総武本線"],nexts: ["都賀","物井"]},"都賀": {lines: ["総武本線"],nexts: ["東千葉","四街道"]},"東千葉": {lines: ["総武本線"],nexts: ["千葉","都賀"]},"千葉": {lines: ["総武本線","外房線"],nexts: ["西千葉","東千葉","本千葉"]},"西千葉": {lines: ["総武本線"],nexts: ["稲毛","千葉"]},"稲毛": {lines: ["総武本線"],nexts: ["新検見川","西千葉"]},"新検見川": {lines: ["総武本線"],nexts: ["幕張","稲毛"]},"幕張": {lines: ["総武本線"],nexts: ["幕張本郷","新検見川"]},"幕張本郷": {lines: ["総武本線"],nexts: ["津田沼","幕張"]},"津田沼": {lines: ["総武本線"],nexts: ["東船橋","幕張本郷"]},"東船橋": {lines: ["総武本線"],nexts: ["船橋","津田沼"]},"船橋": {lines: ["総武本線"],nexts: ["西船橋","東船橋"]},"西船橋": {lines: ["総武本線","武蔵野線","京葉線"],nexts: ["下総中山","船橋","船橋法典","市川塩浜","南船橋"]},"下総中山": {lines: ["総武本線"],nexts: ["本八幡","西船橋"]},"本八幡": {lines: ["総武本線"],nexts: ["市川","下総中山"]},"市川": {lines: ["総武本線"],nexts: ["小岩","本八幡"]},"小岩": {lines: ["総武本線"],nexts: ["新小岩","市川"]},"新小岩": {lines: ["総武本線"],nexts: ["平井","小岩"]},"平井": {lines: ["総武本線"],nexts: ["亀戸","新小岩"]},"亀戸": {lines: ["総武本線"],nexts: ["錦糸町","平井"]},"錦糸町": {lines: ["総武本線"],nexts: ["馬喰町","亀戸","両国"]},"馬喰町": {lines: ["総武本線"],nexts: ["新日本橋","錦糸町"]},"新日本橋": {lines: ["総武本線"],nexts: ["東京","馬喰町"]},"両国": {lines: ["総武本線"],nexts: ["浅草橋","錦糸町"]},"浅草橋": {lines: ["総武本線"],nexts: ["秋葉原","両国"]},"御茶ノ水": {lines: ["総武本線"],nexts: ["秋葉原"]},"椎柴": {lines: ["成田線"],nexts: ["下総豊里","松岸"]},"下総豊里": {lines: ["成田線"],nexts: ["下総橘","椎柴"]},"下総橘": {lines: ["成田線"],nexts: ["笹川","下総豊里"]},"笹川": {lines: ["成田線"],nexts: ["小見川","下総橘"]},"小見川": {lines: ["成田線"],nexts: ["水郷","笹川"]},"水郷": {lines: ["成田線"],nexts: ["香取","小見川"]},"香取": {lines: ["成田線","鹿島線"],nexts: ["佐原","水郷","十二橋"]},"佐原": {lines: ["成田線"],nexts: ["大戸","香取"]},"大戸": {lines: ["成田線"],nexts: ["下総神崎","佐原"]},"下総神崎": {lines: ["成田線"],nexts: ["滑河","大戸"]},"滑河": {lines: ["成田線"],nexts: ["久住","下総神崎"]},"久住": {lines: ["成田線"],nexts: ["成田","滑河"]},"成田": {lines: ["成田線"],nexts: ["酒々井","久住","空港第２ビル","下総松崎"]},"酒々井": {lines: ["成田線"],nexts: ["佐倉","成田"]},"空港第２ビル": {lines: ["成田線"],nexts: ["成田空港","成田"]},"成田空港": {lines: ["成田線"],nexts: ["空港第２ビル"]},"下総松崎": {lines: ["成田線"],nexts: ["安食","成田"]},"安食": {lines: ["成田線"],nexts: ["小林","下総松崎"]},"小林": {lines: ["成田線"],nexts: ["木下","安食"]},"木下": {lines: ["成田線"],nexts: ["布佐","小林"]},"布佐": {lines: ["成田線"],nexts: ["新木","木下"]},"新木": {lines: ["成田線"],nexts: ["湖北","布佐"]},"湖北": {lines: ["成田線"],nexts: ["東我孫子","新木"]},"東我孫子": {lines: ["成田線"],nexts: ["我孫子","湖北"]},"安房鴨川": {lines: ["外房線","内房線"],nexts: ["安房天津","太海"]},"安房天津": {lines: ["外房線"],nexts: ["安房小湊","安房鴨川"]},"安房小湊": {lines: ["外房線"],nexts: ["行川アイランド","安房天津"]},"行川アイランド": {lines: ["外房線"],nexts: ["上総興津","安房小湊"]},"上総興津": {lines: ["外房線"],nexts: ["鵜原","行川アイランド"]},"鵜原": {lines: ["外房線"],nexts: ["勝浦","上総興津"]},"勝浦": {lines: ["外房線"],nexts: ["御宿","鵜原"]},"御宿": {lines: ["外房線"],nexts: ["浪花","勝浦"]},"浪花": {lines: ["外房線"],nexts: ["大原","御宿"]},"大原": {lines: ["外房線"],nexts: ["三門","浪花"]},"三門": {lines: ["外房線"],nexts: ["長者町","大原"]},"長者町": {lines: ["外房線"],nexts: ["太東","三門"]},"太東": {lines: ["外房線"],nexts: ["東浪見","長者町"]},"東浪見": {lines: ["外房線"],nexts: ["上総一ノ宮","太東"]},"上総一ノ宮": {lines: ["外房線"],nexts: ["八積","東浪見"]},"八積": {lines: ["外房線"],nexts: ["茂原","上総一ノ宮"]},"茂原": {lines: ["外房線"],nexts: ["新茂原","八積"]},"新茂原": {lines: ["外房線"],nexts: ["本納","茂原"]},"本納": {lines: ["外房線"],nexts: ["永田","新茂原"]},"永田": {lines: ["外房線"],nexts: ["大網","本納"]},"大網": {lines: ["外房線","東金線"],nexts: ["土気","永田","福俵"]},"土気": {lines: ["外房線"],nexts: ["誉田","大網"]},"誉田": {lines: ["外房線"],nexts: ["鎌取","土気"]},"鎌取": {lines: ["外房線"],nexts: ["蘇我","誉田"]},"蘇我": {lines: ["外房線","京葉線"],nexts: ["本千葉","鎌取","浜野","千葉みなと"]},"本千葉": {lines: ["外房線"],nexts: ["千葉","蘇我"]},"求名": {lines: ["東金線"],nexts: ["東金","成東"]},"東金": {lines: ["東金線"],nexts: ["福俵","求名"]},"福俵": {lines: ["東金線"],nexts: ["大網","東金"]},"太海": {lines: ["内房線"],nexts: ["江見","安房鴨川"]},"江見": {lines: ["内房線"],nexts: ["和田浦","太海"]},"和田浦": {lines: ["内房線"],nexts: ["南三原","江見"]},"南三原": {lines: ["内房線"],nexts: ["千歳","和田浦"]},"千歳": {lines: ["内房線"],nexts: ["千倉","南三原"]},"千倉": {lines: ["内房線"],nexts: ["九重","千歳"]},"九重": {lines: ["内房線"],nexts: ["館山","千倉"]},"館山": {lines: ["内房線"],nexts: ["那古船形","九重"]},"那古船形": {lines: ["内房線"],nexts: ["富浦","館山"]},"富浦": {lines: ["内房線"],nexts: ["岩井","那古船形"]},"岩井": {lines: ["内房線"],nexts: ["安房勝山","富浦"]},"安房勝山": {lines: ["内房線"],nexts: ["保田","岩井"]},"保田": {lines: ["内房線"],nexts: ["浜金谷","安房勝山"]},"浜金谷": {lines: ["内房線"],nexts: ["竹岡","保田"]},"竹岡": {lines: ["内房線"],nexts: ["上総湊","浜金谷"]},"上総湊": {lines: ["内房線"],nexts: ["佐貫町","竹岡"]},"佐貫町": {lines: ["内房線"],nexts: ["大貫","上総湊"]},"大貫": {lines: ["内房線"],nexts: ["青堀","佐貫町"]},"青堀": {lines: ["内房線"],nexts: ["君津","大貫"]},"君津": {lines: ["内房線"],nexts: ["木更津","青堀"]},"木更津": {lines: ["内房線","久留里線"],nexts: ["巌根","君津","祇園"]},"巌根": {lines: ["内房線"],nexts: ["袖ヶ浦","木更津"]},"袖ヶ浦": {lines: ["内房線"],nexts: ["長浦","巌根"]},"長浦": {lines: ["内房線"],nexts: ["姉ヶ崎","袖ヶ浦"]},"姉ヶ崎": {lines: ["内房線"],nexts: ["五井","長浦"]},"五井": {lines: ["内房線"],nexts: ["八幡宿","姉ヶ崎"]},"八幡宿": {lines: ["内房線"],nexts: ["浜野","五井"]},"浜野": {lines: ["内房線"],nexts: ["蘇我","八幡宿"]},"上総亀山": {lines: ["久留里線"],nexts: ["上総松丘"]},"上総松丘": {lines: ["久留里線"],nexts: ["平山","上総亀山"]},"平山": {lines: ["久留里線"],nexts: ["久留里","上総松丘"]},"久留里": {lines: ["久留里線"],nexts: ["俵田","平山"]},"俵田": {lines: ["久留里線"],nexts: ["小櫃","久留里"]},"小櫃": {lines: ["久留里線"],nexts: ["下郡","俵田"]},"下郡": {lines: ["久留里線"],nexts: ["馬来田","小櫃"]},"馬来田": {lines: ["久留里線"],nexts: ["東横田","下郡"]},"東横田": {lines: ["久留里線"],nexts: ["横田","馬来田"]},"横田": {lines: ["久留里線"],nexts: ["東清川","東横田"]},"東清川": {lines: ["久留里線"],nexts: ["上総清川","横田"]},"上総清川": {lines: ["久留里線"],nexts: ["祇園","東清川"]},"祇園": {lines: ["久留里線"],nexts: ["木更津","上総清川"]},"鹿島サッカースタジアム": {lines: ["鹿島線"],nexts: ["鹿島神宮"]},"鹿島神宮": {lines: ["鹿島線"],nexts: ["延方","鹿島サッカースタジアム"]},"延方": {lines: ["鹿島線"],nexts: ["潮来","鹿島神宮"]},"潮来": {lines: ["鹿島線"],nexts: ["十二橋","延方"]},"十二橋": {lines: ["鹿島線"],nexts: ["香取","潮来"]},"千葉みなと": {lines: ["京葉線"],nexts: ["稲毛海岸","蘇我"]},"稲毛海岸": {lines: ["京葉線"],nexts: ["検見川浜","千葉みなと"]},"検見川浜": {lines: ["京葉線"],nexts: ["海浜幕張","稲毛海岸"]},"海浜幕張": {lines: ["京葉線"],nexts: ["新習志野","検見川浜"]},"新習志野": {lines: ["京葉線"],nexts: ["南船橋","海浜幕張"]},"南船橋": {lines: ["京葉線"],nexts: ["二俣新町","新習志野","西船橋"]},"二俣新町": {lines: ["京葉線"],nexts: ["市川塩浜","南船橋"]},"市川塩浜": {lines: ["京葉線"],nexts: ["新浦安","二俣新町","西船橋"]},"新浦安": {lines: ["京葉線"],nexts: ["舞浜","市川塩浜"]},"舞浜": {lines: ["京葉線"],nexts: ["葛西臨海公園","新浦安"]},"葛西臨海公園": {lines: ["京葉線"],nexts: ["新木場","舞浜"]},"新木場": {lines: ["京葉線"],nexts: ["潮見","葛西臨海公園"]},"潮見": {lines: ["京葉線"],nexts: ["越中島","新木場"]},"越中島": {lines: ["京葉線"],nexts: ["八丁堀","潮見"]},"八丁堀": {lines: ["京葉線"],nexts: ["東京","越中島"]},"逢隈": {lines: ["常磐線"],nexts: ["亘理"]},"亘理": {lines: ["常磐線"],nexts: ["浜吉田","逢隈"]},"浜吉田": {lines: ["常磐線"],nexts: ["山下","亘理"]},"山下": {lines: ["常磐線"],nexts: ["坂元","浜吉田"]},"坂元": {lines: ["常磐線"],nexts: ["新地","山下"]},"新地": {lines: ["常磐線"],nexts: ["駒ヶ嶺","坂元"]},"駒ヶ嶺": {lines: ["常磐線"],nexts: ["相馬","新地"]},"相馬": {lines: ["常磐線"],nexts: ["日立木","駒ヶ嶺"]},"日立木": {lines: ["常磐線"],nexts: ["鹿島","相馬"]},"鹿島": {lines: ["常磐線"],nexts: ["原ノ町","日立木"]},"原ノ町": {lines: ["常磐線"],nexts: ["磐城太田","鹿島"]},"磐城太田": {lines: ["常磐線"],nexts: ["小高","原ノ町"]},"小高": {lines: ["常磐線"],nexts: ["桃内","磐城太田"]},"桃内": {lines: ["常磐線"],nexts: ["浪江","小高"]},"浪江": {lines: ["常磐線"],nexts: ["双葉","桃内"]},"双葉": {lines: ["常磐線"],nexts: ["大野","浪江"]},"大野": {lines: ["常磐線"],nexts: ["夜ノ森","双葉"]},"夜ノ森": {lines: ["常磐線"],nexts: ["富岡","大野"]},"富岡": {lines: ["常磐線"],nexts: ["竜田","夜ノ森"]},"竜田": {lines: ["常磐線"],nexts: ["木戸","富岡"]},"木戸": {lines: ["常磐線"],nexts: ["Jヴィレッジ","竜田"]},"Jヴィレッジ": {lines: ["常磐線"],nexts: ["広野","木戸"]},"広野": {lines: ["常磐線"],nexts: ["末続","Jヴィレッジ"]},"末続": {lines: ["常磐線"],nexts: ["久ノ浜","広野"]},"久ノ浜": {lines: ["常磐線"],nexts: ["四ツ倉","末続"]},"四ツ倉": {lines: ["常磐線"],nexts: ["草野","久ノ浜"]},"草野": {lines: ["常磐線"],nexts: ["いわき","四ツ倉"]},"いわき": {lines: ["常磐線"],nexts: ["内郷","草野"]},"内郷": {lines: ["常磐線"],nexts: ["湯本","いわき"]},"湯本": {lines: ["常磐線"],nexts: ["泉","内郷"]},"泉": {lines: ["常磐線"],nexts: ["植田","湯本"]},"植田": {lines: ["常磐線"],nexts: ["勿来","泉"]},"勿来": {lines: ["常磐線"],nexts: ["大津港","植田"]},"大津港": {lines: ["常磐線"],nexts: ["磯原","勿来"]},"磯原": {lines: ["常磐線"],nexts: ["南中郷","大津港"]},"南中郷": {lines: ["常磐線"],nexts: ["高萩","磯原"]},"高萩": {lines: ["常磐線"],nexts: ["十王","南中郷"]},"十王": {lines: ["常磐線"],nexts: ["小木津","高萩"]},"小木津": {lines: ["常磐線"],nexts: ["日立","十王"]},"日立": {lines: ["常磐線"],nexts: ["常陸多賀","小木津"]},"常陸多賀": {lines: ["常磐線"],nexts: ["大甕","日立"]},"大甕": {lines: ["常磐線"],nexts: ["東海","常陸多賀"]},"東海": {lines: ["常磐線"],nexts: ["佐和","大甕"]},"佐和": {lines: ["常磐線"],nexts: ["勝田","東海"]},"勝田": {lines: ["常磐線"],nexts: ["水戸","佐和"]},"水戸": {lines: ["常磐線"],nexts: ["偕楽園","勝田"]},"偕楽園": {lines: ["常磐線"],nexts: ["赤塚","水戸"]},"赤塚": {lines: ["常磐線"],nexts: ["内原","偕楽園"]},"内原": {lines: ["常磐線"],nexts: ["友部","赤塚"]},"友部": {lines: ["常磐線"],nexts: ["岩間","内原"],end: true},"岩間": {lines: ["常磐線"],nexts: ["羽鳥","友部"]},"羽鳥": {lines: ["常磐線"],nexts: ["石岡","岩間"]},"石岡": {lines: ["常磐線"],nexts: ["高浜","羽鳥"]},"高浜": {lines: ["常磐線"],nexts: ["神立","石岡"]},"神立": {lines: ["常磐線"],nexts: ["土浦","高浜"]},"土浦": {lines: ["常磐線"],nexts: ["荒川沖","神立"]},"荒川沖": {lines: ["常磐線"],nexts: ["ひたち野うしく","土浦"]},"ひたち野うしく": {lines: ["常磐線"],nexts: ["牛久","荒川沖"]},"牛久": {lines: ["常磐線"],nexts: ["龍ケ崎市","ひたち野うしく"]},"龍ケ崎市": {lines: ["常磐線"],nexts: ["藤代","牛久"]},"藤代": {lines: ["常磐線"],nexts: ["取手","龍ケ崎市"]},"取手": {lines: ["常磐線"],nexts: ["天王台","藤代"]},"天王台": {lines: ["常磐線"],nexts: ["我孫子","取手"]},"我孫子": {lines: ["常磐線","成田線"],nexts: ["北柏","天王台","東我孫子"]},"北柏": {lines: ["常磐線"],nexts: ["柏","我孫子"]},"柏": {lines: ["常磐線"],nexts: ["南柏","北柏"]},"南柏": {lines: ["常磐線"],nexts: ["北小金","柏"]},"北小金": {lines: ["常磐線"],nexts: ["新松戸","南柏"]},"新松戸": {lines: ["常磐線","武蔵野線"],nexts: ["馬橋","北小金","南流山","新八柱"]},"馬橋": {lines: ["常磐線"],nexts: ["北松戸","新松戸"]},"北松戸": {lines: ["常磐線"],nexts: ["松戸","馬橋"]},"松戸": {lines: ["常磐線"],nexts: ["金町","北松戸"]},"金町": {lines: ["常磐線"],nexts: ["亀有","松戸"]},"亀有": {lines: ["常磐線"],nexts: ["綾瀬","金町"]},"綾瀬": {lines: ["常磐線"],nexts: ["北千住","亀有"]},"北千住": {lines: ["常磐線"],nexts: ["南千住","綾瀬"]},"南千住": {lines: ["常磐線"],nexts: ["三河島","北千住"]},"三河島": {lines: ["常磐線"],nexts: ["南千住"]},"船橋法典": {lines: ["武蔵野線"],nexts: ["市川大野","西船橋"]},"市川大野": {lines: ["武蔵野線"],nexts: ["東松戸","船橋法典"]},"東松戸": {lines: ["武蔵野線"],nexts: ["新八柱","市川大野"]},"新八柱": {lines: ["武蔵野線"],nexts: ["新松戸","東松戸"]},"南流山": {lines: ["武蔵野線"],nexts: ["新松戸"]},"東京": {lines: ["東海道本線","東北本線","京葉線","山手線","総武本線"],nexts: ["有楽町","神田","新日本橋","八丁堀"]}};
        
        _thread.retVal=_this;return;
      },
      __dummy: false
    };
  },
  decls: {"methods":{"main":{"nowait":false}},"fields":{}}
});
Tonyu.klass.define({
  fullName: 'user.Main',
  shortName: 'Main',
  namespace: 'user',
  superclass: Tonyu.classes.kernel.Actor,
  includes: [],
  methods: function (__superClass) {
    return {
      main :function _trc_Main_main() {
        "use strict";
        var _this=this;
        var _it_159;
        
        //$LASTPOS=2000029;//user.Main:29
        new Tonyu.classes.user.Lines;
        //$LASTPOS=2000050;//user.Main:50
        _this.update();
        //$LASTPOS=2000060;//user.Main:60
        new Tonyu.classes.user.StationPlace;
        //$LASTPOS=2000089;//user.Main:89
        _this.update();
        //$LASTPOS=2000099;//user.Main:99
        new Tonyu.classes.user.MapScroll;
        //$LASTPOS=2000115;//user.Main:115
        Tonyu.globals.$search=new Tonyu.classes.kernel.Button({top: 10,left: 300,width: 150,height: 30,text: "路線の検索"});
        //$LASTPOS=2000188;//user.Main:188
        Tonyu.globals.$owner={};
        //$LASTPOS=2000199;//user.Main:199
        Tonyu.globals.$turn=1;
        //$LASTPOS=2000210;//user.Main:210
        Tonyu.globals.$red=0;
        //$LASTPOS=2000218;//user.Main:218
        Tonyu.globals.$blue=0;
        //$LASTPOS=2000379;//user.Main:379
        //$LASTPOS=2000383;//user.Main:383
        _this.i=0;for (; _this.i<Tonyu.globals.$stationPlace.length ; _this.i++) {
          Tonyu.checkLoop();
          {
            //$LASTPOS=2000429;//user.Main:429
            _this.sta=new Tonyu.classes.kernel.Button({left: Tonyu.globals.$stationPlace[_this.i].x,top: Tonyu.globals.$stationPlace[_this.i].y,width: 40,height: 30,text: Tonyu.globals.$stationPlace[_this.i].name,layer: Tonyu.globals.$mainLayer,onClick: Tonyu.bindFunc(_this,_this.clicked)});
            //$LASTPOS=2000583;//user.Main:583
            _this.update();
          }
        }
        //$LASTPOS=2000596;//user.Main:596
        Tonyu.globals.$name2Node={};
        //$LASTPOS=2000611;//user.Main:611
        _it_159=Tonyu.iterator(Tonyu.globals.$stationPlace,1);
        while(_it_159.next()) {
          _this.stationPlace=_it_159[0];
          
          //$LASTPOS=2000653;//user.Main:653
          Tonyu.globals.$name2Node[_this.stationPlace.name]=new Tonyu.classes.user.Node({name: _this.stationPlace.name,x: _this.stationPlace.x,y: _this.stationPlace.y});
          
        }
        //$LASTPOS=2002840;//user.Main:2840
        if (Tonyu.globals.$search&&Tonyu.globals.$search.clicked==1) {
          //$LASTPOS=2002879;//user.Main:2879
          Tonyu.globals.$InputBox.open("路線名の入力");
          
        }
      },
      fiber$main :function _trc_Main_f_main(_thread) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        var _it_159;
        
        //$LASTPOS=2000029;//user.Main:29
        new Tonyu.classes.user.Lines;
        
        _thread.enter(function _trc_Main_ent_main(_thread) {
          if (_thread.lastEx) __pc=_thread.catchPC;
          for(var __cnt=100 ; __cnt--;) {
            switch (__pc) {
            case 0:
              //$LASTPOS=2000050;//user.Main:50
              _this.fiber$update(_thread);
              __pc=1;return;
            case 1:
              
              //$LASTPOS=2000060;//user.Main:60
              new Tonyu.classes.user.StationPlace;
              //$LASTPOS=2000089;//user.Main:89
              _this.fiber$update(_thread);
              __pc=2;return;
            case 2:
              
              //$LASTPOS=2000099;//user.Main:99
              new Tonyu.classes.user.MapScroll;
              //$LASTPOS=2000115;//user.Main:115
              Tonyu.globals.$search=new Tonyu.classes.kernel.Button({top: 10,left: 300,width: 150,height: 30,text: "路線の検索"});
              //$LASTPOS=2000188;//user.Main:188
              Tonyu.globals.$owner={};
              //$LASTPOS=2000199;//user.Main:199
              Tonyu.globals.$turn=1;
              //$LASTPOS=2000210;//user.Main:210
              Tonyu.globals.$red=0;
              //$LASTPOS=2000218;//user.Main:218
              Tonyu.globals.$blue=0;
              //$LASTPOS=2000379;//user.Main:379
              //$LASTPOS=2000383;//user.Main:383
              _this.i=0;
            case 3:
              if (!(_this.i<Tonyu.globals.$stationPlace.length)) { __pc=6     ; break; }
              //$LASTPOS=2000429;//user.Main:429
              _this.sta=new Tonyu.classes.kernel.Button({left: Tonyu.globals.$stationPlace[_this.i].x,top: Tonyu.globals.$stationPlace[_this.i].y,width: 40,height: 30,text: Tonyu.globals.$stationPlace[_this.i].name,layer: Tonyu.globals.$mainLayer,onClick: Tonyu.bindFunc(_this,_this.clicked)});
              //$LASTPOS=2000583;//user.Main:583
              _this.fiber$update(_thread);
              __pc=4;return;
            case 4:
              
            case 5     :
              _this.i++;
              __pc=3;break;
            case 6     :
              
              //$LASTPOS=2000596;//user.Main:596
              Tonyu.globals.$name2Node={};
              //$LASTPOS=2000611;//user.Main:611
              _it_159=Tonyu.iterator(Tonyu.globals.$stationPlace,1);
              while(_it_159.next()) {
                _this.stationPlace=_it_159[0];
                
                //$LASTPOS=2000653;//user.Main:653
                Tonyu.globals.$name2Node[_this.stationPlace.name]=new Tonyu.classes.user.Node({name: _this.stationPlace.name,x: _this.stationPlace.x,y: _this.stationPlace.y});
                
              }
              //$LASTPOS=2002840;//user.Main:2840
              if (Tonyu.globals.$search&&Tonyu.globals.$search.clicked==1) {
                //$LASTPOS=2002879;//user.Main:2879
                Tonyu.globals.$InputBox.open("路線名の入力");
                
              }
              _thread.exit(_this);return;
            }
          }
        });
      },
      clicked :function _trc_Main_clicked(b) {
        "use strict";
        var _this=this;
        
        //$LASTPOS=2000785;//user.Main:785
        if (! Tonyu.globals.$owner[b.text]) {
          //$LASTPOS=2000835;//user.Main:835
          Tonyu.globals.$owner[b.text]={name: b.text,owner: Tonyu.globals.$turn};
          //$LASTPOS=2000965;//user.Main:965
          _this.s=new Tonyu.classes.user.Searcher({from: Tonyu.globals.$name2Node[b.text],to: Tonyu.globals.$name2Node["東京"],path: new Tonyu.classes.user.Path});
          //$LASTPOS=2001050;//user.Main:1050
          _this.fillStyle="cyan";
          //$LASTPOS=2001076;//user.Main:1076
          _this.s.on("result",(function anonymous_1091(paths) {
            var path;
            var _it_162;
            
            //$LASTPOS=2001114;//user.Main:1114
            _it_162=Tonyu.iterator(paths,1);
            while(_it_162.next()) {
              path=_it_162[0];
              
              //$LASTPOS=2001156;//user.Main:1156
              _this.print(path.toString());
              
            }
          }));
          //$LASTPOS=2001213;//user.Main:1213
          Tonyu.globals.$from=null;
          //$LASTPOS=2001251;//user.Main:1251
          if (Tonyu.globals.$turn==1) {
            //$LASTPOS=2001277;//user.Main:1277
            b.fillStyle=new Tonyu.classes.kernel.Color(255,0,0);
            
          } else {
            //$LASTPOS=2001336;//user.Main:1336
            b.fillStyle=new Tonyu.classes.kernel.Color(0,0,255);
            
          }
          //$LASTPOS=2001395;//user.Main:1395
          _this.lines=Tonyu.globals.$stations[b.text].lines;
          //$LASTPOS=2001436;//user.Main:1436
          _this.count=_this.lines.length;
          
        }
      },
      fiber$clicked :function _trc_Main_f_clicked(_thread,b) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        
        //$LASTPOS=2000785;//user.Main:785
        if (! Tonyu.globals.$owner[b.text]) {
          //$LASTPOS=2000835;//user.Main:835
          Tonyu.globals.$owner[b.text]={name: b.text,owner: Tonyu.globals.$turn};
          //$LASTPOS=2000965;//user.Main:965
          _this.s=new Tonyu.classes.user.Searcher({from: Tonyu.globals.$name2Node[b.text],to: Tonyu.globals.$name2Node["東京"],path: new Tonyu.classes.user.Path});
          //$LASTPOS=2001050;//user.Main:1050
          _this.fillStyle="cyan";
          //$LASTPOS=2001076;//user.Main:1076
          _this.s.on("result",(function anonymous_1091(paths) {
            var path;
            var _it_162;
            
            //$LASTPOS=2001114;//user.Main:1114
            _it_162=Tonyu.iterator(paths,1);
            while(_it_162.next()) {
              path=_it_162[0];
              
              //$LASTPOS=2001156;//user.Main:1156
              _this.print(path.toString());
              
            }
          }));
          //$LASTPOS=2001213;//user.Main:1213
          Tonyu.globals.$from=null;
          //$LASTPOS=2001251;//user.Main:1251
          if (Tonyu.globals.$turn==1) {
            //$LASTPOS=2001277;//user.Main:1277
            b.fillStyle=new Tonyu.classes.kernel.Color(255,0,0);
            
          } else {
            //$LASTPOS=2001336;//user.Main:1336
            b.fillStyle=new Tonyu.classes.kernel.Color(0,0,255);
            
          }
          //$LASTPOS=2001395;//user.Main:1395
          _this.lines=Tonyu.globals.$stations[b.text].lines;
          //$LASTPOS=2001436;//user.Main:1436
          _this.count=_this.lines.length;
          
        }
        
        _thread.retVal=_this;return;
      },
      colorCount :function _trc_Main_colorCount(s) {
        "use strict";
        var _this=this;
        var s;
        var _it_165;
        
        //$LASTPOS=2002686;//user.Main:2686
        Tonyu.globals.$red=0;
        //$LASTPOS=2002698;//user.Main:2698
        Tonyu.globals.$blue=0;
        //$LASTPOS=2002711;//user.Main:2711
        _it_165=Tonyu.iterator(Tonyu.globals.$owner,1);
        while(_it_165.next()) {
          s=_it_165[0];
          
          //$LASTPOS=2002741;//user.Main:2741
          if (Tonyu.globals.$owner[s].owner==1) {
            //$LASTPOS=2002777;//user.Main:2777
            Tonyu.globals.$red++;
            
          } else {
            //$LASTPOS=2002812;//user.Main:2812
            Tonyu.globals.$blue++;
            
          }
          
        }
      },
      fiber$colorCount :function _trc_Main_f_colorCount(_thread,s) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        var s;
        var _it_165;
        
        //$LASTPOS=2002686;//user.Main:2686
        Tonyu.globals.$red=0;
        //$LASTPOS=2002698;//user.Main:2698
        Tonyu.globals.$blue=0;
        //$LASTPOS=2002711;//user.Main:2711
        _it_165=Tonyu.iterator(Tonyu.globals.$owner,1);
        while(_it_165.next()) {
          s=_it_165[0];
          
          //$LASTPOS=2002741;//user.Main:2741
          if (Tonyu.globals.$owner[s].owner==1) {
            //$LASTPOS=2002777;//user.Main:2777
            Tonyu.globals.$red++;
            
          } else {
            //$LASTPOS=2002812;//user.Main:2812
            Tonyu.globals.$blue++;
            
          }
          
        }
        
        _thread.retVal=_this;return;
      },
      __dummy: false
    };
  },
  decls: {"methods":{"main":{"nowait":false},"clicked":{"nowait":false},"colorCount":{"nowait":false}},"fields":{"i":{},"sta":{},"stationPlace":{},"s":{},"lines":{},"count":{}}}
});
Tonyu.klass.define({
  fullName: 'user.MapScroll',
  shortName: 'MapScroll',
  namespace: 'user',
  superclass: Tonyu.classes.kernel.Actor,
  includes: [],
  methods: function (__superClass) {
    return {
      main :function _trc_MapScroll_main() {
        "use strict";
        var _this=this;
        
        //$LASTPOS=3000000;//user.MapScroll:0
        _this.x=0;
        //$LASTPOS=3000005;//user.MapScroll:5
        _this.y=0;
        //$LASTPOS=3000010;//user.MapScroll:10
        _this.scale=1;
        //$LASTPOS=3000019;//user.MapScroll:19
        _this.alpha=0;
        //$LASTPOS=3000028;//user.MapScroll:28
        Tonyu.globals.$Screen.setPivot(Tonyu.globals.$screenWidth/2,Tonyu.globals.$screenHeight/2);
        //$LASTPOS=3000078;//user.MapScroll:78
        while (true) {
          Tonyu.checkLoop();
          //$LASTPOS=3000095;//user.MapScroll:95
          Tonyu.globals.$Screen.scrollTo(_this.x,_this.y,_this.scale);
          //$LASTPOS=3000128;//user.MapScroll:128
          if (_this.getkey("right")>0) {
            //$LASTPOS=3000159;//user.MapScroll:159
            _this.x+=3;
            
          }
          //$LASTPOS=3000175;//user.MapScroll:175
          if (_this.getkey("left")>0) {
            //$LASTPOS=3000205;//user.MapScroll:205
            _this.x-=3;
            
          }
          //$LASTPOS=3000221;//user.MapScroll:221
          if (_this.getkey("down")>0) {
            //$LASTPOS=3000251;//user.MapScroll:251
            _this.y+=3;
            
          }
          //$LASTPOS=3000267;//user.MapScroll:267
          if (_this.getkey("up")>0) {
            //$LASTPOS=3000295;//user.MapScroll:295
            _this.y-=3;
            
          }
          //$LASTPOS=3000311;//user.MapScroll:311
          if (_this.getkey("a")==1) {
            //$LASTPOS=3000339;//user.MapScroll:339
            _this.scale+=0.05;
            
          }
          //$LASTPOS=3000362;//user.MapScroll:362
          if (_this.getkey("b")==1) {
            //$LASTPOS=3000390;//user.MapScroll:390
            _this.scale-=0.05;
            //$LASTPOS=3000411;//user.MapScroll:411
            if (_this.scale<0) {
              //$LASTPOS=3000436;//user.MapScroll:436
              _this.scale=1;
              
            }
            
          }
          //$LASTPOS=3000465;//user.MapScroll:465
          _this.update();
          
        }
      },
      fiber$main :function _trc_MapScroll_f_main(_thread) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        
        //$LASTPOS=3000000;//user.MapScroll:0
        _this.x=0;
        //$LASTPOS=3000005;//user.MapScroll:5
        _this.y=0;
        //$LASTPOS=3000010;//user.MapScroll:10
        _this.scale=1;
        //$LASTPOS=3000019;//user.MapScroll:19
        _this.alpha=0;
        //$LASTPOS=3000028;//user.MapScroll:28
        Tonyu.globals.$Screen.setPivot(Tonyu.globals.$screenWidth/2,Tonyu.globals.$screenHeight/2);
        
        _thread.enter(function _trc_MapScroll_ent_main(_thread) {
          if (_thread.lastEx) __pc=_thread.catchPC;
          for(var __cnt=100 ; __cnt--;) {
            switch (__pc) {
            case 0:
              //$LASTPOS=3000078;//user.MapScroll:78
            case 1:
              //$LASTPOS=3000095;//user.MapScroll:95
              Tonyu.globals.$Screen.scrollTo(_this.x,_this.y,_this.scale);
              //$LASTPOS=3000128;//user.MapScroll:128
              if (_this.getkey("right")>0) {
                //$LASTPOS=3000159;//user.MapScroll:159
                _this.x+=3;
                
              }
              //$LASTPOS=3000175;//user.MapScroll:175
              if (_this.getkey("left")>0) {
                //$LASTPOS=3000205;//user.MapScroll:205
                _this.x-=3;
                
              }
              //$LASTPOS=3000221;//user.MapScroll:221
              if (_this.getkey("down")>0) {
                //$LASTPOS=3000251;//user.MapScroll:251
                _this.y+=3;
                
              }
              //$LASTPOS=3000267;//user.MapScroll:267
              if (_this.getkey("up")>0) {
                //$LASTPOS=3000295;//user.MapScroll:295
                _this.y-=3;
                
              }
              //$LASTPOS=3000311;//user.MapScroll:311
              if (_this.getkey("a")==1) {
                //$LASTPOS=3000339;//user.MapScroll:339
                _this.scale+=0.05;
                
              }
              //$LASTPOS=3000362;//user.MapScroll:362
              if (_this.getkey("b")==1) {
                //$LASTPOS=3000390;//user.MapScroll:390
                _this.scale-=0.05;
                //$LASTPOS=3000411;//user.MapScroll:411
                if (_this.scale<0) {
                  //$LASTPOS=3000436;//user.MapScroll:436
                  _this.scale=1;
                  
                }
                
              }
              //$LASTPOS=3000465;//user.MapScroll:465
              _this.fiber$update(_thread);
              __pc=2;return;
            case 2:
              
              __pc=1;break;
            case 3     :
              
              _thread.exit(_this);return;
            }
          }
        });
      },
      __dummy: false
    };
  },
  decls: {"methods":{"main":{"nowait":false}},"fields":{"scale":{}}}
});
Tonyu.klass.define({
  fullName: 'user.Node',
  shortName: 'Node',
  namespace: 'user',
  superclass: Tonyu.classes.kernel.Actor,
  includes: [],
  methods: function (__superClass) {
    return {
      main :function _trc_Node_main() {
        "use strict";
        var _this=this;
        
        //$LASTPOS=4000390;//user.Node:390
        _this.alpha=0;
      },
      fiber$main :function _trc_Node_f_main(_thread) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        
        //$LASTPOS=4000390;//user.Node:390
        _this.alpha=0;
        
        _thread.retVal=_this;return;
      },
      allConnected :function _trc_Node_allConnected() {
        "use strict";
        var _this=this;
        var list;
        var _it_171;
        
        //$LASTPOS=4000029;//user.Node:29
        list = [];
        
        //$LASTPOS=4000046;//user.Node:46
        _it_171=Tonyu.iterator(_this.all(Tonyu.classes.user.Node),1);
        while(_it_171.next()) {
          _this.n=_it_171[0];
          
          //$LASTPOS=4000075;//user.Node:75
          if (_this.isConnected(_this.n)) {
            //$LASTPOS=4000107;//user.Node:107
            list.push(_this.n);
            
          }
          
        }
        return list;
      },
      fiber$allConnected :function _trc_Node_f_allConnected(_thread) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        var list;
        var _it_171;
        
        //$LASTPOS=4000029;//user.Node:29
        list = [];
        
        //$LASTPOS=4000046;//user.Node:46
        _it_171=Tonyu.iterator(_this.all(Tonyu.classes.user.Node),1);
        while(_it_171.next()) {
          _this.n=_it_171[0];
          
          //$LASTPOS=4000075;//user.Node:75
          if (_this.isConnected(_this.n)) {
            //$LASTPOS=4000107;//user.Node:107
            list.push(_this.n);
            
          }
          
        }
        _thread.retVal=list;return;
        
        
        _thread.retVal=_this;return;
      },
      isConnected :function _trc_Node_isConnected(n) {
        "use strict";
        var _this=this;
        
        //$LASTPOS=4000262;//user.Node:262
        if (Tonyu.globals.$stations[_this.name].nexts.indexOf(n.name)>- 1) {
          return true;
          
        }
      },
      fiber$isConnected :function _trc_Node_f_isConnected(_thread,n) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        
        //$LASTPOS=4000262;//user.Node:262
        if (Tonyu.globals.$stations[_this.name].nexts.indexOf(n.name)>- 1) {
          _thread.retVal=true;return;
          
          
        }
        
        _thread.retVal=_this;return;
      },
      __dummy: false
    };
  },
  decls: {"methods":{"main":{"nowait":false},"allConnected":{"nowait":false},"isConnected":{"nowait":false}},"fields":{"n":{},"name":{}}}
});
Tonyu.klass.define({
  fullName: 'user.Path',
  shortName: 'Path',
  namespace: 'user',
  superclass: Tonyu.classes.kernel.Actor,
  includes: [],
  methods: function (__superClass) {
    return {
      main :function _trc_Path_main() {
        "use strict";
        var _this=this;
        
      },
      fiber$main :function _trc_Path_f_main(_thread) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        
        
        _thread.retVal=_this;return;
      },
      initialize :function _trc_Path_initialize(p) {
        "use strict";
        var _this=this;
        
        //$LASTPOS=5000013;//user.Path:13
        __superClass.apply( _this, [p]);
        //$LASTPOS=5000027;//user.Path:27
        _this.nodes=_this.nodes||[];
        //$LASTPOS=5000048;//user.Path:48
        _this.strokeStyle=_this.strokeStyle||new Tonyu.classes.kernel.Color({h: _this.rnd(360),s: 1,l: 0.5});
      },
      draw :function _trc_Path_draw(ctx) {
        "use strict";
        var _this=this;
        var first;
        var node;
        var _it_18;
        
        //$LASTPOS=5000127;//user.Path:127
        first = true;
        
        //$LASTPOS=5000147;//user.Path:147
        ctx.strokeStyle=_this.strokeStyle+"";
        //$LASTPOS=5000183;//user.Path:183
        ctx.lineWidth=2;
        //$LASTPOS=5000204;//user.Path:204
        ctx.beginPath();
        //$LASTPOS=5000225;//user.Path:225
        _it_18=Tonyu.iterator(_this.nodes,1);
        while(_it_18.next()) {
          node=_it_18[0];
          
          //$LASTPOS=5000258;//user.Path:258
          if (first) {
            //$LASTPOS=5000269;//user.Path:269
            ctx.moveTo(node.x,node.y);
          } else {
            //$LASTPOS=5000309;//user.Path:309
            ctx.lineTo(node.x+_this.rnd(- 5,5),node.y+_this.rnd(- 5,5));
          }
          //$LASTPOS=5000364;//user.Path:364
          first=false;
          
        }
        //$LASTPOS=5000387;//user.Path:387
        ctx.stroke();
      },
      add :function _trc_Path_add(node) {
        "use strict";
        var _this=this;
        
        //$LASTPOS=5000420;//user.Path:420
        _this.nodes.push(node);
      },
      fiber$add :function _trc_Path_f_add(_thread,node) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        
        //$LASTPOS=5000420;//user.Path:420
        _this.nodes.push(node);
        
        _thread.retVal=_this;return;
      },
      contains :function _trc_Path_contains(node) {
        "use strict";
        var _this=this;
        
        return _this.nodes.indexOf(node)>=0;
      },
      fiber$contains :function _trc_Path_f_contains(_thread,node) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        
        _thread.retVal=_this.nodes.indexOf(node)>=0;return;
        
        
        _thread.retVal=_this;return;
      },
      clone :function _trc_Path_clone() {
        "use strict";
        var _this=this;
        
        return new Tonyu.classes.user.Path({nodes: _this.nodes.slice()});
      },
      fiber$clone :function _trc_Path_f_clone(_thread) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        
        _thread.retVal=new Tonyu.classes.user.Path({nodes: _this.nodes.slice()});return;
        
        
        _thread.retVal=_this;return;
      },
      toString :function _trc_Path_toString() {
        "use strict";
        var _this=this;
        
        return _this.nodes.map((function anonymous_585(node) {
          
          return node+"";
        })).join("->");
      },
      fiber$toString :function _trc_Path_f_toString(_thread) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        
        _thread.retVal=_this.nodes.map((function anonymous_585(node) {
          
          return node+"";
        })).join("->");return;
        
        
        _thread.retVal=_this;return;
      },
      __dummy: false
    };
  },
  decls: {"methods":{"main":{"nowait":false},"new":{"nowait":false},"draw":{"nowait":true},"add":{"nowait":false},"contains":{"nowait":false},"clone":{"nowait":false},"toString":{"nowait":false}},"fields":{"nodes":{},"strokeStyle":{}}}
});
Tonyu.klass.define({
  fullName: 'user.Search',
  shortName: 'Search',
  namespace: 'user',
  superclass: Tonyu.classes.kernel.Actor,
  includes: [],
  methods: function (__superClass) {
    return {
      main :function _trc_Search_main() {
        "use strict";
        var _this=this;
        
        //$LASTPOS=6003051;//user.Search:3051
        Tonyu.globals.$p=0;
        //$LASTPOS=6003990;//user.Search:3990
        _this.s=_this.stationName;
        //$LASTPOS=6004021;//user.Search:4021
        _this.so=(_this.searchOwner(_this.stationName));
        //$LASTPOS=6004072;//user.Search:4072
        Tonyu.globals.$point=0;
        //$LASTPOS=6004104;//user.Search:4104
        _this.print("");
        //$LASTPOS=6004116;//user.Search:4116
        //$LASTPOS=6004120;//user.Search:4120
        _this.i=0;for (; _this.i<50 ; _this.i++) {
          Tonyu.checkLoop();
          {
            //$LASTPOS=6004172;//user.Search:4172
            _this.end=(_this.isTerminal(_this.stationName));
            //$LASTPOS=6004209;//user.Search:4209
            if (_this.end==1) {
              //$LASTPOS=6004239;//user.Search:4239
              if (Tonyu.globals.$point!=0&&_this.savestation.length!=Tonyu.globals.$point) {
                //$LASTPOS=6004300;//user.Search:4300
                _this.stationName=_this.savestation[Tonyu.globals.$point];
                //$LASTPOS=6004347;//user.Search:4347
                Tonyu.globals.$point++;
                continue;
                
                
              }
              break;
              
              
            }
            //$LASTPOS=6004467;//user.Search:4467
            _this.sta=(_this.searchNextStation(_this.stationName,0));
            //$LASTPOS=6004513;//user.Search:4513
            _this.array = Array.isArray(_this.sta);
            
            //$LASTPOS=6004549;//user.Search:4549
            if (_this.array==false) {
              //$LASTPOS=6004577;//user.Search:4577
              _this.a=(_this.searchOwner(_this.sta));
              //$LASTPOS=6004609;//user.Search:4609
              if (_this.a==_this.so) {
                //$LASTPOS=6004634;//user.Search:4634
                _this.o=(_this.updateOwner(_this.s,_this.sta,0));
                break;
                
                
              }
              //$LASTPOS=6004699;//user.Search:4699
              _this.stationName=_this.sta;
              
            } else {
              //$LASTPOS=6004737;//user.Search:4737
              _this.savestation=_this.sta;
              //$LASTPOS=6004781;//user.Search:4781
              _this.stationName=_this.savestation[Tonyu.globals.$point];
              //$LASTPOS=6004824;//user.Search:4824
              Tonyu.globals.$point++;
              
            }
          }
        }
        //$LASTPOS=6004861;//user.Search:4861
        _this.print("");
        //$LASTPOS=6004872;//user.Search:4872
        _this.stationName=_this.s;
        //$LASTPOS=6004923;//user.Search:4923
        //$LASTPOS=6004927;//user.Search:4927
        _this.i=0;for (; _this.i<5 ; _this.i++) {
          Tonyu.checkLoop();
          {
            //$LASTPOS=6004952;//user.Search:4952
            _this.end=(_this.isTerminal(_this.stationName));
            //$LASTPOS=6004989;//user.Search:4989
            if (_this.end==2) {
              //$LASTPOS=6005019;//user.Search:5019
              if (Tonyu.globals.$point!=0&&_this.savestation.length!=Tonyu.globals.$point) {
                //$LASTPOS=6005080;//user.Search:5080
                _this.stationName=_this.savestation[Tonyu.globals.$point];
                //$LASTPOS=6005127;//user.Search:5127
                Tonyu.globals.$point++;
                continue;
                
                
              }
              break;
              
              
            }
            //$LASTPOS=6005242;//user.Search:5242
            _this.sta=(_this.searchNextStation(_this.stationName,1));
            //$LASTPOS=6005288;//user.Search:5288
            _this.array = Array.isArray(_this.sta);
            
            //$LASTPOS=6005324;//user.Search:5324
            if (_this.array==false) {
              //$LASTPOS=6005361;//user.Search:5361
              _this.a=(_this.searchOwner(_this.sta));
              //$LASTPOS=6005393;//user.Search:5393
              if (_this.a==_this.so) {
                //$LASTPOS=6005418;//user.Search:5418
                _this.o=(_this.updateOwner(_this.s,_this.sta,1));
                break;
                
                
              }
              //$LASTPOS=6005483;//user.Search:5483
              _this.stationName=_this.sta;
              
            } else {
              //$LASTPOS=6005521;//user.Search:5521
              _this.savestation=_this.sta;
              //$LASTPOS=6005565;//user.Search:5565
              _this.stationName=_this.savestation[Tonyu.globals.$point];
              //$LASTPOS=6005608;//user.Search:5608
              Tonyu.globals.$point++;
              
            }
          }
        }
        //$LASTPOS=6005629;//user.Search:5629
        _this.fireEvent("complete");
      },
      fiber$main :function _trc_Search_f_main(_thread) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        
        //$LASTPOS=6003051;//user.Search:3051
        Tonyu.globals.$p=0;
        //$LASTPOS=6003990;//user.Search:3990
        _this.s=_this.stationName;
        //$LASTPOS=6004021;//user.Search:4021
        _this.so=(_this.searchOwner(_this.stationName));
        //$LASTPOS=6004072;//user.Search:4072
        Tonyu.globals.$point=0;
        //$LASTPOS=6004104;//user.Search:4104
        _this.print("");
        //$LASTPOS=6004116;//user.Search:4116
        //$LASTPOS=6004120;//user.Search:4120
        _this.i=0;for (; _this.i<50 ; _this.i++) {
          Tonyu.checkLoop();
          {
            //$LASTPOS=6004172;//user.Search:4172
            _this.end=(_this.isTerminal(_this.stationName));
            //$LASTPOS=6004209;//user.Search:4209
            if (_this.end==1) {
              //$LASTPOS=6004239;//user.Search:4239
              if (Tonyu.globals.$point!=0&&_this.savestation.length!=Tonyu.globals.$point) {
                //$LASTPOS=6004300;//user.Search:4300
                _this.stationName=_this.savestation[Tonyu.globals.$point];
                //$LASTPOS=6004347;//user.Search:4347
                Tonyu.globals.$point++;
                continue;
                
                
              }
              break;
              
              
            }
            //$LASTPOS=6004467;//user.Search:4467
            _this.sta=(_this.searchNextStation(_this.stationName,0));
            //$LASTPOS=6004513;//user.Search:4513
            _this.array = Array.isArray(_this.sta);
            
            //$LASTPOS=6004549;//user.Search:4549
            if (_this.array==false) {
              //$LASTPOS=6004577;//user.Search:4577
              _this.a=(_this.searchOwner(_this.sta));
              //$LASTPOS=6004609;//user.Search:4609
              if (_this.a==_this.so) {
                //$LASTPOS=6004634;//user.Search:4634
                _this.o=(_this.updateOwner(_this.s,_this.sta,0));
                break;
                
                
              }
              //$LASTPOS=6004699;//user.Search:4699
              _this.stationName=_this.sta;
              
            } else {
              //$LASTPOS=6004737;//user.Search:4737
              _this.savestation=_this.sta;
              //$LASTPOS=6004781;//user.Search:4781
              _this.stationName=_this.savestation[Tonyu.globals.$point];
              //$LASTPOS=6004824;//user.Search:4824
              Tonyu.globals.$point++;
              
            }
          }
        }
        //$LASTPOS=6004861;//user.Search:4861
        _this.print("");
        //$LASTPOS=6004872;//user.Search:4872
        _this.stationName=_this.s;
        //$LASTPOS=6004923;//user.Search:4923
        //$LASTPOS=6004927;//user.Search:4927
        _this.i=0;for (; _this.i<5 ; _this.i++) {
          Tonyu.checkLoop();
          {
            //$LASTPOS=6004952;//user.Search:4952
            _this.end=(_this.isTerminal(_this.stationName));
            //$LASTPOS=6004989;//user.Search:4989
            if (_this.end==2) {
              //$LASTPOS=6005019;//user.Search:5019
              if (Tonyu.globals.$point!=0&&_this.savestation.length!=Tonyu.globals.$point) {
                //$LASTPOS=6005080;//user.Search:5080
                _this.stationName=_this.savestation[Tonyu.globals.$point];
                //$LASTPOS=6005127;//user.Search:5127
                Tonyu.globals.$point++;
                continue;
                
                
              }
              break;
              
              
            }
            //$LASTPOS=6005242;//user.Search:5242
            _this.sta=(_this.searchNextStation(_this.stationName,1));
            //$LASTPOS=6005288;//user.Search:5288
            _this.array = Array.isArray(_this.sta);
            
            //$LASTPOS=6005324;//user.Search:5324
            if (_this.array==false) {
              //$LASTPOS=6005361;//user.Search:5361
              _this.a=(_this.searchOwner(_this.sta));
              //$LASTPOS=6005393;//user.Search:5393
              if (_this.a==_this.so) {
                //$LASTPOS=6005418;//user.Search:5418
                _this.o=(_this.updateOwner(_this.s,_this.sta,1));
                break;
                
                
              }
              //$LASTPOS=6005483;//user.Search:5483
              _this.stationName=_this.sta;
              
            } else {
              //$LASTPOS=6005521;//user.Search:5521
              _this.savestation=_this.sta;
              //$LASTPOS=6005565;//user.Search:5565
              _this.stationName=_this.savestation[Tonyu.globals.$point];
              //$LASTPOS=6005608;//user.Search:5608
              Tonyu.globals.$point++;
              
            }
          }
        }
        //$LASTPOS=6005629;//user.Search:5629
        _this.fireEvent("complete");
        
        _thread.retVal=_this;return;
      },
      searchNextStation :function _trc_Search_searchNextStation(stationName,direction) {
        "use strict";
        var _this=this;
        var station;
        var nextst;
        var z;
        var i;
        
        //$LASTPOS=6000098;//user.Search:98
        station = Tonyu.globals.$stations[stationName];
        
        //$LASTPOS=6000152;//user.Search:152
        nextst = station.nexts;
        
        //$LASTPOS=6000190;//user.Search:190
        _this.f=nextst.filter(Tonyu.bindFunc(_this,_this.isLineOf));
        //$LASTPOS=6000278;//user.Search:278
        if (_this.f.length>2) {
          //$LASTPOS=6000373;//user.Search:373
          z = [];
          
          //$LASTPOS=6000391;//user.Search:391
          //$LASTPOS=6000395;//user.Search:395
          i = 0;
          for (; i<_this.f.length ; i++) {
            Tonyu.checkLoop();
            {
              //$LASTPOS=6000432;//user.Search:432
              _this.nextDirection=(_this.searchDirection(_this.f[i],stationName));
              //$LASTPOS=6000510;//user.Search:510
              station = Tonyu.globals.$stations[stationName];
              
              //$LASTPOS=6000572;//user.Search:572
              nextst = station.nexts;
              
              //$LASTPOS=6000618;//user.Search:618
              _this.f=nextst.filter(Tonyu.bindFunc(_this,_this.isLineOf));
              //$LASTPOS=6000690;//user.Search:690
              if (_this.nextDirection==direction) {
                //$LASTPOS=6000738;//user.Search:738
                z.push(_this.f[i]);
                
              }
            }
          }
          return z;
          
        } else {
          //$LASTPOS=6000915;//user.Search:915
          _this.a=_this.isTerminal(stationName);
          //$LASTPOS=6000952;//user.Search:952
          if (_this.a==0) {
            return _this.f[direction];
            
          } else {
            //$LASTPOS=6001019;//user.Search:1019
            if (_this.a==1&&direction==1) {
              return _this.f[0];
              
            } else {
              //$LASTPOS=6001110;//user.Search:1110
              if (_this.a==1&&direction==0) {
                return null;
                
              } else {
                //$LASTPOS=6001193;//user.Search:1193
                if (_this.a==2&&direction==1) {
                  return null;
                  
                } else {
                  return _this.f[0];
                  
                }
              }
            }
          }
          
        }
      },
      fiber$searchNextStation :function _trc_Search_f_searchNextStation(_thread,stationName,direction) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        var station;
        var nextst;
        var z;
        var i;
        
        //$LASTPOS=6000098;//user.Search:98
        station = Tonyu.globals.$stations[stationName];
        
        //$LASTPOS=6000152;//user.Search:152
        nextst = station.nexts;
        
        //$LASTPOS=6000190;//user.Search:190
        _this.f=nextst.filter(Tonyu.bindFunc(_this,_this.isLineOf));
        
        _thread.enter(function _trc_Search_ent_searchNextStation(_thread) {
          if (_thread.lastEx) __pc=_thread.catchPC;
          for(var __cnt=100 ; __cnt--;) {
            switch (__pc) {
            case 0:
              //$LASTPOS=6000278;//user.Search:278
              if (!(_this.f.length>2)) { __pc=1     ; break; }
              //$LASTPOS=6000373;//user.Search:373
              z = [];
              
              //$LASTPOS=6000391;//user.Search:391
              //$LASTPOS=6000395;//user.Search:395
              i = 0;
              for (; i<_this.f.length ; i++) {
                Tonyu.checkLoop();
                {
                  //$LASTPOS=6000432;//user.Search:432
                  _this.nextDirection=(_this.searchDirection(_this.f[i],stationName));
                  //$LASTPOS=6000510;//user.Search:510
                  station = Tonyu.globals.$stations[stationName];
                  
                  //$LASTPOS=6000572;//user.Search:572
                  nextst = station.nexts;
                  
                  //$LASTPOS=6000618;//user.Search:618
                  _this.f=nextst.filter(Tonyu.bindFunc(_this,_this.isLineOf));
                  //$LASTPOS=6000690;//user.Search:690
                  if (_this.nextDirection==direction) {
                    //$LASTPOS=6000738;//user.Search:738
                    z.push(_this.f[i]);
                    
                  }
                }
              }
              _thread.exit(z);return;
              __pc=11    ;break;
            case 1     :
              //$LASTPOS=6000915;//user.Search:915
              _this.fiber$isTerminal(_thread, stationName);
              __pc=2;return;
            case 2:
              _this.a=_thread.retVal;
              
              //$LASTPOS=6000952;//user.Search:952
              if (!(_this.a==0)) { __pc=3     ; break; }
              _thread.exit(_this.f[direction]);return;
              __pc=10    ;break;
            case 3     :
              //$LASTPOS=6001019;//user.Search:1019
              if (!(_this.a==1&&direction==1)) { __pc=4     ; break; }
              _thread.exit(_this.f[0]);return;
              __pc=9     ;break;
            case 4     :
              //$LASTPOS=6001110;//user.Search:1110
              if (!(_this.a==1&&direction==0)) { __pc=5     ; break; }
              _thread.exit(null);return;
              __pc=8     ;break;
            case 5     :
              //$LASTPOS=6001193;//user.Search:1193
              if (!(_this.a==2&&direction==1)) { __pc=6     ; break; }
              _thread.exit(null);return;
              __pc=7     ;break;
            case 6     :
              _thread.exit(_this.f[0]);return;
            case 7     :
              
            case 8     :
              
            case 9     :
              
            case 10    :
              
            case 11    :
              
              _thread.exit(_this);return;
            }
          }
        });
      },
      searchDirection :function _trc_Search_searchDirection(stationName1,stationName2) {
        "use strict";
        var _this=this;
        var station;
        var nextst;
        
        //$LASTPOS=6001479;//user.Search:1479
        station = Tonyu.globals.$stations[stationName1];
        
        //$LASTPOS=6001534;//user.Search:1534
        nextst = station.nexts;
        
        //$LASTPOS=6001572;//user.Search:1572
        _this.f=nextst.filter(Tonyu.bindFunc(_this,_this.isLineOf));
        //$LASTPOS=6001628;//user.Search:1628
        if (_this.f.indexOf(stationName2)>- 1) {
          //$LASTPOS=6001700;//user.Search:1700
          _this.num=_this.f.indexOf(stationName2);
          //$LASTPOS=6001775;//user.Search:1775
          if (_this.num==0) {
            return 1;
            
          } else {
            return 0;
            
          }
          
        }
      },
      fiber$searchDirection :function _trc_Search_f_searchDirection(_thread,stationName1,stationName2) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        var station;
        var nextst;
        
        //$LASTPOS=6001479;//user.Search:1479
        station = Tonyu.globals.$stations[stationName1];
        
        //$LASTPOS=6001534;//user.Search:1534
        nextst = station.nexts;
        
        //$LASTPOS=6001572;//user.Search:1572
        _this.f=nextst.filter(Tonyu.bindFunc(_this,_this.isLineOf));
        //$LASTPOS=6001628;//user.Search:1628
        if (_this.f.indexOf(stationName2)>- 1) {
          //$LASTPOS=6001700;//user.Search:1700
          _this.num=_this.f.indexOf(stationName2);
          //$LASTPOS=6001775;//user.Search:1775
          if (_this.num==0) {
            _thread.retVal=1;return;
            
            
          } else {
            _thread.retVal=0;return;
            
            
          }
          
        }
        
        _thread.retVal=_this;return;
      },
      isLineOf :function _trc_Search_isLineOf(stationName) {
        "use strict";
        var _this=this;
        var station;
        var line;
        
        //$LASTPOS=6001992;//user.Search:1992
        station = Tonyu.globals.$stations[stationName];
        
        //$LASTPOS=6002046;//user.Search:2046
        line = station.lines;
        
        //$LASTPOS=6002106;//user.Search:2106
        if (line.indexOf(_this.lineName)>- 1) {
          return true;
          
        } else {
          return false;
          
        }
      },
      fiber$isLineOf :function _trc_Search_f_isLineOf(_thread,stationName) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        var station;
        var line;
        
        //$LASTPOS=6001992;//user.Search:1992
        station = Tonyu.globals.$stations[stationName];
        
        //$LASTPOS=6002046;//user.Search:2046
        line = station.lines;
        
        //$LASTPOS=6002106;//user.Search:2106
        if (line.indexOf(_this.lineName)>- 1) {
          _thread.retVal=true;return;
          
          
        } else {
          _thread.retVal=false;return;
          
          
        }
        
        _thread.retVal=_this;return;
      },
      isTerminal :function _trc_Search_isTerminal(stationName) {
        "use strict";
        var _this=this;
        var station;
        var nextst;
        var ns;
        
        //$LASTPOS=6002264;//user.Search:2264
        station = Tonyu.globals.$stations[stationName];
        
        //$LASTPOS=6002318;//user.Search:2318
        nextst = station.nexts;
        
        //$LASTPOS=6002356;//user.Search:2356
        _this.f=nextst.filter(Tonyu.bindFunc(_this,_this.isLineOf));
        //$LASTPOS=6002412;//user.Search:2412
        if (_this.f.length==1) {
          //$LASTPOS=6002462;//user.Search:2462
          ns = Tonyu.globals.$stations[_this.f[0]];
          
          //$LASTPOS=6002496;//user.Search:2496
          _this.n=ns.nexts;
          //$LASTPOS=6002518;//user.Search:2518
          _this.m=_this.n.filter(Tonyu.bindFunc(_this,_this.isLineOf));
          //$LASTPOS=6002589;//user.Search:2589
          if (stationName==_this.m[0]) {
            return 1;
            
          } else {
            //$LASTPOS=6002656;//user.Search:2656
            if (stationName==_this.m[1]) {
              return 2;
              
            } else {
              
              
            }
          }
          
        } else {
          return 0;
          
        }
      },
      fiber$isTerminal :function _trc_Search_f_isTerminal(_thread,stationName) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        var station;
        var nextst;
        var ns;
        
        //$LASTPOS=6002264;//user.Search:2264
        station = Tonyu.globals.$stations[stationName];
        
        //$LASTPOS=6002318;//user.Search:2318
        nextst = station.nexts;
        
        //$LASTPOS=6002356;//user.Search:2356
        _this.f=nextst.filter(Tonyu.bindFunc(_this,_this.isLineOf));
        //$LASTPOS=6002412;//user.Search:2412
        if (_this.f.length==1) {
          //$LASTPOS=6002462;//user.Search:2462
          ns = Tonyu.globals.$stations[_this.f[0]];
          
          //$LASTPOS=6002496;//user.Search:2496
          _this.n=ns.nexts;
          //$LASTPOS=6002518;//user.Search:2518
          _this.m=_this.n.filter(Tonyu.bindFunc(_this,_this.isLineOf));
          //$LASTPOS=6002589;//user.Search:2589
          if (stationName==_this.m[0]) {
            _thread.retVal=1;return;
            
            
          } else {
            //$LASTPOS=6002656;//user.Search:2656
            if (stationName==_this.m[1]) {
              _thread.retVal=2;return;
              
              
            } else {
              
              
            }
          }
          
        } else {
          _thread.retVal=0;return;
          
          
        }
        
        _thread.retVal=_this;return;
      },
      searchOwner :function _trc_Search_searchOwner(stationName) {
        "use strict";
        var _this=this;
        var staown;
        var owner;
        
        //$LASTPOS=6002919;//user.Search:2919
        if (Tonyu.globals.$owner[stationName]) {
          //$LASTPOS=6002952;//user.Search:2952
          staown = Tonyu.globals.$owner[stationName];
          
          //$LASTPOS=6002994;//user.Search:2994
          owner = staown.owner;
          
          return owner;
          
        }
      },
      fiber$searchOwner :function _trc_Search_f_searchOwner(_thread,stationName) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        var staown;
        var owner;
        
        //$LASTPOS=6002919;//user.Search:2919
        if (Tonyu.globals.$owner[stationName]) {
          //$LASTPOS=6002952;//user.Search:2952
          staown = Tonyu.globals.$owner[stationName];
          
          //$LASTPOS=6002994;//user.Search:2994
          owner = staown.owner;
          
          _thread.retVal=owner;return;
          
          
        }
        
        _thread.retVal=_this;return;
      },
      updateOwner :function _trc_Search_updateOwner(stationName,endStation,direction) {
        "use strict";
        var _this=this;
        var i;
        var st;
        var array;
        
        //$LASTPOS=6003151;//user.Search:3151
        //$LASTPOS=6003155;//user.Search:3155
        i = 0;
        for (; i<100 ; i++) {
          Tonyu.checkLoop();
          {
            //$LASTPOS=6003200;//user.Search:3200
            if (st==endStation) {
              //$LASTPOS=6003234;//user.Search:3234
              if (Tonyu.globals.$p!=0&&_this.savest.length!=Tonyu.globals.$point) {
                //$LASTPOS=6003290;//user.Search:3290
                stationName=_this.savest[Tonyu.globals.$p];
                //$LASTPOS=6003332;//user.Search:3332
                Tonyu.globals.$p++;
                continue;
                
                
              }
              break;
              
              
            }
            //$LASTPOS=6003415;//user.Search:3415
            st = (_this.searchNextStation(stationName,direction));
            
            //$LASTPOS=6003485;//user.Search:3485
            array = Array.isArray(st);
            
            //$LASTPOS=6003524;//user.Search:3524
            if (array==false) {
              //$LASTPOS=6003589;//user.Search:3589
              if (! Tonyu.globals.$owner[st]) {
                //$LASTPOS=6003623;//user.Search:3623
                Tonyu.globals.$owner[st]={owner: 0};
                
              }
              //$LASTPOS=6003671;//user.Search:3671
              Tonyu.globals.$owner[st].owner=Tonyu.globals.$turn;
              //$LASTPOS=6003709;//user.Search:3709
              stationName=st;
              
            } else {
              //$LASTPOS=6003754;//user.Search:3754
              _this.savest=st;
              //$LASTPOS=6003795;//user.Search:3795
              if (! Tonyu.globals.$owner[st[Tonyu.globals.$p]]) {
                //$LASTPOS=6003833;//user.Search:3833
                Tonyu.globals.$owner[st[Tonyu.globals.$p]]={owner: 0};
                
              }
              //$LASTPOS=6003885;//user.Search:3885
              Tonyu.globals.$owner[st[Tonyu.globals.$p]].owner=Tonyu.globals.$turn;
              //$LASTPOS=6003927;//user.Search:3927
              stationName=_this.savest[Tonyu.globals.$p];
              //$LASTPOS=6003965;//user.Search:3965
              Tonyu.globals.$p++;
              
            }
          }
        }
      },
      fiber$updateOwner :function _trc_Search_f_updateOwner(_thread,stationName,endStation,direction) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        var i;
        var st;
        var array;
        
        //$LASTPOS=6003151;//user.Search:3151
        //$LASTPOS=6003155;//user.Search:3155
        i = 0;
        for (; i<100 ; i++) {
          Tonyu.checkLoop();
          {
            //$LASTPOS=6003200;//user.Search:3200
            if (st==endStation) {
              //$LASTPOS=6003234;//user.Search:3234
              if (Tonyu.globals.$p!=0&&_this.savest.length!=Tonyu.globals.$point) {
                //$LASTPOS=6003290;//user.Search:3290
                stationName=_this.savest[Tonyu.globals.$p];
                //$LASTPOS=6003332;//user.Search:3332
                Tonyu.globals.$p++;
                continue;
                
                
              }
              break;
              
              
            }
            //$LASTPOS=6003415;//user.Search:3415
            st = (_this.searchNextStation(stationName,direction));
            
            //$LASTPOS=6003485;//user.Search:3485
            array = Array.isArray(st);
            
            //$LASTPOS=6003524;//user.Search:3524
            if (array==false) {
              //$LASTPOS=6003589;//user.Search:3589
              if (! Tonyu.globals.$owner[st]) {
                //$LASTPOS=6003623;//user.Search:3623
                Tonyu.globals.$owner[st]={owner: 0};
                
              }
              //$LASTPOS=6003671;//user.Search:3671
              Tonyu.globals.$owner[st].owner=Tonyu.globals.$turn;
              //$LASTPOS=6003709;//user.Search:3709
              stationName=st;
              
            } else {
              //$LASTPOS=6003754;//user.Search:3754
              _this.savest=st;
              //$LASTPOS=6003795;//user.Search:3795
              if (! Tonyu.globals.$owner[st[Tonyu.globals.$p]]) {
                //$LASTPOS=6003833;//user.Search:3833
                Tonyu.globals.$owner[st[Tonyu.globals.$p]]={owner: 0};
                
              }
              //$LASTPOS=6003885;//user.Search:3885
              Tonyu.globals.$owner[st[Tonyu.globals.$p]].owner=Tonyu.globals.$turn;
              //$LASTPOS=6003927;//user.Search:3927
              stationName=_this.savest[Tonyu.globals.$p];
              //$LASTPOS=6003965;//user.Search:3965
              Tonyu.globals.$p++;
              
            }
          }
        }
        
        _thread.retVal=_this;return;
      },
      __dummy: false
    };
  },
  decls: {"methods":{"main":{"nowait":false},"searchNextStation":{"nowait":false},"searchDirection":{"nowait":false},"isLineOf":{"nowait":false},"isTerminal":{"nowait":false},"searchOwner":{"nowait":false},"updateOwner":{"nowait":false}},"fields":{"array":{},"s":{},"stationName":{},"so":{},"i":{},"end":{},"savestation":{},"sta":{},"a":{},"o":{},"f":{},"nextDirection":{},"num":{},"lineName":{},"n":{},"m":{},"savest":{}}}
});
Tonyu.klass.define({
  fullName: 'user.Searcher',
  shortName: 'Searcher',
  namespace: 'user',
  superclass: Tonyu.classes.kernel.Actor,
  includes: [],
  methods: function (__superClass) {
    return {
      main :function _trc_Searcher_main() {
        "use strict";
        var _this=this;
        var _it_39;
        var _it_40;
        
        //$LASTPOS=7000000;//user.Searcher:0
        "field strict";
        
        
        //$LASTPOS=7000056;//user.Searcher:56
        _this.current = _this.from;
        
        //$LASTPOS=7000074;//user.Searcher:74
        _this.path.add(_this.current);
        //$LASTPOS=7000093;//user.Searcher:93
        while (true) {
          Tonyu.checkLoop();
          //$LASTPOS=7000111;//user.Searcher:111
          if (_this.current===_this.to) {
            //$LASTPOS=7000139;//user.Searcher:139
            _this.report([_this.path]);
            break;
            
            
          }
          //$LASTPOS=7000180;//user.Searcher:180
          _this.x=_this.current.x;
          //$LASTPOS=7000197;//user.Searcher:197
          _this.y=_this.current.y;
          //$LASTPOS=7000214;//user.Searcher:214
          _this.neighbors = [];
          
          //$LASTPOS=7000236;//user.Searcher:236
          _it_39=Tonyu.iterator(_this.current.allConnected(),1);
          while(_it_39.next()) {
            _this.neighbor=_it_39[0];
            
            //$LASTPOS=7000291;//user.Searcher:291
            if (_this.path.contains(_this.neighbor)) {
              continue;
              
            }
            //$LASTPOS=7000338;//user.Searcher:338
            _this.neighbors.push(_this.neighbor);
            
          }
          //$LASTPOS=7000374;//user.Searcher:374
          if (_this.neighbors.length==0) {
            //$LASTPOS=7000409;//user.Searcher:409
            _this.path.die();
            //$LASTPOS=7000429;//user.Searcher:429
            _this.report([]);
            
          } else {
            //$LASTPOS=7000452;//user.Searcher:452
            if (_this.neighbors.length==1) {
              //$LASTPOS=7000487;//user.Searcher:487
              _this.current=_this.neighbors[0];
              //$LASTPOS=7000517;//user.Searcher:517
              _this.path.add(_this.current);
              
            } else {
              //$LASTPOS=7000557;//user.Searcher:557
              _this.count = _this.neighbors.length;
              
              //$LASTPOS=7000593;//user.Searcher:593
              _it_40=Tonyu.iterator(_this.neighbors,1);
              while(_it_40.next()) {
                _this.neighbor=_it_40[0];
                
                //$LASTPOS=7000639;//user.Searcher:639
                _this.s = new Tonyu.classes.user.Searcher({from: _this.neighbor,to: _this.to,path: _this.path.clone()});
                
                //$LASTPOS=7000709;//user.Searcher:709
                _this.allPaths = [];
                
                //$LASTPOS=7000738;//user.Searcher:738
                _this.s.on("result",(function anonymous_753(paths) {
                  
                  //$LASTPOS=7000780;//user.Searcher:780
                  _this.allPaths=_this.allPaths.concat(paths);
                  //$LASTPOS=7000829;//user.Searcher:829
                  _this.count--;
                  //$LASTPOS=7000854;//user.Searcher:854
                  if (_this.count==0) {
                    //$LASTPOS=7000890;//user.Searcher:890
                    _this.report(_this.allPaths);
                    
                  }
                }));
                
              }
              //$LASTPOS=7000959;//user.Searcher:959
              _this.path.die();
              //$LASTPOS=7000979;//user.Searcher:979
              _this.alpha=128;
              break;
              
              
            }
          }
          //$LASTPOS=7001015;//user.Searcher:1015
          _this.updateEx(5);
          
        }
      },
      fiber$main :function _trc_Searcher_f_main(_thread) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        var _it_39;
        var _it_40;
        
        //$LASTPOS=7000000;//user.Searcher:0
        "field strict";
        
        
        //$LASTPOS=7000056;//user.Searcher:56
        _this.current = _this.from;
        
        //$LASTPOS=7000074;//user.Searcher:74
        _this.path.add(_this.current);
        
        _thread.enter(function _trc_Searcher_ent_main(_thread) {
          if (_thread.lastEx) __pc=_thread.catchPC;
          for(var __cnt=100 ; __cnt--;) {
            switch (__pc) {
            case 0:
              //$LASTPOS=7000093;//user.Searcher:93
            case 1:
              //$LASTPOS=7000111;//user.Searcher:111
              if (!(_this.current===_this.to)) { __pc=3     ; break; }
              //$LASTPOS=7000139;//user.Searcher:139
              _this.fiber$report(_thread, [_this.path]);
              __pc=2;return;
            case 2:
              
              __pc=12    ; break;
              
            case 3     :
              
              //$LASTPOS=7000180;//user.Searcher:180
              _this.x=_this.current.x;
              //$LASTPOS=7000197;//user.Searcher:197
              _this.y=_this.current.y;
              //$LASTPOS=7000214;//user.Searcher:214
              _this.neighbors = [];
              
              //$LASTPOS=7000236;//user.Searcher:236
              _it_39=Tonyu.iterator(_this.current.allConnected(),1);
              while(_it_39.next()) {
                _this.neighbor=_it_39[0];
                
                //$LASTPOS=7000291;//user.Searcher:291
                if (_this.path.contains(_this.neighbor)) {
                  continue;
                  
                }
                //$LASTPOS=7000338;//user.Searcher:338
                _this.neighbors.push(_this.neighbor);
                
              }
              //$LASTPOS=7000374;//user.Searcher:374
              if (!(_this.neighbors.length==0)) { __pc=5     ; break; }
              //$LASTPOS=7000409;//user.Searcher:409
              _this.path.die();
              //$LASTPOS=7000429;//user.Searcher:429
              _this.fiber$report(_thread, []);
              __pc=4;return;
            case 4:
              
              __pc=10    ;break;
            case 5     :
              //$LASTPOS=7000452;//user.Searcher:452
              if (!(_this.neighbors.length==1)) { __pc=6     ; break; }
              {
                //$LASTPOS=7000487;//user.Searcher:487
                _this.current=_this.neighbors[0];
                //$LASTPOS=7000517;//user.Searcher:517
                _this.path.add(_this.current);
              }
              __pc=9     ;break;
            case 6     :
              //$LASTPOS=7000557;//user.Searcher:557
              _this.count = _this.neighbors.length;
              
              //$LASTPOS=7000593;//user.Searcher:593
              _it_40=Tonyu.iterator(_this.neighbors,1);
            case 7:
              if (!(_it_40.next())) { __pc=8     ; break; }
              _this.neighbor=_it_40[0];
              
              //$LASTPOS=7000639;//user.Searcher:639
              _this.s = new Tonyu.classes.user.Searcher({from: _this.neighbor,to: _this.to,path: _this.path.clone()});
              
              //$LASTPOS=7000709;//user.Searcher:709
              _this.allPaths = [];
              
              //$LASTPOS=7000738;//user.Searcher:738
              _this.s.on("result",(function anonymous_753(paths) {
                
                //$LASTPOS=7000780;//user.Searcher:780
                _this.allPaths=_this.allPaths.concat(paths);
                //$LASTPOS=7000829;//user.Searcher:829
                _this.count--;
                //$LASTPOS=7000854;//user.Searcher:854
                if (_this.count==0) {
                  //$LASTPOS=7000890;//user.Searcher:890
                  _this.report(_this.allPaths);
                  
                }
              }));
              __pc=7;break;
            case 8     :
              
              //$LASTPOS=7000959;//user.Searcher:959
              _this.path.die();
              //$LASTPOS=7000979;//user.Searcher:979
              _this.alpha=128;
              __pc=12    ; break;
              
            case 9     :
              
            case 10    :
              
              //$LASTPOS=7001015;//user.Searcher:1015
              _this.fiber$updateEx(_thread, 5);
              __pc=11;return;
            case 11:
              
              __pc=1;break;
            case 12    :
              
              _thread.exit(_this);return;
            }
          }
        });
      },
      report :function _trc_Searcher_report(paths) {
        "use strict";
        var _this=this;
        
        //$LASTPOS=7001051;//user.Searcher:1051
        _this.fireEvent("result",paths);
        //$LASTPOS=7001082;//user.Searcher:1082
        _this.die();
      },
      fiber$report :function _trc_Searcher_f_report(_thread,paths) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        
        //$LASTPOS=7001051;//user.Searcher:1051
        _this.fireEvent("result",paths);
        //$LASTPOS=7001082;//user.Searcher:1082
        _this.die();
        
        _thread.retVal=_this;return;
      },
      __dummy: false
    };
  },
  decls: {"methods":{"main":{"nowait":false},"report":{"nowait":false}},"fields":{"path":{},"from":{},"to":{},"current":{},"neighbors":{},"neighbor":{},"count":{},"s":{},"allPaths":{}}}
});
Tonyu.klass.define({
  fullName: 'user.StationPlace',
  shortName: 'StationPlace',
  namespace: 'user',
  superclass: Tonyu.classes.kernel.Actor,
  includes: [],
  methods: function (__superClass) {
    return {
      main :function _trc_StationPlace_main() {
        "use strict";
        var _this=this;
        var _it_55;
        
        //$LASTPOS=8000000;//user.StationPlace:0
        _this.f=_this.file("location.txt");
        //$LASTPOS=8000024;//user.StationPlace:24
        Tonyu.globals.$stationPlace=[];
        //$LASTPOS=8000042;//user.StationPlace:42
        Tonyu.globals.$pixelPerDegree=3000;
        //$LASTPOS=8000085;//user.StationPlace:85
        _this.name;
        //$LASTPOS=8000091;//user.StationPlace:91
        _it_55=Tonyu.iterator(_this.f.lines(),1);
        while(_it_55.next()) {
          _this.line=_it_55[0];
          
          //$LASTPOS=8000123;//user.StationPlace:123
          _this.field=_this.line.split("\t");
          //$LASTPOS=8000151;//user.StationPlace:151
          _this.a=_this.field[1].split(",");
          //$LASTPOS=8000178;//user.StationPlace:178
          _this.ax=(_this.a[0]-139.7671248)*Tonyu.globals.$pixelPerDegree;
          //$LASTPOS=8000221;//user.StationPlace:221
          _this.ay=- (_this.a[1]-35.6812362)*Tonyu.globals.$pixelPerDegree;
          //$LASTPOS=8000269;//user.StationPlace:269
          _this.name=_this.field[0];
          //$LASTPOS=8000288;//user.StationPlace:288
          if ((_this.ax>=- 800&&_this.ay>- 500)&&_this.ax<700&&_this.ay<500) {
            //$LASTPOS=8000337;//user.StationPlace:337
            Tonyu.globals.$stationPlace.push({name: _this.name,x: _this.ax,y: _this.ay});
            //$LASTPOS=8000388;//user.StationPlace:388
            _this.update();
            
          }
          
        }
      },
      fiber$main :function _trc_StationPlace_f_main(_thread) {
        "use strict";
        var _this=this;
        //var _arguments=Tonyu.A(arguments);
        var __pc=0;
        var _it_55;
        
        
        _thread.enter(function _trc_StationPlace_ent_main(_thread) {
          if (_thread.lastEx) __pc=_thread.catchPC;
          for(var __cnt=100 ; __cnt--;) {
            switch (__pc) {
            case 0:
              //$LASTPOS=8000000;//user.StationPlace:0
              _this.fiber$file(_thread, "location.txt");
              __pc=1;return;
            case 1:
              _this.f=_thread.retVal;
              
              //$LASTPOS=8000024;//user.StationPlace:24
              Tonyu.globals.$stationPlace=[];
              //$LASTPOS=8000042;//user.StationPlace:42
              Tonyu.globals.$pixelPerDegree=3000;
              //$LASTPOS=8000085;//user.StationPlace:85
              _this.name;
              //$LASTPOS=8000091;//user.StationPlace:91
              _it_55=Tonyu.iterator(_this.f.lines(),1);
            case 2:
              if (!(_it_55.next())) { __pc=5     ; break; }
              _this.line=_it_55[0];
              
              //$LASTPOS=8000123;//user.StationPlace:123
              _this.field=_this.line.split("\t");
              //$LASTPOS=8000151;//user.StationPlace:151
              _this.a=_this.field[1].split(",");
              //$LASTPOS=8000178;//user.StationPlace:178
              _this.ax=(_this.a[0]-139.7671248)*Tonyu.globals.$pixelPerDegree;
              //$LASTPOS=8000221;//user.StationPlace:221
              _this.ay=- (_this.a[1]-35.6812362)*Tonyu.globals.$pixelPerDegree;
              //$LASTPOS=8000269;//user.StationPlace:269
              _this.name=_this.field[0];
              //$LASTPOS=8000288;//user.StationPlace:288
              if (!((_this.ax>=- 800&&_this.ay>- 500)&&_this.ax<700&&_this.ay<500)) { __pc=4     ; break; }
              //$LASTPOS=8000337;//user.StationPlace:337
              Tonyu.globals.$stationPlace.push({name: _this.name,x: _this.ax,y: _this.ay});
              //$LASTPOS=8000388;//user.StationPlace:388
              _this.fiber$update(_thread);
              __pc=3;return;
            case 3:
              
            case 4     :
              
              __pc=2;break;
            case 5     :
              
              _thread.exit(_this);return;
            }
          }
        });
      },
      __dummy: false
    };
  },
  decls: {"methods":{"main":{"nowait":false}},"fields":{"line":{},"f":{},"name":{},"field":{},"a":{},"ax":{},"ay":{}}}
});

//# sourceMappingURL=concat.js.map